["Die Internet Movie Database (IMDb, Englisch für Internet-Filmdatenbank) ist eine Datenbank zu Filmen, Fernsehserien, Videoproduktionen und Computerspielen sowie über Personen, die daran mitgewirkt haben. Im Januar 2020 gab es Einträge zu über 7,55 Millionen Filmproduktionen (davon 5,34 Millionen Fernsehepisoden) und zu über 11,21 Millionen Film- und Fernsehschaffenden. Betrieben wird die Datenbank seit 1998 von Amazon.\nDie Nutzung der Grundversion ist kostenlos, gegen Bezahlung bietet IMDbPro ein zusätzliches Informationsangebot (darunter aktuelle Statistiken zu Einspielerlösen, Zugriffsstatistiken und Agenten-Kontakte).\n\n\n== Inhalt ==\nIn der Datenbank werden Daten von Kino-, Video- und Fernsehfilmen sowie Computerspielen gesammelt, die seit Beginn der Kinematographie produziert wurden. Ein Großteil der Kinofilme der westlichen Welt ist schon in der Datenbank repräsentiert, wohingegen vor allem bei Fernsehproduktionen Lücken bestehen. Anders als bei ähnlichen Projekten werden auch pornografische Produktionen archiviert. Informationen und Profile zu Filmen oder Filmschaffenden können von den Benutzern (nach vorheriger Registrierung) angelegt werden. Diese werden von der Redaktion gegengeprüft und in der Regel nach einigen Tagen oder Wochen veröffentlicht. Allerdings ist nicht jede veröffentlichte Information zwangsläufig zutreffend.\nEs kann sowohl nach Filmen als auch nach Personen, Film-Charakteren, Zitaten, innerhalb von Biografien sowie (über verschiedene erweiterte Suchen) nach vielen weiteren Angaben gesucht werden. Der Umfang der angebotenen Informationen ist abhängig vom Bekanntheitsgrad der Filme und Personen oder davon, wie viel Material durch interessierte Personen an IMDb übermittelt wurde. Da Filme und Stars aus Hollywood weltweit am bekanntesten sind, gibt es hierzu meist auch besonders viele Informationen.\nBesucher können zu Filmen Bewertungen abgeben, die dann nach einem auf der Bayesschen Wahrscheinlichkeitsverteilung beruhenden System ausgewertet werden. Zum einen wird ab fünf abgegebenen Stimmen ein Durchschnittswert zum Film berechnet, zum anderen nach einem weiteren Berechnungssystem eine Liste der 250 (in der IMDbPro-Version 500) besten und 100 schlechtesten Filme erstellt. Seit Juli 2006 kann man nicht mehr nur Filme, sondern auch Fernsehserien und einzelne Episoden bewerten.\nFrüher wurde die Website unter der Adresse german.imdb.com mit einer deutschsprachigen Navigation angeboten, die auch deutsche Filmtitel berücksichtigte. Ab November 2008 gab es die deutsche, erheblich abgespeckte Version imdb.de, und Sprachversionen auf Französisch und Italienisch; später kamen Versionen auf Polnisch, Portugiesisch, Rumänisch, Spanisch, Türkisch und Ungarisch hinzu. Die nicht-englischsprachigen Datensätze enthielten im Regelfall nur wenige Basisangaben für jeden Film und blendeten nur auf Englisch vorliegende Zusatzangaben wie inhaltliche Zusammenfassungen, Filmfehler, Auszeichnungen, Links zu Trailern und weitere Menüpunkte aus. Im Februar 2013 wurden die nicht-englischsprachigen Versionen der Seite abgeschafft. Als Grund dafür wurde angegeben, dass man jedem Benutzer die große Informations- und Funktionsvielfalt, die die englischsprachige Seite bietet, zur Verfügung stellen wolle. Eine internationale Version liefert zu jedem Film die Verleihtitel in allen erfassten Sprachen.\n2007 wurden in der IMDb zwei größere Neuerungen eingeführt. In einer FAQ genannten Sektion können Detailfragen erörtert werden. Diese werden ähnlich einem Wiki ohne redaktionelle Überprüfung in Echtzeit dargeboten und ergänzen das schon angebotene Programm an Diskussionsforen. Des Weiteren können Charakterseiten angelegt werden. Hier kann man auf einer den biografischen Artikeln nachempfundenen Seite die Filmdaten von realen Figuren (beispielsweise Gaius Iulius Caesar) oder fiktiven Figuren (beispielsweise James Bond) sammeln und Biografien verfassen sowie Zitate und Trivia angeben. Diese Daten werden relativ schnell ergänzt. Die IMDb gibt hierfür eine Wartezeit von sechs Stunden an.\n\n\n== Geschichte ==\nDer Ursprung der IMDb liegt in der Newsgroup rec.arts.movies, einer Diskussionsplattform für Filmbegeisterte. Weit vor 1990 begannen einige Teilnehmer damit, Listen über Schauspieler, Regisseure und anderes zu führen und regelmäßig über rec.arts.movies zu veröffentlichen. Im Oktober 1990 fanden sich in diesen von Hand geführten Listen über 23.000 Einträge, die Col Needham mit Hilfe einiger Programme zusammenführte und durchsuchbar machte – das Ergebnis war die Internet Movie Database: Episode I – The Text-Only Unix Version. Das System war mit dem heutigen kaum vergleichbar. Damals musste noch jeder Benutzer die gesamte Datenbank auf seinen eigenen Rechner kopieren, um sie benutzen zu können.\n1994 wurde die Datenbank per E-Mail zugänglich. Kurz darauf nahm die erste Web-Version Gestalt an.\nDie steigende Anzahl von Benutzern und Daten machte es 1996 erforderlich, dass das private Projekt IMDb unter heftigen Debatten pro/contra Kommerzialisierung in eine Firma umgewandelt wurde. Eigentümer der Firma waren diejenigen, die auch bislang die Listen geführt hatten. Die Arbeit an der IMDb und für die Internet Movie Database, Ltd. erledigten sie meist neben Schule, Studium und Beruf.\nBis 1998 hatte sich die Größe der IMDb gegenüber 1996 nochmals verdoppelt, und der Ressourcenbedarf drohte die Möglichkeiten ihrer nebenberuflich und praktisch unentgeltlich arbeitenden Eigentümer zu übersteigen. Wegen der Befürchtung, dass das Projekt in seine Bestandteile zerlegt werden würde, wurden zunächst mehrere Kaufangebote ausgeschlagen. 1998 ging die IMDb dann an das Internet-Versandhaus Amazon.Jeff Bezos, Gründer, Besitzer und CEO von Amazon.com, kaufte die IMDb von Col Needham und anderen wesentlichen Mitarbeitern der Datenbank, um es als eine Submarke in Amazon einzugliedern. Dieses Geschäft gab der IMDb die Möglichkeit, den Mitarbeitern an der Datenbank ein Gehalt zu zahlen, während Amazon die Datenbank als Werbeplattform für den Verkauf von DVDs und Videokassetten nutzte.\nSeit dem 15. Januar 2002 gibt es das Abonnement IMDbPro, das zusätzliche Informationen zu Filmproduktionen, Einspielergebnisse und ein Unternehmensverzeichnis bietet. Manche Informationen sind ohne Abonnement nicht mehr in der IMDb verfügbar, beispielsweise der Eintrag des Computeranimations-Studios Pixar.Ab 2003 erhielten Nutzer, die unter den „Top 100 Beitragenden“ von Fakten waren, für das folgende Kalenderjahr Gratiszugang zu IMDbPro. 2006 wurde dieser auf die Top 150 Mitwirkenden und 2010 auf die Top 250 erweitert.\nSeit Anfang 2004 ist die IMDb nicht mehr per E-Mail erweiterbar, sondern nur noch von registrierten Nutzern über die Website zu bearbeiten.\n2008 startete IMDb mit IMDb.de ihre erste offizielle fremdsprachige Version. Im selben Jahr erwarb die Filmdatenbank die beiden Firmen Withoutabox und Box Office Mojo.\nDie Wurzeln der IMDb sind auch heute noch erkennbar. Die Datenbank lebt zu großen Teilen nach wie vor von der Mitwirkung der Online-Community und gibt den Großteil ihrer Bestände nach wie vor kostenfrei an die Community zurück, nicht nur über die Portalseite, sondern den größten Teil auch in Form von Rohdaten.\n2016 erließ der Staat Kalifornien ein erkennbar auf die IMDb zugeschnittenes Gesetz. Danach dürfen Websites Altersangaben über natürliche Personen nicht mehr nennen, wenn die Person in der Unterhaltungsbranche arbeitet. Damit soll der Altersdiskriminierung in Hollywood begegnet werden. Die IMDb hat deswegen gegen die kalifornische Justizministerin Kamala Harris Klage erhoben. Am 22. Februar 2017 entschied ein Gericht, dass das Gesetz gegen die Redefreiheit verstößt. Die Regierung Kaliforniens habe zudem nicht nachgewiesen, dass das Gesetz zur Bekämpfung der Altersdiskriminierung geeignet sei. Daher darf das Gesetz bis zur endgültigen Entscheidung nicht vollstreckt werden. Das US-Bundesbezirksgericht für Nordkalifornien entschied 2018, dass das Gesetz verfassungswidrig ist.In Februar 2017 wurde die Kommentarfunktion entfernt.\n\n\n== Bewertungen in der IMDb ==\nRegistrierte Nutzer können mit ein bis zehn Punkten alle Filme bewerten. Sind mindestens fünf Bewertungen zusammengekommen, wird ein Durchschnittswert veröffentlicht. Haben noch viel mehr Personen eine Bewertung abgegeben, kann der Film bei genügend hoher – oder tiefer – Punktzahl in der Rangliste der 250 besten (mit einem Minimum von 25.000 Stimmen) oder 100 schlechtesten (mit einem Minimum von 10.000 Stimmen) Filme erscheinen. Diese Listen gibt es global für alle Filme und für Filmgenres (unter anderem Dokumentationen, Kriegsfilme, Dramen, Komödien, Fantasy und Horror). In den Listen für spezielle Filmgenres sind jeweils die fünfzig besten und zehn schlechtesten Filme des entsprechenden Genres aufgelistet. Ebenso kann man auf den personenbezogenen Artikeln unter „sorted by rating“ sehen, wie gut die Filme eines Regisseurs oder eines Schauspielers untereinander abschneiden.\nWelche Filme in die Top 250 kommen, entscheidet sich nach folgendem Verfahren: Als erstes werden alle Filme aussortiert, die weniger als die (willkürlich) festgelegte Mindeststimmanzahl (siehe Tabelle) haben. Des Weiteren werden Kurzfilme, Episoden von Serien oder andere nicht zugelassene Genres aussortiert (zum Beispiel sind keine Dokumentationen in den Top 250 zugelassen). Jedem der noch übrigen Filme wird nun eine Wertungszahl gegeben. Diese berechnet sich aus den abgegebenen Bewertungen der Benutzer, ist aber nicht der reine Durchschnitt. Durch ein besonderes Verfahren sollen abgegebene Bewertungen „regelmäßiger Bewerter“ (regular voters) besser zur Geltung kommen. Das genaue Verfahren wird von der IMDb aber geheim gehalten, um eventuellen Manipulationen vorzubeugen. Daher kann sich die hier errechnete Wertungszahl von der auf der IMDb-Seite des entsprechenden Filmes angezeigten Durchschnittsbewertung unterscheiden. Nach der errechneten Wertungszahl werden die Filme nun absteigend sortiert. Die ersten 250 Filme dieser Sortierung ergeben die Top 250. Die IMDb gibt zwar nicht das Verfahren für die Berechnung der Wertungszahl an, für die Filme der Top 250 gibt sie jedoch das Ergebnis, die Wertungszahl selbst, an. Ist ein Film außerhalb der Top 250, so wird die Wertungszahl jedoch verheimlicht. Folglich ist es schwer einzuschätzen, wie weit ein bestimmter Film von einer tatsächlichen Aufnahme in die Top 250 entfernt ist. In der Regel unterscheiden sich Durchschnittsbewertung und Wertungszahl jedoch um deutlich weniger als einen Bewertungspunkt. Die Filme haben am unteren Ende der Top 250 eine Wertungszahl von 8,0 und eine Durchschnittsbewertung von 8,0 bis 8,2. Ordnet man die für die Top 250 zugelassenen Filme nach der Durchschnittsbewertung und betrachtet bezüglich dieser Sortierung die ersten 250 Filme, so stellt man fest, dass die Filme dieser Liste zu 90 % mit den Filmen der Top 250 übereinstimmen (Stand: 2. Oktober 2014). Die fehlenden 25 Filme (10 %) findet man auf den Plätzen 251 bis 308 wieder. Der beste Film nach Durchschnittsbewertung, der sich nicht in den Top 250 befindet, steht in der eben beschriebenen Liste auf Platz 80, heißt Chak De! India – Ein unschlagbares Team und hat eine Durchschnittsbewertung von 8,4 bei über 28.000 Stimmen. Seine Wertungszahl ist zwar nicht bekannt, kann aber, weil der Film nicht in den Top 250 auftaucht, bestenfalls 8,0 sein. Durch die reine Beschränkung auf Filme mit mehr als 25.000 Bewertungen sind nichtenglischsprachige Filme und ältere Filme, die beide normalerweise weniger Bewertungen haben, vergleichsweise sehr viel seltener in der Liste vertreten.\nIn der Bezahlvariante der Website, IMDbPro, werden die Top 500 angezeigt.\nDer Betrieb der Diskussionsforen wurde von IMDb am 20. Februar 2017 eingestellt. Als Grund wurde angegeben, dass die Foren keine positive bzw. nützliche Erfahrung („positive, useful experience“) für die große Mehrheit der monatlich über 250 Millionen Nutzer darstellten.\n\n\n== Amazon Freevee ==\n\nAmazon Freevee (ehemals IMDb TV)  ist ein werbefinanzierter Video-on-Demand-Streamingdienst unter anderem auch bekannt als Advertising Video-on-Demand (AVoD, deutsch werbefinanziertes Video auf Anforderung), der zu Amazon gehört. Der Dienst startete in den USA seit Januar 2019 und in Vereinigten Königreich seit September 2021. Laut einer Quelle aus 2020 ist das Ziel von Amazon auch die Markteinführung in Mexiko, Südamerika und ganz Europa. Im Jahr 2022 wird der Dienst auch in Deutschland zur Verfügung stehen.\n\n\n== Ähnliche Projekte ==\nNach dem Vorbild der IMDb sind weitere Projekte entstanden. Seit 2004 existiert die Internet Movie Cars Database (IMCDb), in der anhand von Standbildern in Filmen gezeigte Kraftfahrzeuge aufgelistet und auf Eigenschaften wie Marke, Modell und Modelljahr hin identifiziert werden. Anders als die IMDb umfasst die IMCDb aber keine Computer- und Videospiele – hierfür wurde 2006 der Fork Internet Game Cars Database (IGCD) eingerichtet. Die 2007 ins Leben gerufene Internet Movie Firearms Database (IMFDb) listet die in Filmen und Videospielen verwendeten Schusswaffen auf, ist aber anders als die IMCDb als Wiki aufgebaut. Darüber hinaus gibt es seit 2009 die Internet Movie Plane Database (IMPDb) als Wiki über verwendete Flugzeuge und Hubschrauber. Eine Auswahl von Filmskripten listet die Internet Movie Script Database (IMSDb) auf.\nFür Pornofilme und deren Darsteller ist die Internet Adult Film Database entstanden.\n\n\n== Statistik ==\nLaut Alexa rangiert die Website imdb.com auf Platz 62 der beliebtesten Websites im Internet.\n\n\n== Siehe auch ==\nFilmdatenbank\nDie Top 250 Filme auf IMDb\n\n\n== Weblinks ==\nIMDb.com (englisch)\nChristian Stöcker: 20 Jahre Internet Movie Database: Im Clubhaus der Kinojunkies. In: Spiegel Online. 9. Oktober 2010; abgerufen am 4. November 2020. \nPeter Osteried: 30 Jahre IMDb: Die größte Filmdatenbank der Welt. In: Golem.de. 3. November 2020; abgerufen am 4. November 2020. \n\n\n== Anmerkungen ==\n\n\n== Einzelnachweise ==", "Eine Datenbank, auch Datenbanksystem genannt, ist ein System zur elektronischen Datenverwaltung. Die wesentliche Aufgabe einer Datenbank ist es, große Datenmengen effizient, widerspruchsfrei und dauerhaft zu speichern und benötigte Teilmengen in unterschiedlichen, bedarfsgerechten Darstellungsformen für Benutzer und Anwendungsprogramme bereitzustellen.\nEine Datenbank besteht aus zwei Teilen: der Verwaltungssoftware, genannt Datenbankmanagementsystem (DBMS), und der Menge der zu verwaltenden Daten, der Datenbank (DB) im engeren Sinn, zum Teil auch „Datenbasis“ genannt. Die Verwaltungssoftware organisiert intern die strukturierte Speicherung der Daten und kontrolliert alle lesenden und schreibenden Zugriffe auf die Datenbank. Zur Abfrage und Verwaltung der Daten bietet ein Datenbanksystem eine Datenbanksprache an.\nDie gebräuchlichste Form einer Datenbank ist eine relationale Datenbank. Die Struktur der Daten wird durch ein Datenbankmodell festgelegt.\n\nZu unterscheiden ist der hier beschriebene Begriff der Datenbank (bestehend aus DBMS und Daten) von Datenbankanwendungen: Letztere sind (häufig zur Anwendungssoftware gehörende) Computerprogramme, die ihre jeweils individuell erforderlichen Daten unter Nutzung eines Datenbanksystems verwalten und speichern. Beispiele: Auftragsverwaltung, Bestellwesen, Kunden- und Adressverwaltung, Rechnungserstellung.\nIm Sprachgebrauch werden gelegentlich (und begrifflich unkorrekt) auch nicht mit Datenbanksystemen verwaltete Daten als „Datenbank“ bezeichnet: eine Menge thematisch zusammenhängender Dateien.\n\n\n== Geschichte ==\nAusgehend von Problemen bei der Verarbeitung von Daten in einfachen Dateien, wurde in den 1960er-Jahren das Konzept eingeführt, Daten durch eine separate Softwareschicht zwischen Betriebssystem (Dateiverwaltung) und Anwendungsprogramm zu verwalten. Dieses Konzept begegnete der Fehlentwicklung, dass Datenspeicher in Form von Dateien in der Regel für eine spezielle Anwendung konzipiert wurden und ein erheblicher Teil des Tagesgeschäfts mit Umkopieren, Mischen und Restrukturieren der Dateien belastet war.\nEines der ersten großen DBMS war IMS mit der Sprache DL/I (Data Language One). Die damit verwalteten Datenbanken waren hierarchisch strukturiert. Parallel dazu definierte CODASYL ein Modell für netzwerkartig strukturierte Datenbanken.\nEinen wesentlichen Fortschritt erzielte in den 1960er- und 1970er-Jahren Edgar F. Codd mit seiner Forschungsarbeit am IBM Almaden Research Center. Codd entwickelte die Grundlagen des ersten experimentellen relationalen Datenbanksystems System R. Die Berkeley Group folgte mit Ingres und der Abfragesprache QUEL.\nOracle (damals noch unter den Firmennamen SDL und RSI) verwertete die Ergebnisse des System R und führte SQL zum kommerziellen Erfolg. IBM folgte mit SQL/DS und DB2. Die relationalen Datenbanksysteme verdrängten in den 1980er-Jahren die hierarchischen und netzwerkartigen Systeme, und der Großteil der Behörden, Konzerne, Institute und mittelständischen Unternehmen stellte seine IT auf Datenbanksysteme um.\nWährend in den 1990er-Jahren wenige kommerzielle Hersteller von Datenbank-Software faktisch den Markt beherrschten (namentlich IBM, Informix, dBASE, Microsoft SQL Server und Oracle), erlangten in den 2000ern die Open-Source-Datenbankmanagementsysteme eine immer größere Bedeutung. Vor allem MySQL und PostgreSQL erzielten signifikante Marktanteile. Als Reaktion begannen die führenden kommerziellen Hersteller, gebührenfreie Versionen ihrer Datenbank-Software anzubieten. Etwa seit 2001 ist aufgrund mangelnder Skalierbarkeit relationaler Datenbanken die Bedeutung der NoSQL-Systeme gewachsen.\nEinen Stammbaum der Datenbanksysteme findet man als Genealogy of Relational Database Management Systems beim Hasso-Plattner-Institut.\n\n\n== Bedeutung ==\nDatenbanksysteme sind heute ein zentraler Bestandteil der Unternehmenssoftware. Damit stellen sie einen kritischen Teil vieler Unternehmen und Behörden dar. Von der Verfügbarkeit, Vollständigkeit und Richtigkeit der Daten hängt die Aktionsfähigkeit eines Unternehmens ab. Die Datensicherheit ist daher ein wichtiger und gesetzlich vorgeschriebener Bestandteil der IT eines Unternehmens oder einer Behörde.\n\n\n== Komponenten eines Datenbanksystems ==\n\nDas Datenbanksystem ist das ausgeführte DBMS zusammen mit den zu verwaltenden Daten der Datenbank. Eine Datenbank gewährleistet die persistente Speicherung sowie die Konsistenz der Nutzdaten einer Institution und bietet für die benutzenden Datenbankanwendungen mit dem DBMS Schnittstellen zur Abfrage, Auswertung, Veränderung und Verwaltung dieser Daten.\n\n\n=== Datenbankmanagementsystem ===\nDas Datenbankmanagementsystem (DBMS) ist die eingesetzte Software, die für das Datenbanksystem installiert und konfiguriert wird. Das DBMS legt das Datenbankmodell fest, hat einen Großteil der unten angeführten Anforderungen zu sichern und entscheidet maßgeblich über Funktionalität und Geschwindigkeit des Systems. Datenbankmanagementsysteme selbst sind hochkomplexe Softwaresysteme.\nFür Datenbankmanagementsystem wird (selten) auch der Begriff Datenbankverwaltungssystem (DBVS) verwendet.\nGängig ist die Abkürzung RDBMS für ein relationales Datenbankmanagementsystem.\n\n\n=== Datenbank ===\nIn der Theorie versteht man unter Datenbank (englisch database) einen logisch zusammengehörigen Datenbestand. Dieser Datenbestand wird von einem laufenden DBMS verwaltet und für Anwendungssysteme und Benutzer unsichtbar auf nichtflüchtigen Speichermedien abgelegt. Um einen effizienten Zugriff auf die Datenbank zu gewährleisten, verwaltet das DBMS in der Regel eine Speicherhierarchie, die insbesondere auch einen schnellen Zwischenspeicher (Pufferpool) umfasst. Zur Wahrung der Konsistenz des Datenbestandes müssen sich alle Anwendungssysteme an das DBMS wenden, um die Datenbank nutzen zu können. Allein administrativen Tätigkeiten, wie zum Beispiel der Datensicherung, ist der direkte Zugriff auf den Speicher erlaubt. Die logische Struktur der zu speichernden Daten wird bei der Datenmodellierung als Datenmodell erarbeitet und festgelegt und in ihrer finalen Form im und nach den Syntaxregeln des DBMS gespeichert. Hierzu erzeugt, nutzt und verwaltet das DBMS einen „Systemkatalog“ (Data-Dictionary) mit Metainformationen zum Datenbestand, beispielsweise über seine Struktur, seine Datenfelder (Name, Länge, Format …), Zugriffsregeln, Integritätsbedingungen usw. \nEinzelne DBMS-Hersteller verwenden geringfügig voneinander abweichende Begrifflichkeiten dafür, was man genau unter einer Datenbank versteht: entweder alle Daten, die von einem laufenden DBMS bzw. der Instanz verwaltet werden, oder nur die jeweils inhaltlich zusammengehörigen Daten. Bei verteilten Datenbanken gibt es auch im Modell mehrere Datenbanken auf unterschiedlichen Systemen, die miteinander verbunden sind.\n\n\n== Beispiele ==\nAlle Banken und Versicherungen arbeiten mit Datenbanksystemen, in der Regel mit relationalen DBMS. Im Datenbanksystem sind alle Kunden- und Kontoinformationen, Buchungen und andere Daten strukturiert abgelegt. In diesem Einsatzumfeld haben Datenschutz und Datensicherheit hohe Priorität. Datenbanksysteme werden hier zum Tagesgeschäft (OLTP) sowie periodisch oder ad-hoc zu beliebigen anderen Zwecken (wie im Marketing, Controlling, Rechnungswesen und vielen anderen Bereichen; siehe auch OLAP) verwendet.\nFaktisch alle mittelständischen Unternehmen und Großkonzerne arbeiten zur Ressourcenplanung mit ERP-Systemen, deren Datenteil in Form von Datenbanksystemen vorliegt.\nDieser Artikel in seiner in der Wikipedia vorliegenden Fassung wird neben allen anderen dort enthaltenen Artikeln durch ein Datenbanksystem verwaltet (Wikipedia-Technik).\nMarktforschungsinstitute tragen eigene und Fremddaten in Data-Warehouses (Datenlagern) zusammen.\n\n\n== Funktionen eines DBMS ==\nDie wesentlichen Funktionen von heutigen Datenbankmanagementsystemen sind:\n\nSpeicherung, Überschreibung und Löschung von Daten\nVerwaltung der Metadaten\nVorkehrungen zur Datensicherheit\nVorkehrungen zum Datenschutz\nVorkehrungen zur Datenintegrität\nErmöglichung des Mehrbenutzerbetriebs durch das Transaktionskonzept\nOptimierung von Abfragen\nErmöglichung von Triggern und Stored Procedures\nBereitstellung von Kennzahlen über Technik und Betrieb des DBMS\n\n\n=== Datensicherheit ===\nDas RDBMS speichert die relationalen Daten auf einem Speichermedium. Neben den eigentlichen Daten werden ebenfalls Informationen über die Datenbankschemata und Zugriffsrechte von Benutzern gespeichert. Letztere sind wichtig, um die Datensicherheit zu garantieren. Dazu gehört sowohl Schutz gegen Datenverlust als auch Schutz gegen unerlaubten Zugriff. Die Metadaten eines DBMS werden auch als das data dictionary oder Katalog des Systems bezeichnet.\nEin weiterer wichtiger Aspekt von Datenbanken ist das Sichern des Datenbestandes durch Backups. In der Praxis ist dies oft ein nicht zu vernachlässigendes Performance-Problem, da während eines Backups Daten nur sehr eingeschränkt modifiziert werden dürfen.\n\n\n=== Transaktionen ===\nEin weiterer wichtiger Teil der Datensicherheit ist das Transaktionskonzept, das Daten gegen Race Conditions durch den parallelen Zugriff mehrerer Benutzer schützt. Andernfalls könnten Daten von verschiedenen Benutzern gleichzeitig geändert werden. Das Ergebnis der Änderungen würde dann vom Zufall abhängen oder Daten könnten inkonsistent werden. Vereinfacht dargestellt, sperren Transaktionen Daten vorübergehend für den Zugriff durch andere Benutzer, bis eine Transaktion durch einen Commit beendet wird oder erfolgte Änderungen durch einen Rollback unwirksam gemacht werden. Danach sind die Daten wieder für andere Transaktionen frei.\n\n\n=== Datenintegrität ===\nDie Integrität der Daten kann durch Constraints sichergestellt werden. Dies sind Regeln im Managementsystem, die beschreiben, wie Daten verändert werden dürfen. Der wichtigste Vertreter bei relationalen Datenbanksystemen ist der Foreign Key Constraint. Dieser verhindert, dass Daten gelöscht werden können, die von einer anderen Tabelle noch benötigt, d. h. über einen Foreign Key referenziert werden. Siehe Hauptartikel referentielle Integrität.\nAndere Integritätsbedingungen regeln zum Beispiel, ob Duplikate erlaubt sind oder welche Inhalte einzelne Datenfelder enthalten dürfen („Bereichsintegrität“, inkl. Prüfung auf erlaubte Leerinhalte).\n\n\n=== Abfrageoptimierung ===\n\nDamit Daten abgefragt und verändert werden können, stellt das DBMS eine Datenbanksprache zur Verfügung. Eine Abfrage an das Datenbanksystem wird dabei zunächst in die logischen Operationen der relationalen Algebra übersetzt. Danach werden sogenannte Datenbankoperatoren ausgewählt, die die logische Operation tatsächlich auf den Daten ausführt. Die Wahl der Operatoren und die Reihenfolge ihrer Ausführung nennt man das Erstellen eines Ausführungsplans durch den Abfrageoptimierer. Der Optimierer ist ein besonders komplexer Teil der Datenbanksoftware und hat wesentlichen Einfluss auf die Effizienz des Gesamtsystems.\nBei der Abfrageoptimierung spielen Indizes eine wichtige Rolle. Sie dienen dazu, schnell einen bestimmten Datensatz zu finden. Welche Daten einen Index erhalten, wird mit dem Datenbankschema festgelegt, kann aber später von einem Datenbankadministrator angepasst werden.\n\n\n=== Anwendungsunterstützung ===\nZur Unterstützung von Datenbankapplikationen bieten Datenbanksysteme Trigger und Stored Procedures an. Ein Trigger löst eine Aktion in der Datenbank aus, wenn ein bestimmtes Ereignis eingetreten ist, häufig bei Einfüge- oder Änderungsoperationen. Stored Procedures dienen dem Ausführen von Scripten in der Datenbank. Da Stored Procedures innerhalb des Datenbanksystems ausgeführt werden, sind sie oft der effizienteste Weg, Daten zu manipulieren. Datenbanken, die Trigger und Stored Procedures unterstützen, heißen auch aktive Datenbanken.\n\n\n=== Sprachen ===\nEine Datenbank stellt als Schnittstelle eine Datenbanksprache für die folgenden Zwecke zur Verfügung:\n\nDatenabfrage und -manipulation (DML)\nVerwaltung der Datenbank und Definition der Datenstrukturen (DDL)\nBerechtigungssteuerung (DCL)Bei den relationalen DBMS sind diese Kategorien in einer Sprache (SQL) vereint, bei anderen Systemen existiert aber durchaus eine Trennung in Form unterschiedlicher Sprachen.\n\n\n=== Mehrbenutzerfähigkeit ===\nFür den Zugriff auf die Daten werden Berechtigungen verwaltet. Ohne Berechtigung kann die entsprechende Operation nicht durchgeführt werden.\nFür den (pseudo-)gleichzeitigen Zugriff mehrerer Anwendungen bzw. Anwender regelt das DBMS Konkurrenzsituationen.\n\nEs werden Sperren (engl. locks) verwaltet.\nEs werden Systemprotokolle (engl. logs bzw. log files) verwaltet.\nDie Datenbank arbeitet transaktionsorientiert.Diese Gruppe von Anforderungen zeichnet Datenbanksysteme im engeren Sinne gegenüber funktional erweiterten Dateisystemen aus.\nFehler in einer Datenbank, die durch unzulässigen parallelen Datenbankzugriff auftreten, werden Anomalien im Mehrbenutzerbetrieb genannt.\n\n\n== Verschiedene Formen von Datenbanksystemen ==\n\n\n=== Datenbankmodell ===\nGrundlage für die Strukturierung der Daten und ihrer Beziehungen zueinander ist das Datenbankmodell, das durch den DBMS-Hersteller festgelegt wird. Je nach Datenbankmodell muss das Datenbankschema an bestimmte Strukturierungsmöglichkeiten angepasst werden:\n\nhierarchisch: Die Datenobjekte können ausschließlich in einer Eltern-Kind-Beziehung zueinander stehen.\nnetzwerkartig: Die Datenobjekte werden miteinander in Netzen verbunden.\nrelational: Die Daten werden zeilenweise in Tabellen verwaltet. Es kann beliebige Beziehungen zwischen Daten geben. Sie werden durch Werte bestimmter Tabellenspalten festgelegt.\nobjektorientiert: Die Beziehungen zwischen Datenobjekten werden vom Datenbanksystem selbst verwaltet. Objekte können Eigenschaften und Daten von anderen Objekten erben.\ndokumentenorientiert: Die zu speichernden Objekte werden als Dokumente mit möglicherweise verschiedenen Attributen, d. h. ohne die Voraussetzung der Strukturgleichheit, gespeichert.Es existiert eine Vielzahl von Misch- und Nebenformen, wie zum Beispiel das objektrelationale Modell.\n\n\n=== Ausrichtung ===\nKlassischerweise unterscheidet man eine Ausrichtung des Systems auf viele kleine Abfragen (OLTP) oder lang andauernder Auswertungen (OLAP). Es ist aber durchaus gängig, dass dasselbe System beiden Anforderungen gerecht werden muss und zum Beispiel tagsüber für den OLTP- und nachts für den OLAP-Betrieb „gefahren“ wird. Ein Datenbankadministrator arbeitet dann unterschiedliche Konfigurationen aus (Hauptspeicher des Servers, Prozess-Anzahl, Optimierungsstrategie beim Zugriff etc.).\n\n\n== Siehe auch ==\nDigital Bibliography & Library Project (DBLP): bibliographisches Verzeichnis mit dem Schwerpunkt Datenbanksysteme und Logikprogrammierung.\nListe der Datenbankmanagementsysteme\neingebettetes Datenbanksystem\nDatasource\nDatenbanksicherheit\nTextgenerierung\n\n\n== Literatur ==\nRamez Elmasri, Shamkant B. Navathe: Grundlagen von Datenbanksystemen. 3. Auflage Ausgabe Grundstudium. Pearson Studium, München u. a. 2005, ISBN 3-8273-7153-8.\nAndreas Heuer, Gunter Saake: Datenbanken. Konzepte und Sprachen. 2., aktualisierte und erweiterte Auflage. mitp-Verlag, Bonn 2000, ISBN 3-8266-0619-1.\nAlfons Kemper, André Eickler: Datenbanksysteme. Eine Einführung. 7., aktualisierte und erweiterte Auflage. Oldenbourg Verlag, München u. a. 2009, ISBN 978-3-486-59018-0.\nThomas Kudraß (Hrsg.): Taschenbuch Datenbanken. Fachbuchverlag Leipzig im Carl.Hanser-Verlag, München 2007, ISBN 978-3-446-40944-6.\nT. William Olle: The Codasyl Approach to Data Base Management. Wiley, Chichester 1978, ISBN 0-471-99579-7.\nGottfried Vossen: Datenmodelle, Datenbanksprachen und Datenbankmanagementsysteme. 5., korrigierte und ergänzte Auflage. Oldenbourg Verlag, München u. a. 2008, ISBN 3-486-27574-7.\n\n\n== Weblinks ==\n\nBundesamt für Sicherheit in der Informationstechnik: Geeignete Auswahl einer Datenbank-Software\nDatenbankwiki an der FH Köln\nDatenbanken-verstehen, ein Portal rund um Datenbanken, Datenbanktheorie und Datenbankpraxis\n\n\n== Einzelnachweise ==", "Ein Repository (englisch für Lager, Depot oder auch Quelle; Plural: Repositories), auch – direkt aus dem Lateinischen entlehnt – Repositorium (Pl. Repositorien), ist ein verwaltetes Verzeichnis zur Speicherung und Beschreibung digitaler Objekte für ein digitales Archiv.\nBei den verwalteten Objekten kann es sich beispielsweise um Programme (Software-Repository), Publikationen (Dokumentenserver), Datenmodelle (Metadaten-Repository) oder betriebswirtschaftliche Verfahren handeln. Häufig beinhaltet ein Repository auch Funktionen zur Versionsverwaltung der verwalteten Objekte.\n\n\n== Repository zur Versionsverwaltung ==\nBei Versionsverwaltungssystemen wie CVS, Git oder SVN werden die Quellcodedateien oder andere Dateien in einem  Repository oder Projektarchiv gehalten. Sie werden von dort „ausgecheckt“, d. h. auf den Rechner eines Programmierers kopiert. Nach der Bearbeitung werden die geänderten Dateien wieder in das Repository „eingecheckt“, wobei die Veränderung – optional mit Kommentaren des eincheckenden Entwicklers versehen – protokolliert wird. Die Versionsverwaltung dient der Dokumentation der Entwicklung, erlaubt aber auch die jederzeitige Rekonstruktion von früheren Zuständen des Quelltexts.\nEin solches Versionsverwaltungssystem ermöglicht die Zusammenarbeit von großen Teams an Softwareprojekten, da über die Versionsverwaltung Unterschiede an Dateien gefunden und von einem merge-Mechanismus nach Bearbeitung durch mehrere Entwickler zusammengefügt werden können. Somit geht keine Änderung verloren und es fließen alle Änderungen in einen neuen gemeinsamen Stand ein.\nEine Hauptfunktion der Versionsverwaltung ist die Versionsgeschichte, die es Entwicklern ermöglicht, auf jeden von einem Benutzer \"eingecheckten\" Stand einer oder mehrerer Dateien zurückzuspringen und diese Version zu verwenden.\n\n\n== Software-Repository ==\nHierbei enthält das Repository Programmpakete und zugehörige Metadaten, z. B. Beschreibungen der Pakete, Abhängigkeitsinformationen und Änderungsprotokolle. Das Installieren bzw. Aktualisieren der Software aus dem Repository übernimmt ein Paketmanager. Daher wird in diesem Zusammenhang auch oft die deutschsprachige Bezeichnung Paketquelle benutzt. Populäre Beispiele für Software-Repositorys sind CPAN oder Portable Apps.\nDieses Prinzip wird häufig von Linux-Distributionen verwendet, um dem Benutzer an zentraler Stelle Zugriff auf aktuelle oder getestete Software zu ermöglichen. Ein Vorteil ist, dass mit einem Update durch die Paketverwaltung sowohl das System als auch die Anwendungen aktualisiert werden und so das manuelle Überprüfen der Aktualität durch Besuch der einzelnen Projektwebseiten entfällt. Die Pflege eines Programmpakets in einem Update-Repository übernimmt ein Paket-Maintainer, der meist aus der Community rund um die Distribution stammt und nicht in die eigentliche Entwicklung der Software involviert sein muss.\n\n\n== Metadaten-Repository ==\nBei Metadaten-Repositorien handelt es sich üblicherweise um Datenbanktabellen zur Verwaltung von Metadaten, die als Basis für hochintegrative Systeme dienen. In ihnen sind alle notwendigen Beschreibungen zum\nSystem selbst und zur Umwelt enthalten. Mit Hilfe von Metadaten-Repositorys können diese\nSysteme ohne Programmieraufwand flexibel auf Änderungen reagieren nach dem Motto: „Definieren statt Programmieren“. Metadaten-Repositorys werden unter anderem in Data-Warehouse und EAI-Architekturen eingesetzt.\nAuch die freie Faktensammlung Wikidata kann in diesem Sinne als Repository angesehen werden.\n\n\n== CASE-Werkzeuge ==\nBei manchen Modellierungswerkzeugen („CASE“ = Computer-aided software engineering) dient das Repository zur Speicherung aller Projektdaten wie beispielsweise Diagrammen, Quellcode und Dokumentationen.\n\n\n== Dokumentenserver ==\nIm Umfeld von Netzpublikationen wird der Begriff Repository synonym für Dokumentenserver verwendet. Ein Beispiel für einen Dokumentenserver ist ArXiv.org.\n\n\n== Siehe auch ==\nData-Dictionary\nData-Warehouse-System\nDigitale Bibliothek\nRPM Fusion, ein Beispiel", "Ein Datensatz () ist (beispielsweise nach Mertens) eine Gruppe von inhaltlich zusammenhängenden (zu einem Objekt gehörenden) Datenfeldern, z. B. Artikelnummer und Artikelname. Datensätze entsprechen einer logischen Struktur, die bei der Softwareentwicklung (z. B. im konzeptionellen Schema der Datenmodellierung) festgelegt wurde.In der Datenverarbeitung werden zu Datensätzen zusammengefasste Daten in Datenbanken oder in Dateien gespeichert. Sie sind Gegenstand der Verarbeitung von Computerprogrammen und werden von diesen erzeugt, gelesen, verändert und gelöscht (siehe CRUD). Bei der Eingabe wird der Inhalt von Datensätzen oft in der Form eines Formulars dargestellt, bei der Ausgabe oder Anzeige auch in Listen­form, ggf. nur mit einem Teil der Datenfelder.\nAuch nicht-elektronische Daten können zu Datensätzen zusammengefasst sein, zum Beispiel ist eine Karteikarte in einer Kartei ein Datensatz.Neben der Bedeutung von „Datensatz“ im engeren Sinn – als Sammlung konkreter Daten (z. B. die Adressdaten von Kunde Müller) – wird der Ausdruck im Kontext der Softwareentwicklung auch als Typbegriff bei der Deklaration von Daten verwendet; Beispiel: Datensatz ‚Adressdaten‘. Abhängig von den dabei angewendeten Methoden, Programmiersprachen etc. werden anstelle von ‚Datensatz‘ auch Termini wie Satz (englisch Record), Entitätstyp, Klasse, Tupel, Struktur, Verbund usw. benutzt. Deren logischer Aufbau wird im Rahmen des Konzeptionellen Schemas der Datenmodellierung festgelegt.Abgrenzung: Obwohl Daten eigentlich immer als Aneinanderreihung mehrerer Datenelemente auftreten, nennt man nicht alle Erscheinungsformen von Daten ‚Datensatz‘, sondern nur Datengruppierungen, die zu einem bestimmten Objekt gehören und die innerhalb eines Datenbestands identische Strukturen aufweisen. Die Datenfelder ‚Name‘, ‚Adresse‘ und ‚Geburtsdatum‘ könnten also einen Datensatz zu einer Person bilden. Nicht als Datensätze in diesem Sinn gelten zum Beispiel: Fließtexte, Drucker- oder Video-Datenströme, Inhalte von ausführbaren Dateien, Fotodaten oder die Daten von Grafiksoftware.\n\n\n== Abweichende Bedeutung in der Statistik ==\nZusammenfassend bezeichnet der Datensatz in der Informatik – wie oben beschrieben – eine eindimensionale, strukturierte Folge von Attributen eines Elements einer übergeordneten Menge (z. B. eine Karteikarte einer Kartei, eine  Bestellung einer Datenbank für Bestellungen, eine Zeile einer Adressliste).\nDagegen bezeichnet der Datensatz in der Statistik die Gesamtheit von Daten in einem bestimmten Zusammenhang. Hier ist er also gleichbedeutend mit Datenbestand (ein Satz bzw. eine Sammlung von Daten, auch aus der Übersetzung von Data Set, früher bei IBM für Datei verwendet) – beispielsweise alle in einer statistischen Erhebung ermittelten Daten oder die „Steuersünder-CD“.\n\n\n== Varianten bei der Speicherung ==\nIm Allgemeinen entspricht ein Datensatz, mit den Ausdrucksmitteln von Programmiersprachen deklariert, dem Datentyp Verbund bzw. Record, ggf. innerhalb eines assoziativen Arrays. Das mathematische Modell eines Datensatzes ist ein Tupel.\nBezüglich der Speicherung von Datensätzen lassen sich zahlreiche Unterscheidungen treffen. Zum Beispiel:\n\nSpeicherung in normalen Dateien: Hier bieten sich Alternativen wie:\nBenutzerdefinierte individuelle Datenformate und -strukturen,\nCSV-Dateien mit Feldtrennzeichen wie Strichpunkt o. ä.,\nXML-Format in der Form <Feldname = Feldinhalt> und mit weiteren strukturbezogenen, textlich formulierten Informationen,\nRDF-Format für Internet-Informationen.\nSpeicherung in Datenbanken:\nIn relationalen Datenbanken werden Datensätze in Tabellenform gespeichert, wobei ein Datensatz i. d. R. einer Tabellenzeile entspricht.\nSpaltenorientierte Datenbanken speichern nicht alle Datenfelder je Datensatz hintereinander, sondern für jedes Datenfeld die Inhalte aller Datensätze, eine Spalte (mit all ihren Zeilen) steht hier also für 'Datensatz'.Im Detail ist ‚Datensatz‘ jedoch kein technischer, sondern ein logischer Begriff, für den es zahlreiche technische Erscheinungs- und Implementierungsfomen gibt. Dabei können Datensätze nach den folgenden Merkmalen/Eigenschaften unterschieden werden:\n\nAllgemeingültigkeit: Verbindlich festgelegte Strukturen und Formate (wie binäre Daten oder Text, Länge, sonstige Regeln), z. B. für bestimmte Softwarelösungen (wie beim DTA-Verfahren) vs. individuell vom Anwender definierte Formate.\nSatz-/Datenfeldlänge: Fixe und einheitliche Länge je Feld vs. variabel lange Felder (z. B. mit Feldtrennzeichen wie bei CSV oder mit Feldlängenangabe); führt entsprechend zu Datensätzen mit fixer oder variabler Länge.\nVerwendete Zeichenkodierung: Nur Textzeichen z. B. im ASCII-Code vs. andere Datentypen in einem Binärcode.\nFeldattribute: Nur Nettodaten vs. weitere Informationen je Feld (wie fett, unterstreichen, Schrifttyp usw., meist nicht sichtbar).\nDatensatzbegrenzung: Satzende-Kennzeichnung vs. feste Satzlänge.\nHomogenität: Einheitliche vs. unterschiedliche Datenarten in derselben Datei, erkennbar z. B. durch ein Datenfeld ‚Satzart‘.In Anwendungen zur Tabellenkalkulation wird ein Datensatz meist durch eine Zeile, je nach Anordnung alternativ durch eine Spalte repräsentiert. Ein klassisches Beispiel für einen Datensatz ist eine Lochkarte.\nFür elektronische Daten gilt: Sie existieren in ihrem Speichermedium als Bit-/Bytefolgen beliebiger Länge. In dieser Datenmenge werden die einzelnen Datensätze und Datenfelder durch meist von der Programmiersprache und/oder der Systemsoftware bereitgestellte Verfahren identifiziert und adressiert und zum Beispiel in Zeilen und Spalten dargestellt.\n\nLogische/physische Datensätze: Auf elektronischen Datenträgern werden in der Regel mehrere Datensätze zu größeren Speichereinheiten zusammengefasst. Solche Einheiten werden je nach Computersystem unterschiedlich bezeichnet, zum Beispiel als ‚Page‘ (Seite, bei vielen Datenbanksystemen) oder als Block (bei konventioneller Speicherung). In einem Computerprogramm sind der Verarbeitung des einzelnen Datensatzes Routinen vorgeschaltet (meist des Betriebssystems oder des DBMS), die das tatsächliche Lesen oder Schreiben auf dem Datenträger aus Optimierungsgründen block-/seitenweise durchführen und den jeweils einzelnen Datensatz innerhalb des Datenblocks iterativ positionieren – siehe auch  Datensatz (relative Satznummer) – und zur Verarbeitung im Hauptspeicher bereitstellen.\n\n\n== Siehe auch ==\nDatenbanktabelle\n\n\n== Einzelnachweise =="]