{"databases": ["Objektklasse", "Ereignisprotokolldatei", "Graphdatenbanken", "Fehler", "Protokoll", "Rahmen", "Spezialfall", "Statistik", "Log-Dateien", "Netzwerkdatenbankmodell", "April", "Datenbankentwickler", "Tracing", "Dokumentenservern", "Langzeitarchivierung", "Ausfall", "Objektdatenbankmodell", "Blog-Eintrag", "Aktualisieren", "Abgrenzung", "Methode", "Aufwand", "Master-Server", "Masseneinsatz", "Verhaltensmuster", "Nutzungsdaten", "Humboldt-Universit\u00e4t", "Update", "Vererbungshierarchie", "Warning", "Dokumentenserver", "Abfragesprache", "Dokument", "Struktur", "Ereignisprotokoll", "Hauptspeicher", "Aufbau", "Referenztabelle", "Linux-Systemen", "Repositorium", "Universit\u00e4t", "Satz", "Logdateien", "Daten", "Querverweistabelle", "Objekt", "Datenbanksprache", "Logging", "Rechner", "GurockSoftware", "Konzept", "Sprache", "Pflege", "Tupel", "Berlin", "Karteikarte", "Repository", "Merkmalen/Eigenschaften", "Zustand", "Kategorie", "John", "Objektdatenbanksystem", "Transaktion", "Verteilungsmuster", "Benutzerfehler", "Leistungsproblemen", "Kunde", "Beginning", "Fall", "Schreibzugriffen", "ASCII-Code", "Listen\u00adform", "Publikationsserver", "Publikation", "Archivierung", "Library", "Querverweistabellen", "Beschreibung", "Fetching", "Schl\u00fcssel", "Begriff", "Replikation", "Abweichende", "Inhalt", "Sicherheitsmuster", "Auswertung", "Projekt", "Transaktionstabelle", "Anwendungsprogramm", "Versionsverwaltungssystem", "Anwendungsseite", "Systemsoftware", "Systembeschreibung", "Gesundheitswissenschaften", "Datenfelder", "Speyer", "Syslog", "Feldtrennzeichen", "E-Mail-Server", "Fotodaten", "Datensatzbegrenzung", "Projektdaten", "Open-Source-Datenbank", "Silverston", "Artikelname", "Datenbankmodell", "Latenzen", "Setzen", "Tabellenzeile", "Einf\u00fcgen", "Institutionelle", "Verwaltung", "RDF-Format", "Bonn", "Gunter", "Objektdatenbank", "Schreibzugriffe", "Adressliste", "Nxlogging", "Klassenbaum", "Forschung", "Biographie", "Programmieraufwand", "Zur\u00fccksetzen", "Regel", "Entwickler", "Datenmenge", "Quelltabelle", "Langzeitverf\u00fcgbarkeit", "Datenbankmanagementsystem", "Gegenstand", "Windows", "Transaktionsprotokoll", "Mastertabellen", "Zeichenfolge", "Zuordnung", "Programmfehler", "Sperrverwaltung", "Datentyp", "Untersuchung", "Datenbestand", "Standardverhalten", "Logging-Datenbanken", "Mastertabelle", "Markt", "Verf\u00fcgbarkeit", "Person", "Befehl", "Application", "Auflage", "Unterscheidung", "Ereignisprotokolle", "Logdateianalyse", "Name", "Verarbeitung", "Ausfallsicherheit", "Entwicklung", "Hilfe", "OPUS-Server", "Entries", "Einzelnachweis", "Grundlage", "Funktion", "Programm", "Fragmentierung", "Bestellung", "Paketverwaltung", "Proxyserver", "Kundennummer", "Grafiksoftware", "Berechnungsmodell", "Lesezugriffen", "Upgrade", "Anforderung", "Systementwicklung", "Datenbeschreibung", "Logdatei", "Anwendung", "Gesch\u00e4ftstransaktionen", "Ende", "Speicher", "Schema", "Installieren", "Beziehung", "DINI-Datenbank", "Metadaten-Repositorien", "Stefan", "Zusammensetzen", "Architektur", "Zeit", "Datenmanipulationssprache", "Archivsoftware", "EDA-Datenbank", "Hochschulschriftenserver", "Anwendungssoftware", "Model", "Netzwerkinformation", "Muster", "Volum", "Verhalten", "Objektdatenbanksysteme", "Datenprotokollierungs-Bibliothek", "Archiv", "Internet-Informationen", "Geschichte", "Fremdschl\u00fcsselbegrenzung", "Computerprogramm", "XML-Format", "Klasse", "Fremdschl\u00fcssel", "Laufzeitinformationen", "Sprachteile", "Aktion", "Objektdatenbankmanagementsystem", "Technologie", "Registration", "Lastverteilung", "System", "Bibliographie", "Language", "Datenmodellierung", "Information", "Operations-Datenbanken", "\u00c4nderungsprotokolle", "Modeling", "Ganzzahl", "Windows-Systemen", "Typbegriff", "Echtzeitauswertung", "Umgekehrter", "Master", "Spezielle", "Datenmodell", "Performanceproblemen", "Projektarchiv", "Webseite", "Teilsprachen", "Objektdatenbanken", "Softwareentwicklung", "Relationale-Datenbank-Muster", "Antimuster", "Website", "Tabellentypen", "History-Tabelle", "Peer-to-Peer-Netzwerk", "DTA-Verfahren", "Batch-Transaktionen", "Abfrage", "Protokollzeile", "Manipulationssprache", "Hintergrundprogramme", "Ereignis", "Teil", "Evolutionary", "Anlegen", "Datenfeld", "Institut", "NoSQL-Architekturen", "Sammlung", "NoSQL-Datenbank", "Programmzustand", "Universal", "Datenbanksprachen", "Verbrauchsforschung", "Fachrepositorien", "Network", "Nutzdaten", "Definition", "Downloads/Artikel", "Serverlog", "Rolle", "EAI-Architekturen", "Feldname", "Form", "Artikelnummer", "Verteilung", "\u00c4nderung", "Datenspeicher", "Denormalisierungsmuster", "ANSI-SPARC-Architektur", "Education", "Adressdaten", "Feldinhalt", "Datenbankmarkt", "Zugriff", "Netzpublikationen", "Server", "ACID-Eigenschaften", "Liste", "Format", "Weblink", "Datenbanktabelle", "Dokumenten-Server", "Datenbanksysteme", "Tabellenform", "Datei", "Repositories", "Problem", "Federation", "Repository/Repositorium", "Lesezugriffe", "Thema", "Bibliothek", "Nettodaten", "Ausdrucksmitteln", "Stand", "Softwaresysteme", "Tabelle", "Modell", "Abmeldungen", "Verwaltungswissenschaften", "Software", "Element", "Wert", "Seite", "Passwort", "Lookup-Tabelle", "Anfrage", "Klassenhierarchie", "Protokolldateien", "Dokumentation", "Code", "Benutzer", "Processing", "Ver\u00f6ffentlichung", "\u00dcberblicksartikel", "Fachgebiet", "CSV-Dateien", "Universit\u00e4ts-Website", "Eintrag", "Lastenverteilung", "Data-Warehouse-System", "Database", "Datenbankimplementierungen", "Publikationsverbund", "Datenbank", "Stapelverarbeitung", "Datenbanksystem", "Gruppe", "Framework", "L\u00e4nge", "Fremdschl\u00fcsselkaskade", "Versionsgeschichte", "Nutzerverhalten", "Feld", "Nutzer", "Computersystem", "Analyse", "Randdaten", "Nachteil", "Preprint-Server", "Einsatz", "Netzwerk", "Datenbanksystemen", "Umfeld", "Installationsprogramme", "Datenspeichersystemen", "Slave-Servern", "NoSQL-Systeme", "Zusammenhang", "Webservice", "Unterteilung", "Zeile", "Berechnung", "Menge", "Access", "Aufl\u00f6sungsmuster", "Auto", "Arbeit", "Verbund", "Service", "Betriebssystemmitteln", "Description", "Single-Server", "Hashtabelle", "Programmiersprache", "NoSQL-Implementierungen", "Sicherheit", "Protokolldatei", "Unterschied", "Sinn", "Adresse", "Datenaufsichtssprache", "Verantwortlich", "Versionsverwaltung", "Pfadarten", "Betreiber", "Zieltabelle", "Paketquelle", "Beispiel", "Prim\u00e4rschl\u00fcssel", "Versionsverwaltungssystemen", "Variante", "Datenarten", "Deutschland", "Vorteil", "Literatur", "Attribut", "Anbieterserver", "\u00c4nderungsprotokoll", "Edlich", "Datenbank-)Abfragesprache", "Schnittstelle", "Quellcodedateien", "Initiative", "Verfahren", "Kartei", "Spalte", "Abh\u00e4ngigkeitsinformationen", "Datensatz", "Standard", "Betriebssystem", "NoSQL-Datenbanken", "Metadaten", "Autor", "Eigenschaft", "Quelle", "Laufzeitfehler", "Base", "Bedeutung"], "processing": ["Handhebels", "Warmwasser\u00fcberlauf", "Sp\u00fclxylolpumpe", "Kondensat", "Safener-Container", "Wasser/Xylol", "Deckel", "Mannlochdeckel", "Gleitringdichtung", "L\u00f6semittelcontainer", "Destillatablauf", "Vakuumaschine", "Ansprechen", "Widerruf", "Maske", "Sieb", "ABC-Vorlage", "Motorverteiler", "Ger\u00fcststange", "Reparatur", "Re-Xylol", "Beh\u00e4lterbeleuchtung", "Kg/h", "Vorfeld", "Wasserpumpenzange", "\u00dcberf\u00fcllsonde", "St\u00f6rung", "Hydrolyse-Vorlage", "Anzeige", "Extraktionspumpe", "Flashtopf", "F\u00f6rderleistung", "Dichte", "Einsaugen", "Funktionsst\u00f6rung", "Leitf\u00e4higkeitsmessung", "Container", "Kaltwasserk\u00fchler", "Standhaltung", "Dom\u00e4ne", "Laufwerk", "Phase", "Ablauf", "Status", "Pumpengeh\u00e4use", "Umpumpleitung", "Sp\u00fclxylol", "Pumpe", "Wasser-Puffer", "Hecht", "Umpumpmenge", "Fr\u00fchschicht", "R\u00fcckstandssammler", "R\u00fcckfluss", "Destillat", "Druckluft", "Wasserphase", "Rauchentwicklung", "Vakuum-Anlage", "Kupplung", "Standmessung", "Auslagerungsbeh\u00e4lter", "Inhalt", "Leeren", "Schichtmeister", "Anlagenstand", "Oberphase", "Geh\u00e4use", "Abgasstutzen", "Schauglas", "Mulmcontainer", "Verriegelung", "Phenothiazin", "Wasserpuffer", "KONTROLLIEREN", "Lager", "Probelauf", "Saugstutzen", "Fl\u00fcssigkeitsringpumpe", "Diazopumpe", "Druckleitung", "Vakuum", "Saugseite", "L\u00f6mi-Container", "Haus", "Pumpenhaus", "R\u00fcckk\u00fchlwassermenge", "KHCO\u00b3-Dosierung", "L\u00f6semittelsammler", "Versuch", "Etiketten-Druck", "Tauchrohr", "Temperaturanzeige", "Visconvakuummaschinen", "Leer", "Sonde", "Dichtung", "Vakuummaschine", "Schlosser", "Rein-Ethanol", "Temperatur", "Maschinenpool", "Fachabteilung", "St\u00f6rungsfrei", "Meisterstube", "Hinweis", "Mulm-Container", "Rohrb\u00fcndel", "Abpumpventil", "Auffangvorrichtung", "Kontrolle", "Verschiebung", "Vakuumanlage", "Mulmsammler", "Pulversystem", "MASE-Vorlage", "Sperrfl\u00fcssigkeit", "Phasengrenze", "Abgasleitung", "Fass", "R\u00fccklauf", "Roh-Safener-Extraktions-Pumpe", "Druckmanometer", "Ventil", "Schwankung", "S\u00e4ubern", "Ende", "Standanstieg", "Ethanol", "Flansch", "Regelventil", "Verdampfer", "Kupplungslamellen", "Mulm-RS-Sammler", "DMF-Container", "St\u00fcck", "Taktungsventil", "Xylolphase", "Zeit", "Sumpfaustragspumpe", "Tropfleckage", "Betrieb", "Fassware", "F\u00e4llbeh\u00e4lter", "R\u00fchrwerk", "Vorlagepumpe", "Destop", "Wasser", "Temperaturtasche", "Klemme", "Hrjogunali", "Trockenlaufsonde", "Mulmphase", "Einlaufleitung", "System", "Tank", "L\u00fcftung", "Gleiteinheit", "Pumpenleistung", "Destillatablaufleitung", "Marlothermanlage", "Rein-MIBK-Vorlage", "Mengenmesser", "B\u00fchne", "Pumpenmotor", "Anlage", "Masevorlage", "W\u00e4rmekammer", "Trocknen", "Druckseite", "Sumpfvorlage", "Messung", "Ablassventil", "Sp\u00fclxylolvorlage", "Ordnung", "Labor", "Ansatz", "B\u00fchnenentw\u00e4sserung", "Vakuumpumpe", "Sammler", "Filter", "Beh\u00e4lter", "Rauchmelder", "Auff\u00e4lligkeit", "Puffer", "Leitung/Pumpe", "Druck", "Aufsatzkolonne", "Rundgang", "Phenotiazin", "Leckage", "Extraktion", "Xyloldestillat", "Frischansatz", "Mangel", "Teilmenge", "Mulm", "Lochscheibe", "Saugleitung", "L\u00f6semittel-Container", "Abwassersammler", "Nachmittag", "Trenngef\u00e4\u00df", "Bodenventil", "Einsaugvorrichtung", "Motor", "Einsteckrohr", "Bereich", "Roh-Ethanol", "Verstopfung", "Br\u00fcdentemperatur", "Vorstufe", "Teil-verstopfung", "Probe", "Streichdampf", "Be,-/Entl\u00fcftung", "Xylol\u00fcberwachung", "Leitung", "Disulfatisierungsleitung", "Liste", "Hechtfilter", "Kupplungsreaktor", "Diazoeinlauf", "Mitarbeiter", "Diazotiererpumpe", "Vakuumanalge", "Dampf", "Problem", "Marlothermpumpe", "Probenahmepumpe", "Soll-Menge", "Mulmr\u00fcckstandssammler", "Beispielst\u00f6rung", "Polizeifilter", "Vorlage", "Abwassersammelbeh\u00e4lter", "HW-Pumpe", "Stand", "Entnahme", "Gesamtstatus", "Vakuummaschinen", "Kupplungreaktor", "Rest", "Wert", "Ersatz", "Starttemperatur", "Glykol", "Druckluftventil", "Einlaufschauglas", "Kolonne", "Br\u00fccke", "Frischxylol", "Gleitringeinheit", "Mulmabtrennung", "Saugschieber", "Phasenversteller", "Mixer", "Frisch", "Entl\u00fcftung", "Tanklager", "\u00d6lkammer", "Menge", "Schichtende", "Einlauf", "Mengen\u00fcberwachung", "Anfahren", "Schlauchlager", "Fl\u00fcssigkeit", "Xylol", "Steckscheibe", "Abdeckung", "Glas", "Rolltor", "Herr", "Rein-Vorlage", "Rotor", "Grund", "Entw\u00e4sserer", "L\u00f6mi-Sammler", "Dosierung", "Ablaufleitung", "Phaseneinsteller"], "softwaredev": ["Maschinenprogramme", "Zielsystem", "Approximationen", "Fehler", "Programmieren", "Rahmen", "Verarbeitungsvorschrift", "N{\\text", "Programmierstil", "\u00dcbersetzungsvorgang", "Desktop-Bereich", "Java-Programme", "Maschinencodes", "Folge", "Ergebnis", "Mathematik", "Microsoft", "Aufwand", "Methode", "N\u00e4herungswerte", "Kompilieren", "Betriebssystemfunktionen", "Urheberschutz", "Newton-Verfahren", "Bestandteil", "Dialogprogramme", "Konsulat", "Fehlfunktionen", "Unix-Anwendungen", "Allgemeinen", "Lebensphase", "Charles", "Schleife", "Online-Verbindung", "Portabilit\u00e4t", "Sonderfall", "Management", "Zuweisungen", "Aufgabenstellung", "Datenbankaufruf", "Programmpakete", "Daten", "Entwicklungsaufwand", "Hersteller", "Mittel", "Dienstprogramm", "Annuit\u00e4tsprinzip", "Rechner", "Variable", "Sprache", "Maschine", "Konzept", "Lauff\u00e4higkeit", "Programmierdokumentation", "Version", "Phase", "Programmausf\u00fchrung", "Unternehmen", "Ausgangswerte", "John", "Plan", "Prozessor", "Vorgehen", "Kepler-Gleichung", "Hilfsvariable", "Umsetzung", "C-Programmen", "Fall", "Zeigervariable", "Hardwareumgebungen", "Sicht", "Assemblersprache", "Pr\u00fcfung", "Vorgang", "\u00dcbersetzen", "Propriet\u00e4r", "Arbeitsspeicher", "Beschreibung", "Ziel", "Obfuscator", "Begriff", "Aktualisierung", "Java", "Plattform", "Projekt", "Zwischencode", "Rechenschritt", "Entwicklertest", "CPU-Typ", "M\u00f6glichkeit", "Test", "L\u00f6sung", "Schritt", "Dienstprogrammen", "HTML-Code", "Produktlebenszyklus", "Lage", "Endger\u00e4t", "Patch-Pakete", "Schleifenkontrollanweisungen", "Neuentwicklung", "Patch", "Regel", "Schutz", "Versionsverwaltungssysteme", "Stelle", "Byte-Reihenfolge", "Programmierer", "Windows", "Programmbibliotheken", "Zielcode", "Ausgabeanweisungen", "Datenstruktur", "Verwendung", "Maschinensprache", "Binaries", "Entwicklungsumgebung", "Befehl", "\u00dcbertragungsaufwand", "Programmierumgebung", "Oberfl\u00e4chenform", "Zweck", "Entwicklung", "Stellung", "T\u00e4tigkeit", "Iterationsverfahren", "Gaius", "Hilfe", "Laufzeitumgebungen", "Auszeichnungssprache", "Einzelnachweis", "Schreibweise", "Autovervollst\u00e4ndigen", "Konfigurieren", "Voraussetzung", "Funktion", "Teamarbeit", "Iteration", "Programm", "Quelloffene-software", "Arbeitsschritt", "Wiki-Codes", "Quellcodeanweisung", "Unterprogramm", "Rechnerkonzept", "Bin\u00e4rprogramme", "Babbage", "Maschinencode", "Anwendung", "Jahr", "Mensch", "Compilezeit-Phase", "Abfolge", "Linkage", "Lizenz", "FOREACH-Schleife", "Algorithmus", "Ausf\u00fchrungszeitraum", "Precompiler", "Richtlinie", "Werkzeug", "Anwendungssystems", "Systemprogramm", "Rechenoperation", "Formatierung", "Quellcode", "Texteditor", "Quellcode-Portabilit\u00e4t", "Architektur", "Zeit", "Maschinenprogrammen", "Ressource", "Anwendungssoftware", "Englisch", "Quelltextdateien", "Erstellung", "Cross-Plattform", "Verhalten", "User-Interaktion", "Python", "Einr\u00fcckungsstil", "Computerprogramm", "Geschichte", "Programmbibliothek", "Aktivit\u00e4t", "Iterator", "Qualit\u00e4t", "Nullstelle", "Paket", "F\u00e4llen", "System", "Performanzanalyse", "Zeitraum", "Language", "Anpassungsaufwand", "Programmstruktur", "Versionierungssysteme", "Ausf\u00fchrung", "Softwareprogrammierung", "Editor", "Maschinenbefehle", "\u00dcbersetzung", "Rechnerumgebungen", "Routine", "Programming", "Sinusfunktion", "Informatik", "JIT-Compiler", "Instruktionen", "Verbindung", "Programmierger\u00e4t", "Langzeitverhalten", "Interaktion", "Webseite", "Programmcode", "Portierungen", "Programmierung", "Softwareentwicklung", "Kriterium", "Prozess", "Prinzip", "Quelltextformatierung", "Multi-Channel-Apps", "Zielplattform", "Microcomputer", "Patching", "Erstellungsm\u00f6glichkeit", "Republik", "Pack", "Urheber", "Gro\u00dfrechnern", "Aufgabe", "Arbeitsplatzrechner", "Teil", "Ver\u00e4nderungsmanagement", "Implementierung", "Speicherverbrauch", "Ver\u00e4nderung", "Microsystems", "Workflow-Management", "Quelltextdaten", "Iterationsmethode", "Funktionalit\u00e4t", "Bereich", "EDSAC-Rechner", "Form", "Computer", "\u00c4nderung", "Text", "Zugriff", "Softwaretechnik", "Server", "Verlauf", "Quellprogramme", "Abgrenzen", "Format", "Hauptprogramme", "Syntaxfehler", "Vergleich", "Speicheradresse", "Weblink", "Erstellen", "Ausdr\u00fccke/Anweisungen", "Lesbarkeit", "Datei", "Software-Lebenszyklus", "Fixpunkt", "Problem", "SQL-Anweisungen", "Originalanweisungen", "Bytecode", "Thema", "Endanwendersicht", "Sache", "Apple-Rechnern", "Programmfunktionen", "Ausdruck", "Java-Compiler", "Bin\u00e4rprogramm", "Aufrufbefehl", "Vergleichsbefehl", "\u00dcberblick", "Endung", "Verwechslungsm\u00f6glichkeit", "Elementare", "Software", "Plattformunabh\u00e4ngigkeit", "Projektphasen", "Untervariante", "Teiler", "Programmdatei", "Compiler", "Dokumentation", "Code", "Benutzer", "Individualsoftware", "Hybrid-Apps", "Anweisung", "Laufzeitumgebung", "Hochsprache", "Vorschrift", "Open-Source\"-Lizenz", "Aufruf", "Schutzf\u00e4higkeit", "Open-Source-Software", "Lochstreifen", "Unterprogramme", "Ressourcenverbrauch", "Analyse", "Einsatz", "Codegenerator", "Ggt-algorithmus", "Eingabedaten", "Stapelprogramme", "Gleichung", "Anpassung", "Debugger", "Prozessortyp", "Wiederholung", "Codeerstellung", "Berechnung", "Arbeit", "Server-Bereich", "Service", "Programmiersprache", "Anforderungsanalyse", "Unabh\u00e4ngigkeit", "Unterschied", "Sinn", "Adresse", "Quelltext", "Dateiendung", "Ablaufanweisung", "Laufzeit", "Punkt", "Lineare", "Entstehungsphasen", "Entwurf", "Einarbeitungszeit", "Variante", "Beispiel", "Operation", "Programm-Quellcode", "Webanwendungen", "Anwender", "Compilezeit", "Verfahren", "Probleml\u00f6sung", "Reihenfolge", "Softwarequalit\u00e4t", "Betriebssystem", "Kommentar", "EDVAC-Rechner", "Eigenschaft", "Programmtext", "Zahl", "Umgebung", "Bedeutung", "Urheberrechtsrichtlinie"], "travel": ["Kosten", "Betriebsst\u00e4tte", "Linie", "Rahmen", "Caritasverband", "Ausw\u00e4rtst\u00e4tigkeit", "Ankunft", "Ort", "Reisef\u00fchrer", "Kilometergeld", "Wohnung", "Verbreitung", "Linienverkehr", "Eltern", "Aufenthalt", "Dienst", "Aufwand", "Schulbusschild", "Einrichtung", "Schul-/Klassenfahrt", "Auslandreisen", "Betriebsausgaben", "Bestandteil", "Reiseform", "Tramper-Bewegung", "Arbeiter", "Reisegr\u00fcnde", "Beamter", "Transportmittel", "Flug", "Unterhaltungsbetrieb", "Arbeitsplatz", "Schiffstrampen", "Dienstreise", "Beweggr\u00fcnde", "Sicherheitsregeln", "Teilnehmenden", "Unterrichtsveranstaltungen", "Verf\u00fcgung", "Japan", "Erde", "Dienstanweisungen", "Schulkonferenz", "Dampfschiff", "Heranwachsenden", "Bahntrampen", "Geld", "Kennenlernen", "H\u00f6chstdauer", "Verbrechen", "Weltreisef\u00fchrer", "Prozent", "Kleintransporter", "Vorschuss", "Lift", "Begegnung", "Auftrag", "Sch\u00fclerfahrten", "Unternehmen", "Reiseziel", "Treffen", "Schulfahrten", "Gr\u00fcndung", "Dienstgang", "Mitfahrt", "Pflicht", "Nicht-Schengen-Staat", "Verb", "Autostopp", "Schule", "Frau", "Stra\u00dfenverbindung", "Fahrtenprogramm", "\u00d6sterreich", "Interkontinentalstrecken", "Rechtsbegriff", "Privatwirtschaft", "Beschreibung", "Ziel", "Frauenfahrt", "Begriff", "Route", "Trennungsgeld", "Integrationsmilieu", "Band", "Vielzahl", "Wohlfahrtsverband", "Bundesland", "Regelarbeitszeit", "M\u00f6glichkeit", "Arbeitgeber", "Studienreise", "Opfer", "Dienstst\u00e4tte", "Organisation", "Anhalter", "\u00dcbernachtung", "Fahrgast", "Gastsch\u00fcler", "Indien", "Schulveranstaltung", "Polizei", "Bahn", "Dorf", "Haus", "Beurteilung", "Autofahrer", "Arbeitspflicht", "Regel", "Euro", "Leistung", "Stelle", "Erholung", "Schulleitung", "Bedarf", "Staat", "Abgefahren", "Soldat", "Reisesicherheit", "Handel", "Austauschjahr", "Milieu", "Wohnort", "Science-Fiction-Roman", "Kraftfahrzeug", "Finanzierung", "Personenverkehrsaufwand", "Fahrzeug", "Auslage", "Wandererlass", "Kurztrampen", "Europa", "Verein", "Klassenfahrt", "Kontinent", "Schulausflug", "Regelleistung", "Reiseverkehrsmittel", "B\u00e4nde", "Aufwendung", "Kraftfahrer", "Rechtsfragen", "Zweck", "Reiseverkehr", "Kind", "Entwicklung", "T\u00e4tigkeit", "Reisender", "Arbeitsanweisungen", "Hilfe", "Abi-Reise/Matura-Reise", "Familie", "Einzelnachweis", "Woche", "Programm", "Durchf\u00fchrung", "Medieninteresse", "Dienstreisender", "Daumen", "Sch\u00fcleraustausch", "Trampertreffen", "Frankreich", "Paar", "Schiffe", "Jahr", "Fahrtzwecken", "Kultusministerkonferenz", "Arbeitsleistung", "Mensch", "Erziehungsarbeit", "Generation", "Musterschule", "Sch\u00fclersammelliste", "Arbeitsort", "Richtung", "Monat", "Fahrrad", "Sch\u00fcler", "Hippie-Generation", "Gesellschaft", "Prestigemotivation", "Zeit", "Tipp", "\u00dcberlandstrecken", "Austauschreisen", "Reisekosten", "Betrieb", "Sch\u00fclerfahrt", "Englisch", "Welt", "EWR-B\u00fcrger", "Dienstgesch\u00e4ften", "B\u00fcrger", "Fahrt", "Wiki-Form", "Studienfahrten", "Schulfahrt", "Schulbus", "Schulprogramm", "Geschichte", "Klasse", "Dienstherrn", "Roman", "Jahrhundert", "Aktivit\u00e4t", "Freizeitverkehr", "Dienstreiseverkehr", "Dienstgesch\u00e4ft", "Information", "Unterst\u00fctzung", "Reisen", "Anreise", "N\u00e4chtigungsgeld", "Niveaumilieu", "Unterweisung", "Erlebnis", "Emission", "Arbeitsgesetz", "Dauer", "Tage", "Ausstrecken", "Exkursion", "Tag", "Arbeitszeit", "Wegzeit", "Verbindung", "Ausgabe", "Radfernreisende", "Studie", "Gesch\u00e4ftsreise", "Fahrtzweck", "Teilnahme", "Arbeitsunfall", "Weltreisender", "Land", "Schulveranstaltungen", "Risiko", "August", "Besch\u00e4ftigte", "September", "Verkehrsmittel", "Wegeunfall", "Veranstaltung", "Fahrer", "Hochkulturschema", "Teil", "Fahrtenerlass", "Arbeitsst\u00e4tte", "Bundesreisekostengesetz", "Bezug", "Bezeichnung", "Fahren", "Au\u00dfendienst", "Inselsberg", "Taggeld", "Arbeitnehmer", "Million", "Sinnentsprechung", "Mitnahme", "Abenteuer", "Rolle", "Allgemeines", "Schulwanderungen", "Jugend", "Form", "Mitreise", "Tourismus", "Unterricht", "Interesse", "Unterrichtsgang", "Landschulwoche", "Schild", "Vorphase", "Weblink", "Hippie-Bewegung", "Mitte", "Asien", "Hochphase", "Mitarbeiter", "Bef\u00f6rderungsklasse", "Zeitaufwand", "Reisedauer", "Schullandheim", "Thema", "Weltreise", "Einkommensteuergesetz", "Nordamerika", "Berg", "Lehrer", "Lernen", "Werbungskosten", "Flugzeug", "Anteil", "Gef\u00e4hrdungsbeurteilung", "Bestimmung", "Einreiseerlaubnis", "\u00dcberwindung", "Anfangphase", "Alltag", "Dienststelle", "Weltumrundung", "Gruppe", "Schulverein", "Gastfamilie", "Vorschrift", "Regelung", "Dienstreisende", "Schulreise", "Trivialschema", "Trampkultur", "Tagesausflug", "Abschlussfahrten", "Milliarde", "Strecke", "Zusammenhang", "Stadt", "Wagenklasse", "Transitstaat", "Kultur", "Selbstverwirklichungsmilieu", "Auto", "Einsatzorganisation", "Tschechien", "Arbeit", "Transport", "Eisenbahn", "Tramper", "Sicherheit", "Fahrtkosten", "Motivation", "Erziehungszwecken", "Reise", "Strandaufenthalt", "Meyers", "Weltraum", "Beispiel", "Haust\u00fcrgesch\u00e4ft", "Beginn", "Wohnmobil", "Literatur", "Deutschland", "Forschungsweltreise", "\u00dcbernachtungskosten", "Gelegenheit", "Beschluss", "Schullandheimaufenthalten", "Schiff", "Schweiz", "Verfahren", "Pass", "Wunsch", "Mitfahrwunsch", "Autostop", "Sch\u00fclerliste", "Richter", "Irland", "Autor", "Quelle", "Zahl", "Gebiet", "Bildung", "Bedeutung", "Verhaltensregeln"]}