["Ein Repository (englisch für Lager, Depot oder auch Quelle; Plural: Repositorys), auch – direkt aus dem Lateinischen entlehnt – Repositorium (Pl. Repositorien), ist ein verwaltetes Verzeichnis zur Speicherung und Beschreibung digitaler Objekte für ein digitales Archiv. \nBei den verwalteten Objekten kann es sich beispielsweise um Programme (Software-Repository), Publikationen (Dokumentenserver), Datenmodelle (Metadaten-Repository) oder betriebswirtschaftliche Verfahren handeln. Häufig beinhaltet ein Repository auch Funktionen zur Versionsverwaltung der verwalteten Objekte.\n\n\n== Repository zur Versionsverwaltung ==\nBei Versionsverwaltungssystemen wie CVS, Git oder SVN werden die Quellcodedateien oder andere Dateien in einem  Repository oder Projektarchiv gehalten. Sie werden von dort „ausgecheckt“, d. h. auf den Rechner eines Programmierers geladen. Nach der Bearbeitung werden die geänderten Dateien wieder in das Repository „eingecheckt“, wobei die Veränderung protokolliert wird. Die Versionsverwaltung dient der Dokumentation der Systementwicklung, erlaubt aber auch die jederzeitige Rekonstruktion von früheren Zuständen der Systembeschreibung.\nEin solches Versionsverwaltungssystem ermöglicht die Zusammenarbeit von großen Teams an Softwareprojekten, da über die Versionsverwaltung Unterschiede an Dateien gefunden und von einem merge-Mechanismus zusammengefügt werden können. Somit geht keine Änderung verloren.\nEine Hauptfunktion der Versionsverwaltung ist die Versionsgeschichte, die dem Benutzer erlaubt, auf jeden von einem Benutzer \"eingechecktem\" Stand einer Datei zurückzuspringen und diese Version zu verwenden.\n\n\n== Software-Repository ==\nHierbei enthält das Repository Programmpakete und zugehörige Metadaten, z. B. Beschreibungen der Pakete, Abhängigkeitsinformationen und Änderungsprotokolle. Das Installieren bzw. Aktualisieren der Software aus dem Repository übernimmt ein Paketmanager. Daher wird in diesem Zusammenhang auch oft die deutschsprachige Bezeichnung Paketquelle benutzt. Populäre Beispiele für Software-Repositorys sind CPAN oder Portable Apps.\nDieses Prinzip wird häufig von Linux-Distributionen verwendet, um dem Benutzer an zentraler Stelle Zugriff auf aktuelle oder getestete Software zu ermöglichen. Ein Vorteil ist, dass mit einem Update durch die Paketverwaltung sowohl das System als auch die Anwendungen aktualisiert werden und so das manuelle Überprüfen der Aktualität durch Besuch der einzelnen Projektwebseiten entfällt. Die Pflege eines Programmpakets in einem Update-Repository übernimmt ein Paket-Maintainer, der meist aus der Community rund um die Distribution stammt und nicht in die eigentliche Entwicklung der Software involviert sein muss.\n\n\n== Metadaten-Repository ==\nBei Metadaten-Repositorien handelt es sich üblicherweise um Datenbanktabellen zur Verwaltung von Metadaten, die als Basis für hochintegrative Systeme dienen. In ihnen sind alle notwendigen Beschreibungen zum\nSystem selbst und zur Umwelt enthalten. Mit Hilfe von Metadaten-Repositorys können diese\nSysteme ohne Programmieraufwand flexibel auf Änderungen reagieren nach dem Motto: „Definieren statt Programmieren“. Metadaten-Repositorys werden unter anderem in Data-Warehouse und EAI-Architekturen eingesetzt.\nAuch die freie Faktensammlung Wikidata kann in diesem Sinne als Repository angesehen werden.\n\n\n== CASE-Werkzeuge ==\nBei manchen Modellierungswerkzeugen („CASE“ = Computer-aided software engineering) dient das Repository zur Speicherung aller Projektdaten wie beispielsweise Diagrammen, Quellcode und Dokumentationen.\n\n\n== Dokumentenserver ==\nIm Umfeld von Netzpublikationen wird der Begriff Repository synonym für Dokumentenserver verwendet. Ein Beispiel für einen Dokumentenserver ist ArXiv.org.\n\n\n== Siehe auch ==\nData-Dictionary\nData-Warehouse-System\nDigitale Bibliothek\nRPM Fusion, ein Beispiel", "Die Plattdeutsche Bibliographie und Biographie (PBuB) ist eine Datenbank über niederdeutsche Bücher und Autoren. Ihr Ziel ist es, alle selbstständigen Veröffentlichungen und ihre Autoren von 1800 bis 2000 zu erfassen und Autorenbiografien bereitzustellen. Die Einträge sind in Hochdeutsch.\nVerantwortlich für die Datenbank ist das Institut für niederdeutsche Sprache in Bremen.\n\n\n== Weblinks ==\nPlattdeutsche Bibliographie und Biographie (PBuB)", "Ein Datensatz () ist (beispielsweise nach Mertens) eine Gruppe von inhaltlich zusammenhängenden (zu einem Objekt gehörenden) Datenfeldern, z. B. Artikelnummer und Artikelname. Datensätze entsprechen einer logischen Struktur, die bei der Softwareentwicklung (z. B. im konzeptionellen Schema der Datenmodellierung) festgelegt wurde.In der Datenverarbeitung werden zu Datensätzen zusammengefasste Daten in Datenbanken oder in Dateien gespeichert. Sie sind Gegenstand der Verarbeitung von Computerprogrammen und werden von diesen erzeugt, gelesen, verändert und gelöscht (siehe CRUD). Bei der Eingabe wird der Inhalt von Datensätzen oft in der Form eines Formulars dargestellt, bei der Ausgabe oder Anzeige auch in Listen­form, ggf. nur mit einem Teil der Datenfelder.\nAuch nicht-elektronische Daten können zu Datensätzen zusammengefasst sein, zum Beispiel ist eine Karteikarte in einer Kartei ein Datensatz.Neben der Bedeutung von „Datensatz“ im engeren Sinn – als Sammlung konkreter Daten (z. B. die Adressdaten von Kunde Müller) – wird der Ausdruck im Kontext der Softwareentwicklung auch als Typbegriff bei der Deklaration von Daten verwendet; Beispiel: Datensatz ‚Adressdaten‘. Abhängig von den dabei angewendeten Methoden, Programmiersprachen etc. werden anstelle von ‚Datensatz‘ auch Termini wie Satz (englisch Record), Entitätstyp, Klasse, Tupel, Struktur, Verbund usw. benutzt. Deren logischer Aufbau wird im Rahmen des Konzeptionellen Schemas der Datenmodellierung festgelegt.Abgrenzung: Obwohl Daten eigentlich immer als Aneinanderreihung mehrerer Datenelemente auftreten, nennt man nicht alle Erscheinungsformen von Daten ‚Datensatz‘, sondern nur Datengruppierungen, die zu einem bestimmten Objekt gehören und die innerhalb eines Datenbestands identische Strukturen aufweisen. Die Datenfelder ‚Name‘, ‚Adresse‘ und ‚Geburtsdatum‘ könnten also einen Datensatz zu einer Person bilden. Nicht als Datensätze in diesem Sinn gelten zum Beispiel: Fließtexte, Drucker- oder Video-Datenströme, Inhalte von ausführbaren Dateien, Fotodaten oder die Daten von Grafiksoftware.\n\n\n== Abweichende Bedeutung in der Statistik ==\nZusammenfassend bezeichnet der Datensatz in der Informatik – wie oben beschrieben – eine eindimensionale, strukturierte Folge von Attributen eines Elements einer übergeordneten Menge (z. B. eine Karteikarte einer Kartei, eine  Bestellung einer Datenbank für Bestellungen, eine Zeile einer Adressliste).\nDagegen bezeichnet der Datensatz in der Statistik die Gesamtheit von Daten in einem bestimmten Zusammenhang. Hier ist er also gleichbedeutend mit Datenbestand (ein Satz bzw. eine Sammlung von Daten, auch aus der Übersetzung von Data Set, früher bei IBM für Datei verwendet) – beispielsweise alle in einer statistischen Erhebung ermittelten Daten oder die „Steuersünder-CD“.\n\n\n== Varianten bei der Speicherung ==\nIm Allgemeinen entspricht ein Datensatz, mit den Ausdrucksmitteln von Programmiersprachen deklariert, dem Datentyp Verbund bzw. Record, ggf. innerhalb eines assoziativen Arrays. Das mathematische Modell eines Datensatzes ist ein Tupel.\nBezüglich der Speicherung von Datensätzen lassen sich zahlreiche Unterscheidungen treffen. Zum Beispiel:\n\nSpeicherung in normalen Dateien: Hier bieten sich Alternativen wie:\nBenutzerdefinierte individuelle Datenformate und -strukturen,\nCSV-Dateien mit Feldtrennzeichen wie Strichpunkt o. ä.,\nXML-Format in der Form <Feldname = Feldinhalt> und mit weiteren strukturbezogenen, textlich formulierten Informationen,\nRDF-Format für Internet-Informationen.\nSpeicherung in Datenbanken:\nIn relationalen Datenbanken werden Datensätze in Tabellenform gespeichert, wobei ein Datensatz i. d. R. einer Tabellenzeile entspricht.\nSpaltenorientierte Datenbanken speichern nicht alle Datenfelder je Datensatz hintereinander, sondern für jedes Datenfeld die Inhalte aller Datensätze, eine Spalte (mit all ihren Zeilen) steht hier also für 'Datensatz'.Im Detail ist ‚Datensatz‘ jedoch kein technischer, sondern ein logischer Begriff, für den es zahlreiche technische Erscheinungs- und Implementierungsfomen gibt. Dabei können Datensätze nach den folgenden Merkmalen/Eigenschaften unterschieden werden:\n\nAllgemeingültigkeit: Verbindlich festgelegte Strukturen und Formate (wie binäre Daten oder Text, Länge, sonstige Regeln), z. B. für bestimmte Softwarelösungen (wie beim DTA-Verfahren) vs. individuell vom Anwender definierte Formate.\nSatz-/Datenfeldlänge: Fixe und einheitliche Länge je Feld vs. variabel lange Felder (z. B. mit Feldtrennzeichen wie bei CSV oder mit Feldlängenangabe); führt entsprechend zu Datensätzen mit fixer oder variabler Länge.\nVerwendete Zeichenkodierung: Nur Textzeichen z. B. im ASCII-Code vs. andere Datentypen in einem Binärcode.\nFeldattribute: Nur Nettodaten vs. weitere Informationen je Feld (wie fett, unterstreichen, Schrifttyp usw., meist nicht sichtbar).\nDatensatzbegrenzung: Satzende-Kennzeichnung vs. feste Satzlänge.\nHomogenität: Einheitliche vs. unterschiedliche Datenarten in derselben Datei, erkennbar z. B. durch ein Datenfeld ‚Satzart‘.In Anwendungen zur Tabellenkalkulation wird ein Datensatz meist durch eine Zeile, je nach Anordnung alternativ durch eine Spalte repräsentiert. Ein klassisches Beispiel für einen Datensatz ist eine Lochkarte.\nFür elektronische Daten gilt: Sie existieren in ihrem Speichermedium als Bit-/Bytefolgen beliebiger Länge. In dieser Datenmenge werden die einzelnen Datensätze und Datenfelder durch meist von der Programmiersprache und/oder der Systemsoftware bereitgestellte Verfahren identifiziert und adressiert und zum Beispiel in Zeilen und Spalten dargestellt.\n\nLogische/physische Datensätze: Auf elektronischen Datenträgern werden in der Regel mehrere Datensätze zu größeren Speichereinheiten zusammengefasst. Solche Einheiten werden je nach Computersystem unterschiedlich bezeichnet, zum Beispiel als ‚Page‘ (Seite, bei vielen Datenbanksystemen) oder als Block (bei konventioneller Speicherung). In einem Computerprogramm sind der Verarbeitung des einzelnen Datensatzes Routinen vorgeschaltet (meist des Betriebssystems oder des DBMS), die das tatsächliche Lesen oder Schreiben auf dem Datenträger aus Optimierungsgründen block-/seitenweise durchführen und den jeweils einzelnen Datensatz innerhalb des Datenblocks iterativ positionieren und zur Verarbeitung im Hauptspeicher bereitstellen.\n\n\n== Siehe auch ==\nDatenbanktabelle\n\n\n== Einzelnachweise ==", "Relationale-Datenbank-Muster sind Muster, die im Entwurf relationaler Datenbanken eingesetzt werden.\n\n\n== Grundlegende Tabellentypen ==\nReferenztabelle\nEine Referenztabelle ist eine Tabelle, die über die Zeit relativ konstant bleibt und relativ wenige Spalten aufweist. Häufig anzutreffen sind dabei Key-Value-Referenztabellen mit nur zwei Spalten. Als Schlüssel sollten hierbei Zeichenfolgen verwendet werden, um Joins zu vermeiden.\nMastertabelle\nEine Mastertabelle ist eine Tabelle, welche die Eigenschaften eines Objektes (Person, Adresse etc.) in getrennten Spalten ablegt. Kleine Mastertabellen sollten hierbei mit einer eindeutigen Zeichenfolge; bei großen Mastertabellen und Mastertabellen, deren Inhalt sich oft ändert, sollte eine Ganzzahl als Schlüssel angelegt werden.\nTransaktionstabelle\nEine Transaktionstabelle ist eine Tabelle die Interaktionen oder Ereignisse zwischen Mastertabellen speichert. Beispielsweise eine Liste von Objekten, die ein Kunde in einen Warenkorb gelegt hat. Als Schlüssel sollten automatisch generierte Ganzzahlen verwendet werden.\nQuerverweistabelle\nEine Querverweistabelle ist eine Tabelle in der die Beziehungen zwischen Mastertabellen gespeichert werden. In Querverweistabellen werden n:n-Beziehungen in mehreren Zeilen abgebildet. Als Schlüssel sollte eine Kombination aus mehreren Spalten gewählt werden.\n\n\n== Erweiterte Tabellentypen ==\nBegrenzte Transaktion\nAls begrenzte Transaktion bezeichnet man eine Einschränkung auf einer Tabelle, die definiert welche Transaktionen wann zulässig sind. Dieses Muster kann eingesetzt werden um entsprechende Prüfungen auf der Anwendungsseite zu reduzieren und um die Sicherheit der Datenbank vor falsch implementierten Anwendungen zu erhöhen.\nVergänglicher Primärschlüssel\nwerden eingesetzt, wenn sich eine Eigenschaft eines Objektes als Primärschlüssel anbietet (z. B. eine Kundennummer), diese sich jedoch möglicherweise ändert. In diesem Fall kann die entsprechende Eigenschaft zwar als Primärschlüssel verwendet werden, Änderungen müssen jedoch in einer History-Tabelle protokolliert werden um auch eine nachträgliche Zuordnung gewährleisten zu können.\n\n\n== Muster für Fremdschlüssel ==\nFremdschlüsselbegrenzung\nbezeichnet es, wenn das Löschen eines Eintrags (Zeile) aus einer Tabelle die mit dem Eintrag verknüpften Einträge (in einer anderen Tabelle) nicht mit löscht. Die Fremdschlüsselbegrenzung ist somit das Gegenteil der Fremdschlüsselkaskade.\nIn SQL wird eine Fremdschlüsselbegrenzung mit dem Befehl DELETE RESTRICT angestoßen. Dieses Verhalten ist bei den meisten Datenbankimplementierungen das Standardverhalten, wenn nur der Befehl DELETE alleine angegeben wird.\nFremdschlüsselkaskade\nEine Fremdschlüsselkaskade ist das Gegenteil der Fremdschlüsselbegrenzung. Beim Löschen eines Eintrags werden die mit dem Eintrag verknüpften Einträge mitgelöscht.\nIn SQL wird eine Fremdschlüsselbegrenzung mit dem Befehl DELETE CASCADE angestoßen.\nQuerverweisvalidierung\nEine Querverweisvalidierung wird eingesetzt, wenn Spalten in einer Mastertabelle eine bestimmte Relation miteinander aufweisen müssen. Diese Relation wird in einer getrennten Querverweistabelle gespeichert. Durch die getrennte Querverweistabelle wird zwar der Ressourcenverbrauch der Datenbank erhöht, der Einsatz ist jedoch nötig um die Gültigkeit der Daten prüfen zu können.\n\n\n== Sicherheitsmuster ==\nSchreibgeschützte Lookup-Tabelle\nEine schreibgeschützte Lookup-Tabelle ist eine Tabelle die eine Zuordnung zwischen zwei Tabellen definiert, deren Inhalt zwar allgemein abgefragt werden kann, jedoch nur von bestimmten Rollen bzw. Gruppen bearbeitet werden darf. Ein Beispiel ist die Verknüpfung von bestimmten Produkten mit einem Rabatt.\n\n\n== Denormalisierungsmuster ==\n\nDenormalisierungsmuster ermöglichen die Denormalisierung einer Datenbank zum Zweck der Verbesserung des Laufzeitverhaltens.\n\nFetching\nBeim Fetching werden Daten aus einer Tabelle in eine andere (temporäre) Tabelle (z. B. eine Transaktionstabelle) kopiert. Hierbei ist darauf zu achten, dass eine Änderung in der Quelltabelle nicht automatisch in die Zieltabelle übernommen wird.\nVorweggenommene Aggregation\n\nBei der vorweggenommenen Aggregation werden Werte aus verschiedenen Quellen bereits im Voraus im Zuge einer (lang laufenden) Stapelverarbeitung berechnet und in einer weiteren Tabelle zwischengespeichert. Die Werte werden dabei nicht bei jeder Abfrage neu berechnet, sondern erst im Zuge der nächsten Stapelverarbeitung. Der Vorteil ist, dass der Zugriff deutlich schneller ist und die Ressourcen der Datenbank geschont werden. Nachteilig wirkt sich aus, dass vor kurzem getätigte Änderungen an in der Berechnung nicht berücksichtigt sind.\nErweiterung\nEine Erweiterung der Tabelle liegt dann vor, wenn eine Spalte in der Tabelle durch die Berechnung aus anderen Spalten gebildet wird. Hierdurch muss die Berechnung nicht bei jeder Abfrage erneut durchgeführt werden, sondern erst wenn sich der Eintrag ändert.\n\n\n== Objekt-Relationale Verhaltensmuster ==\n\nTabelle pro Vererbungshierarchie\n(englisch: Single Table Inheritance) verwendet eine einzige Tabelle für jede Klasse, um einen Klassenbaum in einer Datenbank abzubilden.\nTabelle pro Unterklasse\n(englisch: Class Table Inheritance) verwendet eine eigene Tabelle für jede konkrete oder abstrakte Klasse, um einen Klassenbaum in einer Datenbank abzubilden.\nTabelle pro konkrete Klasse\n(englisch: Concrete Table Inheritance) verwendet eine eigene Tabelle für jede konkrete Klasse, um einen Klassenbaum in einer Datenbank abzubilden.\n\t\t\n\t\t\nsiehe auch: Relationale-Datenbank-Muster, Entwurfsmuster\n\n\n== Verteilungsmuster ==\nBei den Verteilungsmustern wird im Wesentlichen zwischen keiner Verteilung, Replikation und Fragmentierung (englisch: Sharding) unterschieden:\n\nDie Replikation nimmt dieselben Teile der Daten und kopiert diese auf mehrere Server, um eine höhere Ausfallsicherheit zu gewährleisten.\nDie Fragmentierung verteilt unterschiedliche Teile der Daten und verteilt diese über mehrere Server, um eine bessere Lastenverteilung zu gewährleisten.Die Replikation kann hierbei mit Fragmentierung kombiniert werden. Zudem unterscheidet man bei der Replikation zwischen der Master/Slave-Replikation und der Peer-to-Peer-Replikation.\n\n\n=== Single-Server ===\n\nDas einfachste Verteilungsmuster ist keine Verteilung. Die Datenbank läuft vollständig auf einem einzelnen Server, der sämtliche Schreib- und Lesezugriffe behandelt. Der Vorteil dieses Musters ist es, dass der Server einfach zu warten ist. Updates, Datensicherungen, Reparaturen, Upgrades etc. lassen sich bei diesem Muster zentral behandeln.Zudem müssen Softwareentwickler keine aufwändige Logik implementieren um Probleme mit der Konsistenz, Verfügbarkeit oder Partitionierung zu behandeln (siehe auch: CAP-Theorem).\nDiese Variante bietet sich auch besonders bei Graphdatenbanken an, da Latenzen durch den Zugriff von Daten über das Netzwerk vermieden werden.\n\n\n=== Fragmentierung ===\n\nBei der Fragmentierung (englisch: Sharding) werden unterschiedliche Datenbanken bzw. voneinander unabhängige Teile der Datenbank auf verschiedene Server, die Shards, verteilt.Hierdurch ergibt sich eine bessere Lastverteilung. Zudem fallen bei einem Ausfall des Servers nicht alle Applikationen aus, sondern nur jene die auf die jeweiligen Daten zugreifen oder schreiben müssen.\nDa die Lese-und-Schreibzugriffe für jeweils bestimmte Daten vom jeweiligen Shard alleine bearbeitet werden, ergibt sich keine Inkonsistenz der Daten.\n\n\n=== Federation ===\nAls Federation bezeichnet man einen Spezialfall der Fragmentierung, bei dem ein zentraler Server, federation root genannt, die Verteilung der einzelnen Shards automatisch bestimmt.\n\n\n=== Master/Slave-Replikation ===\nBei der Master/Slave-Replikation übernimmt ein zentraler Server, der Master, alle Schreibzugriffe auf die Datenbank. Anschließend werden die Änderungen auf die anderen Server, den Slaves (Sklaven) übermittelt. Wenn der Master-Server ausfallen sollte, kann ein Slave die Rolle des Masters übernehmen.Da es etwas dauert, bis die Änderungen von den Slave-Servern übernommen werden, kann es kurzzeitig zu Dateninkonsistenzen kommen.\nAlle Server ermöglichen Lesezugriffe, wodurch es bei Lesezugriffen zu einer Lastverteilung kommt. Da Schreibzugriffe jedoch zentral bearbeitet werden, stellt der Master einen Flaschenhals dar.\n\n\n=== Peer-to-Peer-Replikation ===\nBei der Peer-to-Peer-Replikation, sind alle Server über ein Peer-to-Peer-Netzwerk verbunden. Jeder Server übernimmt sowohl Schreib- als auch Lesezugriffe. Schreibzugriffe werden hierbei mit allen Servern synchronisiert.Da es jedoch einige Zeit dauert bis die Schreibzugriffe synchronisiert werden, kann es bei diesem Modell zu Dateninkonsistenzen kommen. Dieser Effekt tritt hier besonders zutage, wenn die Netzwerkverbindung zwischen zwei Standorten ausfällt.\nDer Vorteil dieser Konfiguration ist, dass eine besonders hohe Ausfallsicherheit gegeben ist. Der Wegfall einzelner Peers führt nicht zu einem Datenverlust. Zudem ist dieses Modell leicht horizontal skalierbar, da bei Engpässen einfach weitere (kostengünstige) Rechner hinzugefügt werden können.\nDie Peer-to-Peer-Replikation ist in der Softwareentwicklung und der Wartung (Updates, Backups etc.) besonders aufwändig und bedarf daher einer guten Planung seitens des Betreibers.\n\n\n=== Fragmentierung mit Master-Slave-Replikation ===\nDie Fragmentierung und Master-Slave-Replikation kann auch kombiniert werden. Hierbei werden für jeden Datentyp ein Master bestimmt und auf mehrere andere Server, welche hierbei dem Master als Slaves dienen, repliziert. Ein Server kann hierbei die Rolle des Masters für einen Datentyp und die Rolle des Slave für andere Datentypen gleichzeitig übernehmen.\n\n\n=== Fragmentierung mit Peer-to-Peer-Replikation ===\nAls letzte Möglichkeit bietet sich noch die Fragmentierung eines Peer-to-Peer-Netzwerkes an. Hierbei werden mehrere Server zusammengefasst um sich als Peer-to-Peer-Netzwerk um einen bestimmten Datentyp zu kümmern. Jeder Server kann hierbei Teil von mehreren Peer-to-Peer-Netzwerken sein und somit unterschiedliche Datentypen behandeln.\n\n\n== Weitere Muster ==\nAuflösungsmuster\nDas Auflösungsmuster wird eingesetzt, wenn ein Wert aus verschiedenen Quellen kommen bzw. berechnet werden kann und entschieden werden muss, welche Quelle gewählt wird bzw. welches Berechnungsmodell anzuwenden ist.\nHistory-Tabelle\nEine History-Tabelle ist eine Tabelle die Änderungen protokolliert. Durch diese Tabelle sind Änderungen nachvollziehbar und der ursprüngliche Zustand der überwachten Tabelle wiederherstellbar. Ein Beispiel für eine History-Tabelle ist die „Versionsgeschichte“ der Wikipedia, in der Änderungen in Form von Diff-Elementen gespeichert werden.\nsiehe auch: Versionsverwaltung\nAbhängigkeitsseqenzierung\nBei einer Abhängigkeitsseqenzierung muss eine Reihe von Befehlen in einer Sequenz abgearbeitet werden. Da einige Befehle vom Ergebnis anderer Befehle abhängig sein können, muss die korrekte Reihenfolge mit Hilfe eines gerichteten Analysegraphen (englisch: directed analytic graph) ermittelt und in einer eigenen Tabelle abgebildet werden.\nSicheres Passwortrücksetzen\nDie Datenbank muss ein sicheres Zurücksetzen des Passwortes erlauben, falls der Benutzer das Passwort vergessen hat. Das Passwort darf weder im Klartext oder wiederherstellbar in der Datenbank gespeichert werden, noch darf das Passwort des Benutzers über einen unsicheren Kanal (z. B. etwa in einer E-Mail oder eine nicht mit SSL verschlüsselte Webseite) übermittelt werden.\n\n\n== Antimuster ==\n\nUmgekehrter FremdschlüsselEin umgekehrter Fremdschlüssel (englisch reverse foreign key) entsteht, wenn ein bestimmter Eintrag einer Tabelle einen bestimmten Eintrag in einer anderen Tabelle verhindern soll. Ein Umgekehrter Fremdschlüssel sieht auf den ersten Blick oft wie ein Primärschlüssel aus.\n\n\n== Literatur ==\nScott J. Ambler, Pramodkumar J. Sadalage: Refactoring Databases: Evolutionary Database Design. Prentice Hall, Addison-Wesley, 2011, ISBN 978-0-321-77451-4, S. 384 (englisch). \nScott J. Ambler: Agile Database Techniques. John Wiley & Sons, 2003, ISBN 978-0-471-20283-7, S. 480 (englisch). \nLen Silverston: The Data Model Resource Book: Volume 1: A Library of Universal Data Models for All Enterprises. John Wiley & Sons, 2001, ISBN 978-0-471-38023-8, S. 560 (englisch). \nLen Silverston: The Data Model Resource Book: Volume 2: A Library of Universal Data Models by Industry Types. John Wiley & Sons, 2001, ISBN 978-0-471-35348-5, S. 576 (englisch). \nLen Silverston, Paul Agnew: The Data Model Resource Book: Volume 3: Universal Patterns for Data Modeling. John Wiley & Sons, 2009, ISBN 978-0-470-17845-4, S. 648 (englisch). \n\n\n== Weblinks ==\nShivprasad Koirala: 11 important database designing rules which I follow. In: The Code Project. 7. September 2012, abgerufen am 7. März 2013 (englisch). \n\n\n== Einzelnachweise ==", "Eine Logdatei (auch Protokolldatei, Ereignisprotokolldatei; englisch log file) enthält das automatisch geführte Protokoll aller oder bestimmter Aktionen von Prozessen auf einem Computersystem.\nWichtige Anwendungen finden sich vor allem bei der Prozesskontrolle und Automatisierung. Prinzipiell werden alle Aktionen mitgeschrieben, die für eine spätere Untersuchung (Audit) erforderlich sind oder sein könnten. Der Flugschreiber in Flugzeugen ist ein Beispiel für kontinuierliche Protokollierung, die jedoch selten ausgewertet wird, zum Beispiel nach einem Unfall.\nIm Bereich der Datenbanken gibt es ein Transaktionsprotokoll, in der Änderungen an der Datenbank von korrekt abgeschlossenen Transaktionen (per Commit abgeschlossen) festgehalten werden, um im Fall eines Fehlers (z. B. Systemabsturz) den aktuellen Datenbestand wiederherstellen zu können.\nDas Wort Logfile wird in Teilen der Blogosphäre zunehmend auch als Begriff für einen Blog-Eintrag genutzt. Mit dieser Bedeutung wurde der Begriff zunächst nur von Log-Files.de (diese Seite ist inzwischen gesperrt) verwendet, inzwischen ist er gerade bei Blogs mit reinem Tagebuch-Charakter beliebt.\n\n\n== Grundlagen ==\nAuf einem PC können Protokolldateien bestimmter Aktionen von einem oder mehreren Nutzern an einem Rechner geschrieben werden, ohne dass diese es bemerken oder ihre Arbeit beeinflusst wird. Wesentlich ist hierzu das Systemlogbuch (unter Linux meist in /var/log/messages, aber auch Windows NT und Nachfolger schreiben entsprechende Einträge in eines oder mehrere Ereignisprotokolle), wenn sie entsprechend konfiguriert werden. Darin können u. a. die Anmeldungen am System protokolliert werden, aber auch andere wichtige Informationen.\nAußer dem Betriebssystem selbst schreiben meist Hintergrundprogramme (z. B. ein E-Mail-Server, ein Proxyserver und anderes) in Logdateien, um Aktionsmeldungen, Fehlermeldungen und Hinweise persistent (dauernd) oder temporär verfügbar zu halten. Ähnliches gilt für Installationsprogramme, Firewalls, Virenscanner und dergleichen. Logdateien werden im Idealfall auf einem von der Anwendung getrennten Laufwerk gespeichert, um die I/O-Ressourcen der Anwendung nicht einzuschränken.Logdateien werden auch von Webservern erstellt, können aber auch außerhalb des Internets bei Untersuchungen der Benutzerfreundlichkeit von Programmen, allgemeinem Nutzerverhalten oder der Fehlersuche in einem System genutzt werden.\nDie Logdatei wird bei der Logdateianalyse untersucht.\n\n\n== Aufbau einer Protokollzeile ==\nPrinzipiell enthält eine Protokollzeile in einer Logdatei meist ein Ereignis sowie das dazugehörige Datum und die dazugehörige Uhrzeit als Zeitstempel. Dabei wird die Zeitangabe meist vorangestellt, da es sich bei einer Logdatei um eine chronologische Aufstellung handelt.\n\n\n=== Protokolldatei ===\nBei dem Beispiel handelt es sich um den (in der Mitte gekürzten) Inhalt der Protokolldatei \\WINDOWS\\system32\\wbem\\Logs\\setup.log unter Windows XP; links der Zeitstempel, rechts die zu dieser Zeit ausgeführte Aktion:\n\n(Sun Sep 13 23:02:05 2009): Beginning Wbemupgd.dll Registration\n(Sun Sep 13 23:02:05 2009): Current build of wbemupgd.dll is 5.1.2600.2180 (xpsp_sp2_rtm.040803-2158)\n(Sun Sep 13 23:02:05 2009): Beginning Core Upgrade\n(Sun Sep 13 23:02:05 2009): Beginning MOF load\n(Sun Sep 13 23:02:05 2009): Processing C:\\WINDOWS\\system32\\WBEM\\cimwin32.mof\n(Sun Sep 13 23:02:09 2009): Processing C:\\WINDOWS\\system32\\WBEM\\cimwin32.mfl\n(Sun Sep 13 23:02:12 2009): Processing C:\\WINDOWS\\system32\\WBEM\\system.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\evntrprv.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\hnetcfg.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\sr.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\dgnet.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\whqlprov.mof\n(Sun Sep 13 23:02:16 2009): Processing C:\\WINDOWS\\system32\\WBEM\\ieinfo5.mof\n(Sun Sep 13 23:02:17 2009): MOF load completed.\n(Sun Sep 13 23:02:17 2009): Beginning MOF load\n(Sun Sep 13 23:02:17 2009): MOF load completed.\n(Sun Sep 13 23:02:17 2009): Core Upgrade completed.\n(Sun Sep 13 23:02:17 2009): Wbemupgd.dll Service Security upgrade succeeded.\n(Sun Sep 13 23:02:17 2009): Beginning WMI(WDM) Namespace Init\n(Sun Sep 13 23:02:20 2009): WMI(WDM) Namespace Init Completed\n(Sun Sep 13 23:02:20 2009): ESS enabled\n(Sun Sep 13 23:02:20 2009): ODBC Driver <system32>\\wbemdr32.dll not present\n(Sun Sep 13 23:02:20 2009): Successfully verified WBEM OBDC adapter (incompatible version removed if it was detected).\n(Sun Sep 13 23:02:20 2009): Wbemupgd.dll Registration completed.\n(Sun Sep 13 23:02:20 2009):\n\n\n=== Serverlog ===\nEine typische Webserver-Logdatei („Combined Log Format“) sieht folgendermaßen aus (Auszug mit zwei Einträgen):\n\n183.121.143.32 - - [18/Mar/2003:08:04:22 +0200] \"GET /images/logo.jpg HTTP/1.1\" 200 512 \"http://www.wikipedia.org/\" \"Mozilla/5.0 (X11; U; Linux i686; de-DE;rv:1.7.5)\"\n183.121.143.32 - - [18/Mar/2003:08:05:03 +0200] \"GET /images/bild.png HTTP/1.1\" 200 805 \"http://www.google.org/\"\n…\n\nKann man selber auf einem Server mit der eigenen Webpräsenz keine Protokolldateien abrufen, dann ermöglichen verschiedene Webdienste (z. B. Nedstat oder W3 Statistics) das Setzen eines kleinen Zählers auf der eigenen Webpräsenz. Dieser Zähler wird immer wieder beim Abrufen der Seite vom Anbieterserver geladen, wo daraufhin eine Auswertung der Zugriffe mithilfe der Zugriffs-Protokolldatei in Form von Tabellen und Grafiken erstellt wird. Hilfsmittel dabei können Zählpixel und HTTP-Cookies sein, wobei es letztere Internetseitenbetreibern durch das Speichern von eindeutigen Seriennummern ermöglichen, Logdateien über einzelne zugreifende Computer über einen längeren Zeitraum zu führen.\n\n\n== Log-Levels ==\nDa das Loggen aller Programmereignisse die für Logdateien verfügbaren Ressourcen innerhalb kurzer Zeit aufbrauchen würde und die Auffindbarkeit bestimmter Ereignisse erschweren würde, werden verschiedene Dringlichkeitsstufen definiert, welche nach Bedarf ein- und ausgeschaltet werden können.\nÜbliche Definition von Log-Levels:\nFatal\nFehler, welcher zur Terminierung der Anwendung führt.\nError\nLaufzeitfehler, welcher die Funktion der Anwendung behindert, oder unerwarteter Programmfehler.\nWarning\nAufruf einer veralteten Schnittstelle, fehlerhafter Aufruf einer Schnittstelle, Benutzerfehler oder ungünstiger Programmzustand.\nInfo\nLaufzeitinformationen wie der Start und Stopp der Anwendung, Benutzeranmeldungen und -abmeldungen, sowie durchgeführte Geschäftstransaktionen.\nDebug\nInformationen zum Programmablauf. Wird im Normalfall nur in der Entwicklung oder zur Nachvollziehung eines Fehlers verwendet.\nTrace\nDetaillierte Verfolgung des Programmablaufs, insbesondere zur Nachvollziehung eines Programmierfehlers.Wichtig ist hierbei, dass in Logdateien und -datenbanken nur Informationen zum Programmablauf und -zustand erhoben werden sollen, jedoch keine Informationen zu den Benutzern des Programms.\n\n\n== Zulässigkeit in Deutschland ==\n\nNach § 15 des deutschen Telemediengesetzes dürfen Diensteanbieter personenbezogene Daten eines Nutzers nur erheben und verwenden, soweit dies erforderlich ist, um die Inanspruchnahme von Telemedien zu ermöglichen und abzurechnen. Über das Ende des Nutzungsvorgangs hinaus dürfen Nutzungsdaten nur gespeichert werden, soweit sie für Zwecke der Abrechnung mit dem Nutzer erforderlich sind. Auf dieser Grundlage hat das Amtsgericht Berlin 2007 entschieden, dass die Protokollierung der IP-Adressen der Benutzer eines öffentlich zugänglichen Internetportals ohne deren Einwilligung unzulässig ist.\n\n\n== Logger ==\nLogger sind Softwarekomponenten für Computerprogramme, welche in eine Logdatei schreiben oder diese auslesen.\nJava\n\nLog4j.NET\n\nAwesome .NET Logging. In: Github. Abgerufen am 6. März 2017 (Liste von .NET Logging-Libraries). \nEnterprise Library. In: CodePlex, patterns & practices. Microsoft, abgerufen am 11. April 2013 (englisch). \n.NET Logging Framework. The Object Guy, abgerufen am 11. April 2013 (englisch). \nSmartInspect. GurockSoftware, abgerufen am 11. April 2013 (englisch). Delphi\n\nLog4Delphi. Open Source Projekt, abgerufen am 19. September 2013 (englisch). \nnxLogging\n\n\n== Abgrenzung zu anderen Technologien ==\nIm Rahmen des Application Lifecycle Management werden, zusätzlich zu dezentralen Logdateien, auch zentralisierte Logging-Datenbanken eingesetzt, um eine zentrale Auswertung von Programmfehlern und -informationen zu ermöglichen. Derartige Datenbanken können beispielsweise über ein Webservice oder mittels Log-Scraping befüllt werden.\nFür eine Echtzeitauswertung sind Logdateien nicht geeignet. Hierfür kommen stattdessen Monitoring-Mechanismen zum Einsatz, etwa Performance Counter und Event Tracing for Windows (ETW) auf Windows-Systemen oder\ncollectd (system statistics collection daemon) unter Linux-Systemen.\nEine weitere Technologie sind Operations-Datenbanken, welche unter anderem eine Auswertung des Zustands von Geschäftsprozessen ermöglicht.\n\n\n== Siehe auch ==\nVersionsverwaltung\nSyslog\nEreignisprotokoll\nÄnderungsprotokoll\nRanddaten (bei der Nutzung elektronischer Infrastruktur)\nWebalizer\n\n\n== Literatur ==\nRalph Kimball, Margy Ross: The Data Webhouse Toolkit. 2. Auflage. John Wiley & Sons, New York 2002, ISBN 0-471-20024-7. \nBrij Masand: Web Usage Analysis and User Profiling. Springer, Berlin 2000, ISBN 3-540-67818-2. \nC. Lutzky, M. H. Teichmann: Logfiles in der Marktforschung: Gestaltungsoptionen für Analysezwecke. In: Jahrbuch der Absatz- und Verbrauchsforschung. 2002, S. 295–317. \n\n\n== Weblinks ==\nSichere Log-Dateien auf Grundlage kryptographisch verketteter Einträge (PDF, 515 KiB)\nEntwicklung und Test einer logfilebasierten Metrik zur Analyse von Website Entries am Beispiel einer akademischen Universitäts-Website. Magisterarbeit zum Thema Logdateianalyse\nPantheios – Datenprotokollierungs-Bibliothek für C++\nEnotare – Datenprotokollierungs-Bibliothek(+Viewer) für C# (kostenlos)\n\n\n== Einzelnachweise ==", "Eine Objektdatenbank oder objektorientierte Datenbank ist eine Datenbank, die auf dem Objektdatenbankmodell basiert. Im Unterschied zur relationalen Datenbank werden Daten hier als Objekte im Sinne der Objektorientierung verwaltet. Das zugehörige Datenbankmanagementsystem wird als das objektorientierte Datenbankmanagementsystem bezeichnet. Objektdatenbank und Objektdatenbankmanagementsystem bilden gemeinsam das Objektdatenbanksystem.\nEin Objekt modelliert normalerweise einen Gegenstand oder Begriff und enthält insbesondere dazugehörige Attribute; so gehört zum Beispiel die Farbe und das Gewicht eines Autos zu dem Objekt Auto. Attribute beschreiben ein Objekt näher. Daten und Methoden (die Funktionen zum Zugriff auf die Daten) werden in den Objekten zusammen abgelegt.\n\n\n== Objektdatenbankmanagementsystem ==\nDas Datenbankmanagementsystem (DBMS) ist die Software, die zur Verwaltung einer Datenbank benötigt wird. Im Falle einer Objektdatenbank wird diese als das Objektdatenbankmanagementsystem (ODBMS) bezeichnet. Das ODBMS ist für die Speicherung und den zuverlässigen Zugriff auf die Daten zuständig. Neben den klassischen Eigenschaften eines DBMS hat es folgende zusätzliche Anforderungen zu erfüllen, um als vollwertiges ODBMS verwendbar zu sein:\n\nVerwaltung komplexer Objekte. Ein Objekt setzt sich aus beliebigen anderen Datentypen zusammen.\nSicherstellung der Objektidentität. Jedes Objekt bekommt eine systemweit eindeutige Identifikation OID.\nKapselung der Objekte nach dem Konzept der objektorientierten Programmierung. Der Zugriff auf das Objekt findet über Methoden statt.\nObjekte sind einer Objektklasse zugeordnet.\nObjektklassen sind in einer Klassenhierarchie angeordnet.\nDurch späte Bindung werden bei vererbten Objekten die überladenen Methoden verwendet.\nDas ODBMS muss eine Turing-vollständige Manipulationssprache (DML) bereitstellen.Neben diesen Eigenschaften gibt es eine Reihe optionaler Anforderungen, die hier nicht im Einzelnen dargestellt sind. Sie wurden auf der Konferenz DOOD’98 festgelegt.\nAls Abfragesprache wurde von der ODMG die Sprache Object Query Language (OQL) standardisiert. Als Datenmanipulationssprache wird Object Definition Language (ODL) verwendet.\n\n\n== Vorteile ==\nObjektdatenbanksysteme schließen eine Lücke, die bei der Programmierung moderner Datenbankanwendungen entsteht, wenn die Anwendung in einer objektorientierten Programmiersprache entwickelt wurde, die Datenbank jedoch ein klassisches relationales Datenbanksystem ist. Beide Konzepte widersprechen sich in einigen wichtigen Punkten. Dieses Problem wird allgemein als der „object-relational impedance mismatch“ bezeichnet. Als Lösung für das Problem werden sogenannte objektrelationale Abbildungen verwendet. Dies sind Softwarekomponenten, die zwischen einer relationalen Datenbank und einer objektorientierten Software vermitteln. Durch die Verwendung eines Objektdatenbanksystems wird diese Vermittlung überflüssig. Die Anwendung kann direkt mit der Datenbank kommunizieren.\nDas Zusammensetzen komplexer Datenobjekte mittels Joins über mehrere Datenbanktabellen entfällt. Objekte können einfach über die in der Datenbank gespeicherten Beziehungen abgefragt werden.\nWeiterhin hilft ein ODBMS beim Zugriff auf Daten. Da Objekte eine komplexe Struktur haben können, sind semantische Zusammenhänge zwischen Objekten dem Datenbanksystem bekannt. Das Datenbanksystem hat also ein Verständnis davon, welche Daten zusammengehören. Dieses Wissen kann bei der Abfrage der Daten mittels einer Abfragesprache wie OQL verwendet werden. Im Gegensatz zu relationalen Datenbanksystemen ist das Ergebnis einer Anfrage nicht eine Menge von Datensätzen. OQL erlaubt die Abfrage einzelner Objekte.\nAußerdem wird das Problem der Objektidentität gelöst. Während bei relationalen Datenbanken der Datenbankentwickler oft einen künstlich erzeugten Schlüssel (Surrogate Key) zu seinen Daten hinzufügen muss, wird dies von einem ODBMS automatisch in Form eines OIDs gemacht. Die Verwaltung dieser IDs wird dabei vollständig vom System übernommen.\n\n\n== Nachteile ==\nObjektdatenbanken haben bis heute nur eine geringe Verbreitung. Entsprechend sind viele Schnittstellen und Tools wie JDBC/ODBC, ETL oder OLAP für den Einsatz mit einem ODBMS nicht vorbereitet. \nDie Schnittstellen zwischen Anwendungsprogramm und Objektdatenbank sind nicht standardisiert, sodass sich bei Problemen das Datenbanksystem nur mit immensem Aufwand nachträglich durch ein leistungsfähigeres ersetzen lässt. Bei den objektrelationalen Abbildungen dagegen gibt es mehrere etablierte Lösungen, die den Zugriff auf im Masseneinsatz erprobte und in unzähligen Projekten verwendete relationale Datenbanksysteme bieten. \nBei bestimmten Anfragen sind Objektdatenbanken noch immer im Nachteil gegenüber relationalen Datenbanken. Dies ist beispielsweise durch Zugriffspfade zu Objekten über mehrere Pfadarten (bspw. Vererbung und Assoziation) verursacht. Dies führt bei Schreiboperationen in der Sperrverwaltung zu einer exponentiellen Komplexität und somit zu Performanceproblemen. Die Leistungsprobleme wurden in den objektrelationalen Datenbanken aufgegriffen, in denen nur die Konstrukte aus objektorientierten Datenbanken mit niedrigerer Komplexität (bspw. \n  \n    \n      \n        n\n        ⋅\n        log\n        ⁡\n        (\n        n\n        )\n      \n    \n    {\\displaystyle n\\cdot \\log(n)}\n  ) übernommen wurden.\n\n\n== Geschichte ==\nObjektdatenbanken wurden Ende der 1980er Jahre entwickelt. Somit gehören sie zu den vergleichsweise neuen Datenbankkonzepten. Bis heute spielen sie auf dem Datenbankmarkt, der von den relationalen Datenbanksystemen dominiert wird, eine eher geringe Rolle. Dennoch sind seit 2004 mehrere Objektdatenbanksysteme wie zum Beispiel db4o entwickelt worden, die zum Teil als Open Source verfügbar sind.\n\n\n== Siehe auch ==\nDatenbankmodell\nNetzwerkdatenbankmodell\nObjektrelationale Datenbank\nEDA-Datenbank\n\n\n== Literatur ==\nHeuer, Andreas: Objektorientierte Datenbanken – Konzepte, Modelle, Standards und Systeme. 2., aktualisierte Auflage – Bonn: Addison-Wesley-Longman 1997: ISBN 3-89319-800-8\nGunter Saake, Ingo Schmitt, Can Türker: Objektdatenbanken – Konzepte, Sprachen, Architekturen. 1. Auflage. International Thomson Publishing, Bonn 1997, ISBN 3-8266-0258-7. \nUnland, Rainer: Objektorientierte Datenbanken. Konzepte und Modelle. Thomson Publishing, Bonn 1995, ISBN 3-929821-82-6\n\n\n== Weblinks ==\nodbms.org – Resource Portal for Education and Research on Object Databases (englisch)\nODBMS Industry Watch blog (englisch)", "Ein Dokumentenserver (auch Publikationsserver oder Repository/Repositorium) ist eine Digitale Bibliothek zur Veröffentlichung und Archivierung von elektronischen Publikationen in einem Repositorium. Im Gegensatz zu einer einfachen Publikation auf einer Homepage sorgt der Betreiber des Publikationsservers auch für die Langzeitarchivierung und Erschließung der publizierten Dokumente mit Hilfe von bibliographischen Metadaten. Häufig werden Dokumenten-Server für Preprints verwendet.\nIn Deutschland können Dokumentenserver von der Deutschen Initiative für Netzwerkinformation (DINI) zertifiziert werden. Die Open Archives Initiative fördert die Vernetzung von Dokumentenservern durch die Etablierung von technischen Standards. Mit dem von ihr entwickelten „Protocol for Metadata Harvesting“ (OAI-PMH) können Informationen über die Bestände von Dokumentenservern – sogenannte Metadaten – eingesammelt werden. Anschließend werden die Daten aggregiert und indexiert. Auf diese Weise lassen sich die Bestände mehrerer Dokumentenserver übergreifend durchsuchen. Dies ist beispielsweise mit den vertikalen Suchmaschinen BASE und OAIster möglich.\nDie meisten deutschen Dokumentenserver sind Hochschulschriftenserver, die vor allem elektronische Dissertationen aufnehmen.\n\n\n== Softwaresysteme ==\nZum Betrieb von Dokumentenservern gibt es verschiedene Softwaresysteme, die unter anderem die Funktion einer Archivsoftware übernehmen und größtenteils als Open Source verfügbar sind:\nDSpace\nEPrints\nFedora Repository\nMyCoRe\nOPUSGreenstone\nInvenioEine Übersicht von Dokumentenservern bieten das Registry of Open Access Repositories (ROAR) und die DINI-Datenbank.\n\n\n== Beispiele ==\n\n\n=== Fachrepositorien ===\nFachrepositorien beinhalten Veröffentlichungen aus einem Fachgebiet oder mehreren meist benachbarten Fachgebieten.\n\nArXiv: Einer der bekanntesten Preprint-Server\nBioRxiv: Preprint-Sever für die Biowissenschaften\nChemRxiv: Preprint-Server für das Fach Chemie\nEarthArxiv: Preprint-Server für die Geowissenschaften\nEconStor: Open-Access-Publikationsserver für die Wirtschaftswissenschaften\nE-LIS: Dokumentenserver aus dem Feld der Bibliotheks- und Informationswissenschaft\nINSPIRE-HEP: Publikationsserver für Teilchenphysik (Invenio)\nMedRxiv: Preprint-Server für die Gesundheitswissenschaften\nPedocs: Dokumentenserver für erziehungswissenschaftliche Literatur\nPsyDok: Dokumentenserver für das Fach Psychologie\nPubMed Central: Dokumentenserver für Medizin und Biologie. In den USA muss jegliche, durch die National Institutes of Heath geförderte Forschung, innerhalb von zwölf Monaten original oder als Kopie bei PMC veröffentlicht werden.\nSocial Science Open Access Repository: Open-Access-Dokumentenserver der Sozialwissenschaften\nSocial Science Research Network: Dokumentenserver von Elsevier\n\n\n=== Institutionelle Dokumentenserver ===\nInstitutionelle Dokumentenserver beinhalten Veröffentlichungen aus einer Institution, beispielsweise einer Universität oder einer anderen Forschungseinrichtung. Sie bieten den Autoren eine erhöhte Sichtbarkeit bzw. Findbarkeit ihrer Publikationen (z. B. über Suchmaschinen) sowie schnellen und kostenlosen Zugang (Open Access). Außerdem garantieren institutionelle Dokumentenserver die Langzeitverfügbarkeit der Publikationen, was bei anderen Formen der elektronischen Publikation, wie einem Upload auf soziale Medien, nicht gewährleistet ist.\n\nDokumenten- und Publikationsserver der HU Berlin (Humboldt-Universität zu Berlin)\nDuEPublico: Dokumenten- und Publikationsserver der Universität Duisburg-Essen (MyCoRe)\nBayerische OPUS-Server\nQucosa: Sächsischer Dokumenten und Publikationsserver\nOnline Publikationsverbund der Universität Stuttgart (OPUS)\nDokumenten- und Publikationsserver Speyer (DoPuS), Schriften der Deutschen Universität für Verwaltungswissenschaften Speyer und des Deutschen Forschungsinstituts für öffentliche Verwaltung Speyer (FÖV); im August 2017 auch 944 Volltexte\n\n\n=== Spezielle Dokumentenserver ===\nNetzpublikationen der Deutschen Nationalbibliothek: Die DNB sammelt E-Books, E-Journals, E-Paper, Hochschulschriften, Noten, Hörbücher, Digitalisate und ausgewählte Websites im Rahmen ihres gesetzlich verankerten Sammelauftrags.\nOpenAIRE: Netzwerk aus Repositorien, das insbesondere EU-geförderte Publikationen aggregiert.\n\n\n== Weblinks ==\nListe der Repositorien auf den Seiten der Deutschen Initiative für Netzwerkinformation e. V. (DINI)\nDiplomarbeit zu Repositorien\n\n\n== Einzelnachweise ==", "NoSQL (englisch für Not only SQL deutsch: „Nicht nur SQL“) bezeichnet Datenbanken, die einen nicht-relationalen Ansatz verfolgen und damit mit der langen Geschichte relationaler Datenbanken brechen. Diese Datenspeicher benötigen keine festgelegten Tabellenschemata und versuchen Joins zu vermeiden. Sie skalieren dabei horizontal. Im akademischen Umfeld werden sie häufig als „strukturierte Datenspeicher“ (engl. structured storage) bezeichnet.Bekannte Implementierungen sind Riak, Apache Cassandra, CouchDB, MongoDB und Redis.\n\n\n== Geschichte ==\nDer Begriff NoSQL, noch im Sinne von no SQL, wurde erstmals für eine 1998 erschienene einfache Open-Source-Datenbank verwendet, die keine SQL-Zugriffsmöglichkeit bereitstellte. Carlo Strozzi, der Entwickler dieser Datenbank, unterscheidet allerdings die NoSQL-Datenbank von der NoSQL-Bewegung insofern, als erstere eine Datenbank ist, welche auf die Verwendung der Sprache SQL verzichtet, während letztere ein Konzept ist, das vom relationalen Modell Abstand nimmt.Der Begriff NoSQL im Sinne von Not only SQL wurde Anfang 2009 von Johan Oskarsson für ein Treffen über verteilte strukturierte Datenspeicher neu eingeführt. Der Name war ein Versuch einer gemeinsamen Begriffsfindung für die wachsende Zahl an nicht relationalen, verteilten Datenspeichersystemen, die meist auch auf ACID-Eigenschaften verzichteten.\nDieses Thema ist nicht ganz neu. Die Bestrebung, Daten ohne die Einschränkungen des relationalen Modells zu speichern, war bereits früher unter dem Titel dokumentenorientierte Datenbank bekannt. Insofern sind alle Vertreter dieser Thematik auch als NoSQL-Systeme zu betrachten.\nObwohl sich NoSQL-Systeme kontinuierlich verbreiten, wird der Markt nach wie vor deutlich von relationalen Systemen dominiert (Stand 2020).\n\n\n== Architektur ==\nRelationale Datenbanken leiden üblicherweise unter Leistungsproblemen bei datenintensiven Applikationen wie Indexierung großer Dokumentmengen, Webseiten mit hohen Lastaufkommen sowie Streaming-Media-Applikationen. Relationale Datenbanken sind nur dann effizient, wenn sie für häufige, aber kleine Transaktionen oder für große Batch-Transaktionen mit seltenen Schreibzugriffen optimiert sind. Sie können aber schlecht mit gleichzeitig hohen Datenanforderungen und häufigen Datenänderungen umgehen. NoSQL dagegen kann mit vielen Schreib-/Leseanfragen umgehen.NoSQL-Architekturen bieten meist nur schwache Garantien hinsichtlich Konsistenz wie beispielsweise eventual consistency oder auf einzelne Datensätze eingeschränkte Transaktionen. Einige Systeme unterstützen auch ACID, beispielsweise durch Hinzufügung spezieller Middleware wie CloudTPS.Viele NoSQL-Implementierungen unterstützen verteilte Datenbanken mit redundanter Datenhaltung auf vielen Servern, beispielsweise unter Nutzung einer verteilten Hashtabelle. Damit können die Systeme einfach erweitert werden sowie Ausfälle einzelner Server überstehen.\n\n\n== Unterscheidung nach Datenmodell ==\nNoSQL-Implementierungen können folgendermaßen gegliedert werden:\n\n\n== Leistung ==\nNach Ben Scofield kann die Leistung von NoSQL-Datenbanken wie folgt bewertet werden:\n\n\n== Literatur ==\nStefan Edlich, Achim Friedland, Jens Hampe, Benjamin Brauer, Markus Brückner: NoSQL: Einstieg in die Welt nichtrelationaler Web 2.0 Datenbanken. 2., aktualisierte und erweiterte Auflage. Hanser Verlag, München 2011, ISBN 978-3-446-42753-2. \nPramodkumar J. Sadalage, Martin Fowler: NoSQL Distilled: A Brief Guide to the Emerging World of Polyglot Persistence. Addison-Wesley, Amsterdam 2012, ISBN 978-0-321-82662-6 (englisch). \n\n\n== Weblinks ==\nBinärgewitter #1: NoSQL (Podcast bei RadioTux)\nNoSQL Databases (Links zu NoSQL-Themen, gepflegt durch Stefan Edlich)\nNoSQL Anwendergruppen in Deutschland\nÜberblicksartikel zum Thema NoSQL (Heise online)\nStefan Edlich: Ausblick zur Entwicklung von SQL zu NoSQL. Frankfurter Datenbanktage\nRoberto V. Zicari: Free Downloads/Artikel zu NoSQL ODBMS.org\n\n\n== Einzelnachweise ==", "Als Datenbanksprache bezeichnet man formale Sprachen, die für den Einsatz in Datenbanksystemen entwickelt wurden. Mit Hilfe der Datenbanksprache kommuniziert ein Benutzer oder auch ein Programm mit der Datenbank, bzw. dem Datenbankmanagementsystem (DBMS). Da ein wichtiger Teil der Arbeit mit Datenbanksystemen die Formulierung von Abfragen ist, gehört zum Sprachumfang in der Regel auch die (Datenbank-)Abfragesprache. Datenbanksprachen sind speziell auf die Anforderungen in diesem Umfeld (Datenbankerstellung, -pflege und -abfrage) zugeschnitten. Man kann sie als Turing-vollständig bezeichnen, aber es handelt sich nicht um Programmiersprachen im heute geläufigen Sinne – es kann keine Anwendungssoftware damit geschrieben werden.\nEs gibt eine Vielzahl von Datenbanksprachen, die oft auf bestimmte Datenbankmanagementsysteme zugeschnitten sind. Eine normierte Sprache für die weit verbreiteten Relationalen Datenbanksysteme (RDBMS) ist SQL, das gleichzeitig die Obermenge vieler, proprietärer implementierter SQL-Dialekte ist. SQL selbst schreibt nicht vor, wie die Befehle implementiert werden, sondern lediglich, wie sich die Datenbank bei bestimmten Operationen nach außen verhält.\n\n\n== Unterteilung relationaler Datenbanksprachen ==\n\nEine gängige Kategorisierung der Elemente relationaler Datenbanksprachen sind die drei Sparten DML, DDL und DCL.\n\nData Manipulation Language (DML, deutsch „Datenverarbeitungssprache“): Sprache oder Sprachteile für das Abfragen, Einfügen, Ändern oder Löschen von Nutzdaten\nData Definition Language (DDL, deutsch „Datenbeschreibungssprache“): Sprache oder Sprachteile für das Anlegen, Ändern und Löschen von Datenstrukturen\nData Control Language (DCL, deutsch „Datenaufsichtssprache“): Sprache oder Sprachteile für die ZugriffskontrolleGelegentlich taucht in der Literatur auch eine eigene Kategorie Data Query Language (DQL) für die Abfrage von Daten auf. Diese Einteilung ist jedoch nicht allgemein anerkannt (siehe hierzu die Sonderstellung der Abfrage). Einen weiteren Sonderfall bilden die Sprachelemente zur Arbeit mit Transaktionen, die uneinheitlich entweder der DML, der DCL oder einer eigenen Kategorie Transaction Control Language (TCL) zugeordnet werden.\nIn SQL sind alle Elemente in einer Sprache durch unterschiedliche Anweisungen vereinigt. Beim historischen Datenbanksystem IMS gab es für DML und DDL eigene Sprachen (DL/I und Assembler-Makros), die DCL wurde mit Betriebssystemmitteln realisiert.\n\n\n== Unterteilung nicht-relationaler Datenbanksprachen ==\n\nAnders als im relationalen Datenbankmodell wird im Netzwerkdatenbankmodell zwischen einer Data Storage Description Language (DSDL, physische Datenbeschreibung), einer Datenbeschreibungssprache (DDL, logische Datenbeschreibung) und einer Datenmanipulationssprache (DML) unterschieden. Diese Dreiteilung basiert auf der allgemeineren ANSI-SPARC-Architektur und wurde als Standard von der Data Base Task Group vorgeschlagen, konnte sich jedoch nicht gegen das heute vorherrschende relationale Datenbankmodell durchsetzen.\nIm noch älteren hierarchischen Datenbankmodell war keine Unterteilung in Teilsprachen standardisiert.\n\n\n== Abfragesprache versus Datenbanksprache ==\nDie Begriffe Abfragesprache und Datenbanksprache werden manchmal fälschlicherweise synonym verwendet.\n\nEine Datenbanksprache geht in der Regel über  das reine Abfragen hinaus.\nAbfragesprachen werden auch in Gebieten außerhalb von Datenbanksystemen verwendet.\n\n\n== Siehe auch ==\nKategorie:Datenbanksprache – Auflistung von Datenbanksprachen\n\n\n== Einzelnachweise =="]