["Eine Maschine (entlehnt aus französisch machine, von lateinisch machina, dieses von altgriechisch μηχανή mēchanḗ, deutsch ‚Werkzeug‘, ‚künstliche Vorrichtung‘, ‚Mittel‘) ist ein technisches Gebilde mit durch ein Antriebssystem bewegten Teilen. Maschinen werden als technische Arbeitsmittel vor allem für mechanische Einwirkung verwendet. In der Vergangenheit stand der Energie- und/oder Stofffluss im Vordergrund. Der Informationsfluss spielte zuerst in feinmechanischen Geräten eine Rolle, ist heute aber in fast allen Maschinen von Bedeutung (Automatisierung). Reizvolle Ziele für die Erfindung von Maschinen waren aus der Sicht eines Arbeiters eine Verstärkung der eigenen Kraft, Zeitgewinn, Genauigkeit, feinere Bearbeitungsmöglichkeit und Fertigung von größeren Mengen identischer Produkte. Es folgte auch eine Entlastung des Produktionsarbeiters von körperlicher und geistiger Arbeit durch Maschinen und Geräte. Diese modernen Arbeitsmittel übernehmen vor allem Routine- und auch gefährliche Arbeiten.\nJede Maschine enthält individuell angefertigte Einzelteile, wie wenigstens Gestell und Gehäuse. Einen erheblichen Anteil nehmen Teile mit einer Standardfunktion ein; diese Maschinenelemente werden gesondert als Massenartikel produziert. Fixe Maschinenelemente sind zum Beispiel Schrauben und Dichtungen, bewegliche Elemente sind zum Beispiel Zahnräder und Hebel.\n\n\n== Definitionen ==\n\n\n=== Begriffsgeschichte ===\n\nMaschinen sind immer Produkte des Menschen. Aufgrund der antiken Bedeutung (vgl. „Deus ex machina“) wurde die Maschine bis in die Neuzeit hauptsächlich als Mittel zu einer Täuschung – dem Erzeugen unnatürlicher, also unmöglicher Effekte – und erst in zweiter Linie als Arbeitshilfe verstanden.\nIn der Renaissance entwickelte sich ein genaueres Konzept über Mechanismen: Mechanismen sind Komplexe von Bauteilen, bei denen die Bewegung eines Elements zwangsläufig die Bewegung anderer Elemente bewirkt. Sie haben in der Regel bewegliche Komponenten und sind im Vergleich zum apparatus (dem ‚Werkzeug‘) erheblich komplexer.\nIn dieser Zeit war ein Mechanismus primär ein Werk, eine Form von Getrieben, die Kräfte übertragen. Zu den kompliziertesten Mechanismen gehörte die Grande Complication (Große Komplikation) in mechanisch-automatischen Uhrwerken. In diesem Sinne ist auch der Mechanismus von Antikythera zu verstehen, ein antikes Artefakt, das die Himmelsmechanik nachbildete.\nIn dieser Zeit bezeichnete auch Kunst (artes mechanicae) noch das Ingenieurwesen, und noch im 19. Jahrhundert wurden im Bergbau von Wasserkraft oder Pferden angetriebene Maschinen Bergmännische Kunst genannt.\n\n\n=== Mechanische Grundlagen: einfache Maschine und Automat ===\n\nDie Entwicklung der klassischen Mechanik als wissenschaftliche Disziplin seit der Aufklärung führt dazu, nach den Grundelementen mechanischer Systeme zu suchen, im Sinne der ‚Atome‘, der Bauteile, die sich nicht weiter zerlegen lassen – angedacht wurde das schon von den antiken griechischen Ingenieuren (Aristoteles): So werden die einfachen Maschinen definiert, nämlich Seil und Stab, Rolle, Hebel, sowie schiefe Ebene (in der Antike noch die Schraube, die sich aber als Stab und schiefe Ebene modellieren lässt).\nMehr oder weniger komplexe Mechanismen kommen in praktisch allen Ingenieurwissenschaften und technischen Disziplinen vor. Das Spektrum möglicher Maschinen reicht von einer einfachen Gerätschaft mit verbundenen, beweglichen Teilen (Mechanismen) bis zu sich über Kilometer erstreckenden komplexen Bauwerken (Anlagen).\nIn der technischen Anwendung haben Maschinen meist einen Antrieb (zum Beispiel einen Motor), der mehr oder minder kontinuierlich Energie liefert. Mit dieser Energie arbeiten die Maschinen, weshalb sie Arbeitsmaschinen genannt werden. Der Motor und andere Maschinen, die verschiedene Energieformen in meist rotierende Bewegungsenergie umwandeln, werden als Kraftmaschinen bezeichnet.\nWeil die Maschine, wenn sie einen kontinuierlichen Antrieb hat, Arbeitsvorgänge in eine Folge wiederholbarer Schritte teilt, überschneidet sich ihre Bedeutung mit der des Automaten. Sie kann (unberechenbare) Handlungen von Menschen oder Tieren durch planbare Tätigkeiten (einen Algorithmus) ersetzen. Der αὐτόματος automatos, „der sich aus eigenem Willen bewegt“, ist ursprünglich ein auf Räderwerken aufgebautes, ebenfalls illusionistisches Spielzeug – er entspricht aber den mechanistischen Leitbildern der Aufklärung, die auch die Natur als zwangsläufige, determinierbare Abfolge zu erklären sucht.\n\n\n=== Entwicklung der Definition in der Industrialisierung ===\n\n19. Jahrhundert:\nVerbindungen widerstandsfähiger Körper, welche so eingerichtet sind, dass mittels ihrer mechanische Naturkräfte genötigt werden können, unter bestimmten Bewegungen zu wirken (Reuleaux).Die Verbindung der Körper zu einer Maschine schließt nicht alle und jede Bewegung aus, sondern verhindert nur die für den Zweck der Maschine unnötigen und störenden Bewegungen, sodass die zweckmäßigen Bewegungen als die allein möglichen übrigbleiben.20. Jahrhundert:Normungsbestrebungen gehen dahin, zwischen Maschine, Gerät, Apparat, Automat, Werkzeug, Instrument und Anlage zu unterscheiden:\n\nMaschine als vorrangig energie- oder kraftumsetzendes System oder Gebilde,\neine einfache Maschine besteht nur aus einem oder sehr wenigen Elementen und kann häufig auch als Werkzeug bezeichnet werden\neine Kraftmaschine stellt mechanische Energie (Bewegungsenergie) zur Verfügung\neine Arbeitsmaschine nimmt mechanische Energie (Bewegungsenergie) auf\nGerät als vorrangig signalumsetzendes oder informationsverarbeitendes technisches Gebilde,\nApparat gleich vorrangig stoff- bzw. materieumsetzendes technisches Gebilde,\nAutomat als Maschine, die automatisch ablaufen kann\nWerkzeuge sind Vorrichtungen, die nicht eigenständig funktionieren, sondern entweder von Hand geführt werden oder Bestandteil von Maschinen sind,\nInstrumente sind Vorrichtungen, die nicht der Umsetzung von Arbeit dienen, sondern der Anzeige,\nAnlagen sind komplexe Systeme aus Maschinen, Apparaten, Geräten, Werkzeugen bzw. Instrumenten.Ende 20. Jahrhundert:\nIn Europa ist die Maschine in der Maschinen-Richtlinie definiert.Infolge der Elektronisierung und Automatisierung im 20. Jahrhundert hat sich der Begriff der Maschine auf Computerprogramme ausgedehnt, mit denen Maschinen simuliert werden. In der Ingenieurtechnik wird aber meist zwischen mechanischer Maschine und elektronischen Automaten unterschieden.\n\n\n=== Die Europäische Maschinen-Richtlinie als Definitionshilfe ===\n\nMit Hilfe der Richtlinie 2006/42/EG (Maschinenrichtlinie) wird ein einheitliches Schutzniveau zur Unfallverhütung für Maschinen beim Inverkehrbringen innerhalb des Europäischen Wirtschaftsraumes (EWR) sowie der Schweiz und der Türkei geregelt. Darin ist auch festgelegt, was als Maschine aufgefasst werden muss:\nNach 2006/42/EG Artikel 2 Abs. a (bzw. Umsetzung in nationales Recht, durch 9. ProdSV § 2, Absatz 2) bezeichnet „Maschine“\n\neine mit einem anderen Antriebssystem als der unmittelbar eingesetzten menschlichen oder tierischen Kraft ausgestattete oder dafür vorgesehene Gesamtheit miteinander verbundener Teile oder Vorrichtungen, von denen mindestens eines bzw. eine beweglich ist und die für eine bestimmte Anwendung zusammengefügt sind;\neine Gesamtheit im Sinne des ersten Gedankenstrichs, der lediglich die Teile fehlen, die sie mit ihrem Einsatzort oder mit ihren Energie- und Antriebsquellen verbinden;\neine einbaufertige Gesamtheit im Sinne des ersten und zweiten Gedankenstrichs, die erst nach Anbringung auf einem Beförderungsmittel oder Installation in einem Gebäude oder Bauwerk funktionsfähig ist;\neine Gesamtheit von Maschinen im Sinne des ersten, zweiten und dritten Gedankenstrichs oder von unvollständigen Maschinen im Sinne des Buchstabens g, die, damit sie zusammenwirken, so angeordnet sind und betätigt werden, dass sie als Gesamtheit funktionieren;\neine Gesamtheit miteinander verbundener Teile oder Vorrichtungen, von denen mindestens eines bzw. eine beweglich ist und die für Hebevorgänge zusammengefügt sind und deren einzige Antriebsquelle die unmittelbar eingesetzte menschliche Kraft ist.Eine Maschine ist als eigenständige Einheit im Wesentlichen unabhängig von der Umgebung funktionsfähig, während ihre Einzelkomponenten meist nicht unabhängig von der Maschine sinnvoll verwendbar sind.\nNicht unter den Regelungsbereich der Maschinenrichtlinie fallen jedoch „Maschinen, deren einzige Kraftquelle die unmittelbar angewandte menschliche Arbeitskraft ist, mit Ausnahme von Maschinen, die zum Heben von Lasten verwendet werden, …“ (2006/42/EG Artikel I Absatz 2a). Diese Eingrenzung des Begriffes grenzt somit viele Geräte aus, die im alltagssprachlichen Sinne Maschinen sind. Im Verordnungstext werden noch weitere Ausnahmen und Ergänzungen definiert.\nDie Neufassung der Maschinenrichtlinie 2006/42/EG führt daneben auch unvollständige Maschinen auf, die dadurch gekennzeichnet sind, dass sie dazu bestimmt sind, in eine andere Maschine oder andere unvollständige Maschinen eingebaut oder mit ihnen zusammengefügt zu werden, um zusammen mit ihnen eine Maschine im Sinne der Richtlinie zu bilden.\nBeispiele, mit den daraus folgenden zugehörigen Anforderungen der EU-Richtlinien:\n\nEine Spannvorrichtung für Werkstücke, welche die Energie und die Signale von einer übergeordneten Maschine bezieht, ist keine Maschine.Grund: keine Funktion ohne übergeordnete Maschine. (RL: Einbauerklärung)\nDie Heugabel ist keine Maschine.Grund: kein Anbau an Maschine (vorgesehener Gebrauch), keine beweglichen Teile, nur mit Muskelkraft betrieben, keine gespeicherte Energie. (RL: keine Kennzeichnung)\n\n\n=== Speziellere Definitionen ===\nEine Maschine soll eine Aufgabe mechanisch erledigen und die Antriebsenergie in Bewegung umwandeln (= Kraftmaschine) mit entsprechender Kraftentfaltung auf die Abtriebs- bzw. Arbeitsseite der Maschine (= Arbeitsmaschine).\nBearbeitung eines Materials (bohren, drehen, fräsen) mit exakter Festlegung der Bewegungen von Werkzeug und Werkstück: Maschine = Werkzeugmaschine.\nMaschine, die für einen speziellen Zweck konstruiert und gebaut wurde: Maschine = Sondermaschine\nMaschinen, deren Zweck die Umsetzung einer zugeführten Energie in Bewegung ist: Maschine = Motor\nMaschinen, die der Wiederherstellung von körperlichen Fähigkeiten dienen: Maschine = Prothese\nMaschinen, die in Gebäude eingebaut sind. Maschine = Anlage der Technischen Gebäudeausrüstung, z. B. Lüftungsanlagen, Aufzüge, Kältemaschinen, Klimaanlagen, Rückkühlwerke\n\n\n=== Zeittafel / historische Beispiele ===\nder planmäßige Einsatz von Hebel und Rad war ausschlaggebend für die Entwicklung von Maschinen\nca. 700 v. Chr.: Babylonische Schöpfwerke in Assyrien, Maschinenbauwerke\nca. 550 v. Chr.: Drehbank, erste Werkzeugmaschinen\nca. 340 v. Chr.: Definition Aristoteles: Hebel, Schraube werden als ‚Maschine‘ bezeichnet\nca. 50 n. Chr.: Heron von Alexandria erste Wärmekraftmaschine\n15. Jahrhundert: Maschine = ‚Kunstwerk‘ (Künstleringenieure Beispiel Leonardo da Vinci)\n16. Jahrhundert: Maschine = ‚Technische Vorrichtung‘ (Ingenieurwesen Beispiel Galileo Galilei)\n17. Jahrhundert: Simulationen der Natur mit mechanischen Modellen, Natur = ‚Maschine‘ (beispielsweise bei Descartes)\n1712: Thomas Newcomen erste verwendbare Dampfmaschine (Maschine für Wärmekraftmaschine), 1769 von James Watt erheblich verbessert\n1789: Die Französische Revolution ändert die Einstellung zur Mechanik und zur Maschine Befreiung des Menschen von Sklaverei auch durch Ablehnung der Verehrung des Altertums\num 1900: Unterscheidung Sondermaschine, Werkzeugmaschine.\n1957: Integration der Maschine: Mensch-Maschine-System\n\n\n== Maschinen in Mythologie und Literatur ==\nIn der Literatur des Barock und der Romantik wurden auch Fabelwesen als Maschinen bezeichnet, in der Dichtung der Antike waren es oft die Fabelwesen, die den Mechanismus darstellten, welcher die Geschichte vorantrieb.\nSozialwissenschaften und Psychologie nehmen mechanische Aspekte auf, um psychische oder soziale Sachverhalte als Maschinen vorzustellen, wie etwa der Philosoph Gilles Deleuze.\nHephaistos, der Schmiedegott, soll mechanische Frauen aus Gold geschaffen haben, seine bekanntesten Schöpfungen sind die Pandora und der bronzene Riese Talos\nRabbi Judah Löw soll einen künstlichen Menschen, den Golem, aus Lehm geschaffen haben, um die Prager Juden vor ihren Feinden zu schützen\nEnde des 18./Anfang des 19. Jahrhunderts wurde parallel zur technischen Revolution auch in der romantischen Literatur der künstliche Mensch zum Thema.\nAnfang des 20. Jahrhunderts hielt der Androide bzw. der Roboter Einzug in die Literatur, Isaac Asimov formulierte die „Roboter-Gesetze“, die einen Verhaltenscode für Automaten festlegen.\nHäufig taucht der Teufel im Märchen im Zusammenhang mit Mühlen und anderen technischen Gebilden auf, der Begriff „Teufelswerk“ wird oft bei der Einführung einer neuen Technologie genutzt.\n„Brauchbar ist eine Maschine erst dann, wenn sie von der Erkenntnis unabhängig geworden ist, die zu ihrer Erfindung führte.“ (Friedrich Dürrenmatt: Die Physiker – Gespräch zwischen Inspektor Voß und Newton (1. Akt))\n\n\n== Siehe auch ==\nAutomat (Informatik)\nThemenliste Maschinenbau\nVergegenständlichte Arbeit\n\n\n== Literatur ==\nHans-Dieter Bahr: Über den Umgang mit Maschinen. Konkursbuchverlag, Tübingen 1983, ISBN 3-88769-011-7.\nMartin Burckhardt: Vom Geist der Maschine. Eine Geschichte kultureller Umbrüche. Campus Verlag, Frankfurt am Main/ New York 1999, ISBN 3-593-36275-9.\nMartin Burckhardt: Philosophie der Maschine. Matthes & Seitz, Berlin 2018, ISBN 978-3-95757-476-3.\nJürgen Dahl (Hrsg.): Jugend der Maschinen. Bilder aus der Enzyklopädie von Diderot und d’Alembert (1751–1772). Ebenhausen b. München 1965, DNB 452258197 (Aufnahmen der Abbildungen: Bayerische Staatsbibliothek München)\nThomas Klindt, Thomas Kraus, Dirk von Locquenghien, Hans-J. Ostermann: Die neue Maschinenrichtlinie 2006. Beuth Verlag, Berlin 2007, ISBN 978-3-410-16518-7.\nSybille Krämer: Symbolische Maschinen. Die Idee der Formalisierung in geschichtlichem Abriss. Wissenschaftliche Buchgesellschaft, Darmstadt 1988, ISBN 3-534-03207-1.\nMaschinenphantasien – zur Kulturgeschichte des Mensch-Maschinen-Verhältnisses. Ausstellungskatalog. Technische Sammlungen der Stadt Dresden vom 11. Juli bis 24. September 1994.\nMarshall McLuhan: Die mechanische Braut – Volkskultur des industriellen Menschen. Verlag der Kunst, Amsterdam 1996, ISBN 90-5705-021-8.\nKarl v. Meyenn (Hrsg.): Triumph und Krise der Mechanik. Piper Verlag, München/ Zürich 1990.\nMarcus Popplow: Die Verwendung von lat. machina im Mittelalter und in der Frühen Neuzeit – vom Baugerüst zu Zoncas mechanischem Bratenwender. In: Technikgeschichte, Bd. 60 (1993), H. 1, S. 7–26.\nHeiko Schmid: Metaphysische Maschinen. Technoimaginative Entwicklungen und ihre Geschichte in Kunst und Kultur. transcript Verlag, Bielefeld 2016, ISBN 978-3-8376-3622-2.\nWerner Stein: Kulturfahrplan. F.A. Herbig, München/ Berlin/ Wien 1974.\nSigvard Strandh: Die Maschine, Geschichte – Elemente – Funktion. Herder, Freiburg im Breisgau 1980, ISBN 3-451-18873-2.\n\n\n== Weblinks ==\n\nRichtlinie 98/37/EG (Maschinenrichtlinie)\nRichtlinie 2006/42/EG (Maschinenrichtlinie)\nOnline-Kommentierung der Maschinenrichtlinie von Dipl.-Ing. Hans-J. Ostermann\nZur Universalen Maschine (PDF-Datei; 59 kB)\nTechnikkritischer dialektischer Begriff der Maschine (Memento vom 27. März 2009 im Internet Archive)\n\n\n== Einzelnachweise ==", "Eine Seilwinde ist eine Vorrichtung, mit der man mit Hilfe eines Seils etwas ziehen kann. Dabei wird das Seil (meist durch Muskelkraft oder einen Motor) gezogen, indem es z. B. auf einer sich drehenden zylindrischen Trommel (Winde) aufgewickelt wird.\nDie Windenseile können aus Naturfasern gefertigt sein; bei schweren Lasten wird meist Stahlseil und seit jüngerer Zeit auch Plastik- bzw. Kunstfaser-Seil verwendet, beispielsweise aus langkettigem, texturiertem Polyethylen (PE-UHMW). Die Zugkraft lässt sich durch Einsatz eines Flaschenzuges steigern.\n\n\n== Geschichte ==\nDie ältesten Seilwinden scheinen an Tiefbrunnen angebracht worden zu sein, die ursprünglich als Ziehbrunnen konstruiert waren. Während bei älteren Brunnen auch Tiere (Ochsen, Esel) beim Ziehen des Brunnenseils zum Einsatz kamen, konnte die neuere platzsparende Technik des Ziehens mittels Seilwinde nur noch von Menschenhand bedient werden. Andererseits konnte ein Hemmmechanismus eingebaut werden, der das – durch versehentliches Loslassen ausgelöste – Hinunterfallen des gefüllten Schöpfeimers verhinderte. Später kamen Seilwinden mit oder ohne seitliche Treträder auch bei Kränen oder bei Militärmaschinen (z. B. bei Katapulten oder Ballisten) zum Einsatz.\n\n\n== Bauformen ==\n\n\n=== Trommelwinde ===\nEine Trommel wird mechanisch, elektrisch oder hydraulisch angetrieben und das Seil wird darauf aufgerollt. Das Seil kann sich selbstständig verlegen, wenn die freie Strecke des Seiles vor der Trommel lang genug ist. Anderenfalls kann eine zusätzliche Seilführung zum Einsatz kommen, die das Seil Lage für Lage verlegt, indem sie es seitlich versetzt.\nBei der Trommelwinde wird die ganze Zugkraft über die Trommel auf das Seil übertragen. Die Zugkraft nimmt mit der Anzahl der Lagen auf der Trommel ab, da sie vom Antriebsdrehmoment und dem Hebelarm (Radius auf der Trommel) abhängig ist.\n\n\n=== Bobine ===\nDie Bobine verwendet eine schmale Trommel, auf die ein Band oder Flachseil nicht nebeneinander, sondern nur übereinander aufgewickelt wird. Sie wird bei geringen Förderhöhen verwendet und hat den Vorteil, dass das Seil nicht seitlich veränderlich aus-/einläuft und beim Verlegen nicht beschädigt wird.\n\n\n=== Spill- oder Treibscheibenwinde ===\nWinden, bei denen das Seil um ein Seilspill herumgeschlungen wird und erst dann auf einer Haspel aufgewickelt wird, werden Spillwinden oder Treibscheibenwinden genannt. Im Schiffbau ist diese Windenform auch als Winsch bekannt. Die Haspel übt nur eine Vorspannung aus, damit das Seil die notwendige Reibung am Spillkopf hat – die eigentliche Zugkraft wird vom Spill aufgebracht. Diese Winden haben über die gesamte Seillänge dieselbe Zugkraft und Seilgeschwindigkeit. Sie haben einen größeren Platzbedarf und sind wesentlich aufwendiger gebaut.\nSonderformen sind Kettenzüge.\nAm modernen Segelboot wird ein Kunstfaserseil (zu Großbaum, Fock oder Spinnaker) ein- bis zweimal um ein ratschendes doch nicht angetriebenes drehhyberboloid geformtes Spill mit vertikaler Drehachse geschlungen und händisch gezogen. Eine geringe Handkraft reicht, um via Seilreibung am und Ratsche im Spill eine hohe Seilkraft zu halten. Fast völliges Lösen der Handkraft und eventuell Verringern des Umschlingungswinkels lässt das Seil zurückrutschen. Mitunter hat eine solche Spill Antrieb durch eine daneben liegende Kurbel mit eigener Ratschenkupplung, um kräftiger ziehen zu können. Siehe auch Einhandsegeln. Auf den großen Seglern des Americas Cup werden Winden von speziellen Personen paarweise mit Muskelkraft angetrieben. Die Entwicklung geht von Hand- zu Pedalkurbeln.\n\n\n== Anwendungen ==\n\n \nDie Anwendungsart bestimmt die Größe und die genauere Konstruktion einer Seilwinde.\n\n\n=== Einbau und Betrieb in Kraftfahrzeugen (Feuerwehr, THW, Katastrophenschutz) ===\n\nWinden können entweder heckseitig oder vorne am Fahrzeug angebaut sein. Bei heckseitigen Winden mit Seilabgang in Fahrtrichtung ist die Belastung des Fahrgestells günstiger, da der Rahmen auf Druck und nicht auf Zug wie bei Frontwinden belastet wird.\nBei Heckwinden wird das Seil im Fahrzeugrahmen entweder frei oder durch Rohre und Umlenkrollen nach vorne geführt. An der Vorderseite des Fahrzeuges ist entweder ein so genanntes Seilfenster mittels vier Rollen, die das Seil führen oder eine so genannte Propellerrolle (das sind zwei Umlenkrollen, die sich um 360 Grad drehen können) angebracht. Der Zugwinkel darf aber trotzdem nicht mehr als 15 Grad nach links oder rechts von der Fahrzeugachse abweichen, da sonst Schäden am Fahrgestell auftreten können und sich die Zugkraft verringert. Einige Winden werden dann automatisch über einen Schalter heruntergeschaltet und die Zugkraft wird reduziert.\nUm das Seil bei der unbelasteten Winde schneller ausziehen zu können, haben die Winden meistens einen Freilauf oder einen Schnellgang. Dabei wird die Trommel durch eine Kupplung vom Antrieb getrennt und kann sich frei durchdrehen.\nDie Seilgeschwindigkeit wird bei mechanischen Winden über die Motordrehzahl, bei hydraulischen über ein Steuerventil geregelt. Elektrowinden haben in der Regel keine steuerbare Geschwindigkeit.\nUm eine zu hohe Belastung der Winde und des Seils zu vermeiden, sind bei hydraulischen Antrieben Überdruckventile oder bei mechanischen Winden Scherbolzen als Sollbruchstelle eingebaut. Bei modernen Winden wird die gezogene Last, in Prozent, am Bediendisplay angezeigt.\nBei der Feuerwehr werden Winden, welche fest im Fahrzeug verbaut sind, nach DIN 14 584 als maschinelle Zugeinrichtungen bezeichnet. Die maschinelle Zugeinrichtung umfasst neben der eigentlichen Seilwinde auch alle Bestandteile, welche zum sicheren Betrieb der Seilwinde benötigt werden, wie unter anderem eine Vier-Rad-Feststellbremse. Der Einsatz der maschinelle Zugeinrichtung ist in Deutschland in der Feuerwehr-Dienstvorschrift 1 geregelt, welche auch Regelungen der UVV beinhaltet.\nDie übliche Zugkraft einer maschinellen Zugeinrichtung beträgt 50 kN (beispielsweise RW 1 und LF 24, beziehungsweise RF oder RLF), und sie hat eine Zuglänge von 50 bis 60 m. Dabei ist zu berücksichtigen, dass mehrere Seilwindungen auf der Trommel verbleiben müssen, damit die Zugkraft durch Reibung und nicht allein über das Seilschloss auf die Trommel übertragen wird.\nGesteuert werden die Windenbewegungen meistens aus technischen Gründen vom Fahrersitz aus. Es gibt allerdings auch Fernsteuerungen, mit der sich der Maschinist vom Fahrzeug wegbewegen kann und die Steuerung der Seilwinde bedient.\nAuch beim Betrieb von Seilwinden ist Sicherheit das oberste Gebot. Deshalb dürfen sich die Feuerwehrangehörigen nicht im Bereich des Seiles aufhalten (1,5-fache Seillänge als Sicherheitsabstand), wenn die Winde unter Zug ist. Das Seil muss regelmäßig kontrolliert und gewartet werden. Wenn Litzen gebrochen sind oder Seilknicke auftreten, wird das Seil ausgetauscht.\nDamit ein Fahrzeug die Windenleistung ausnutzen kann, muss das Fahrzeug selbst gut verankert sein. Das kann auf verschiedene Arten passieren. Die einfachste Art ist, Unterlegkeile unter die Räder zu legen. Auch eine Allradbremse kann verwendet werden oder das Fahrzeug wird beispielsweise an einem starken Baum verankert, wobei die Zugkräfte berücksichtigt werden müssen, die der Fahrzeugrahmen dabei übertragen muss.\n\n\n=== Hubschrauber ===\n\nWinden sind oftmals an Hubschraubern zum Zwecke der Rettung von Personen oder der Aufnahme sonstiger Lasten aus der Luft verbaut. Rettungswinden an Hubschraubern werden besonders zur See und in den Bergen eingesetzt, wo eine Landung oftmals nicht möglich ist.\nSeilwinden sind zum Beispiel an folgenden Hubschraubertypen verbaut:\n\nan diversen Bell UH-1D der Bundeswehr (Luftwaffe/ Heer)\nan den Westland Sea King MK 41 der Marine\nan einzelnen Polizeihubschraubern der Bundesländer\nan allen SAR-Hubschraubern der Bundeswehr\nan einigen zivilen Rettungshubschraubern\nan ca. vier Bell 212 und vielen EC 155 des Bundesgrenzschutzes.Dabei kann die Taktik variieren, an die Seilwinde kann wahlweise ein Rettungsgurt, eine Trage oder ein Rettungskorb befestigt werden. Vielfach werden die Winden an Hubschraubern auch nach dem englischen Begriff Winch benannt.\n\n\n=== Weitere Anwendungen/Bauformen ===\n\nzum Starten von Segelflugzeugen beim Windenstart; in kleinerer Ausführung auch zum Starten von Gleitschirmen oder Hängegleitern\nzum Starten von Segelflugmodellen\nan Bergrettungsfahrzeugen unter anderem zur Rettung von Patienten\nan Geländefahrzeugen als Bergungswinde oder zur Unterstützung beim Bewältigen großer Steigungen oder beim Bewegen großer Schneemassen (Pistenfahrzeug)\nin der Forstwirtschaft als eigenständige Geräte (Forstwinde) oder als Anbaugeräte bei Traktoren\nin Elektroseilzügen in der Kran- und Hebetechnik\nfür Artisten im Rahmen von Shows\nin der Schifffahrt, beispielsweise eine Ankerwinde (meist mit Kette) oder Winsch\nim Eisenbahnbetrieb zum Wagenverschub bei Anschlussgleisen\nbei Militärfahrzeugen, z. B. dem Serval oder dem Lkw Sisu SA-240\n\n\n== Sicherheit ==\nBei gewerblich eingesetzten Seilwinden ist eine jährliche Sicherheitsüberprüfung U-VV Prüfung (nach Richtlinien der Berufsgenossenschaften) in Verbindung mit den VDE Vorschriften (bei Elektroseilwinden) vorgeschrieben.\n\n\n== Siehe auch ==\nErfindungen von Wilhelm Karlik (Bergbautechnologe)\nZahnstangenwinde\nWindenstart von Segelflugzeugen\n\n\n== Literatur ==\nFerdinand Tretzel: Die Roten Hefte, Heft 3b – Leinen, Seile, Hebezeuge, Teil: II. 15., überarbeitete Auflage. Kohlhammer, Stuttgart 2005, ISBN 978-3-17-018534-0. \nLothar Schott, Manfred Ritter: Feuerwehr Grundlehrgang FwDV 2. 20. Auflage. Wenzel-Verlag, Marburg 2018, ISBN 978-3-88293-220-1. \n\n\n== Weblinks ==\n\n\n== Einzelnachweise ==", "Das Spill (auch Spille, abgeleitet von Spindel) ist eine drehbare Vorrichtung zum Einholen von Trossen oder der Ankerkette (Ankerspill), oder zum Heben schwerer Lasten. Pallen (Sperrklinken) verhindern, dass das Spill sich rückwärts dreht. Angetrieben wird es mit Muskelkraft, einem Elektro- oder einem Dieselmotor.\nDas Spill unterscheidet sich von der Seilwinde dadurch, dass das geholte Tauwerk nicht aufgewickelt wird: Die Kraftübertragung erfolgt lediglich durch die Reibung mehrerer auf der Trommel liegender Törns (Tauwerkswindungen) oder, für Ketten, über eine Kettennuss. Ein Spill kann daher beliebige Längen Tauwerk oder Kette anholen.\nEin Spill mit horizontaler Welle wird als Bratspill bezeichnet.\nDas Gangspill ist ein muskelkraftbetriebenes Spill mit vertikaler Welle. Es besteht aus einer Welle (mit der Trommel, einer Armatur zur Aufnahme der Ankerkette oder einer Trosse) und dem Spillkopf, der mit Öffnungen zum Einstecken der Spillspaken versehen ist. Letztere sind ein bis zwei Meter lange Hölzer, an denen jeweils bis zu vier Männer im Kreis gingen. Dabei wurden Shanties gesungen, um den gleichmäßigen Rhythmus der eintönigen Arbeit einzuhalten und die Laune der Mannschaft zu heben. Mit der Einführung von Dampfmaschinen an Bord waren Gangspills veraltet; sie sind heute nur noch auf historischen Schiffen vorzufinden (z. B. auf der Amphitrite).\n\nWas im heutigen Sprachgebrauch Winsch (Schotwinsch) genannt wird, ist eigentlich ein Spill (genauer: ein Kurbelspill).\nMehrgängige Kurbelspills, die über eine Welle wahlweise an eine von mehreren externen Trommeln gekuppelt werden können, sind auf Rennyachten häufig und werden scherzhaft Coffeegrinder (Kaffeemühle) genannt.\n\n\n== Siehe auch ==\nSpillanlage\nListe seemännischer Fachwörter\n\n\n== Literatur ==\nUlrich Scharnow: Lexikon Seefahrt. 5. Auflage. Transpress VEB Verlag für Verkehrswesen, Berlin 1988, ISBN 3-344-00190-6, S. 194, 564–565. \n\n\n== Weblinks ==\n\nCoffeegrinder, Foto", "Eine Nebelmaschine stellt künstlichen Nebel („Bühnennebel“) her, indem sie Nebelfluid verdampft. Daher lautet der vollständige Name der klassischen Nebelmaschine Verdampfer-Nebelmaschine.\nFür die Erzeugung von Bodennebel sind außerdem nach wie vor Systeme basierend auf Trockeneis im Einsatz. Je nach Maschinentyp und Fluid können die Eigenschaften des Nebels bezüglich Standzeit und Dichte verändert werden.\n\n\n== Geschichte ==\nBereits seit Jahrhunderten werden Nebel und Rauch für verschiedene Zwecke mit Wasserdampf oder pyrotechnisch hergestellt. Die Entwicklung wurde dabei durch den Bedarf an weniger gesundheitsschädlichen und besser zu steuernden Methoden vorangetrieben.\nParaffin und erhitzte Öle wurden bis in die Mitte der 1980er Jahre bei Film und Theater und auch in Diskotheken eingesetzt. Auf Öl basierende Fluide für die Verwendung in speziell dafür konzipierten Nebelmaschinen sind nach wie vor meist im professionellen Bereich im Einsatz. Mit historischen Ölnebelmaschinen (welche wegen der Brennbarkeit des Nebels, der Niederschläge auf Oberflächen und der Schädlichkeit der Öle in der Lunge nicht mehr zulässig sind) haben diese Systeme jedoch wenig gemeinsam.\n1973 entwickelte der in Schenefeld bei Hamburg lebende Günther Schaidt das in dieser Form noch eingesetzte Nebelfluid und dazugehörige Maschinen. Er bekam für diese Entwicklung in Hollywood einen Technik-Oscar. So gut wie alle nachfolgenden Nebelmaschinen kopieren das Wirkungsprinzip dieser Safex-Maschinen.\n\n\n== Verwendung ==\n\nMan verwendet Nebelmaschinen in Film, Fernsehen und auf der Bühne, um eine geheimnisvolle Atmosphäre zu erzeugen. Häufig werden sie auf Partys und in Diskotheken eingesetzt, um die räumliche Wirkung von Scheinwerfern und Laserstrahlern (Dunstmaschine) zu erhöhen. Durch Streuung an den Nebeltröpfchen werden Lichtstrahlen von der Seite sichtbar. Nebel gibt dem Raum durch graduelles Verdecken Tiefe.\nDaneben dient Nebel als Hilfsmittel für technische Zwecke wie die Geschwindigkeitsmessung (per LDA) oder die Sichtbarmachen von Luft- und Gasströmungen (Stromlinien in Windkanälen). Bei der Feuerwehr wird Nebel als Rauchersatz bei Übungen eingesetzt, um eine künstliche Sichtbehinderung zu erzeugen. Im Modellbau wird das Aufsteigen von Rauch aus Kaminen und Dampflokomotiven simuliert.\nDer Nebel von Nebelmaschinen kann optische Rauchmelder auslösen. Bei einer angeschlossenen Brandmeldeanlage führt das zu einem Fehleinsatz für die Feuerwehr. Daher müssen die dazugehörigen Schleifen deaktiviert werden. Bei Brandmeldeanlagen und einigen automatischen Feuerlöschanlagen, die über keine technische Möglichkeit zur Funktionsüberprüfung verfügen, wird Kunstnebel daher auch zur Prüfung der Funktionstüchtigkeit eingesetzt.\nVerwendet wurden Nebelmaschinen auch, um militärische Anlagen oder Waffensysteme für feindliche Flugzeuge „unsichtbar“ zu machen. Außerdem werden sie eingesetzt, um Einbrechern die Sicht zu nehmen.\n\n\n== Funktionsweise ==\nIn gewöhnlichen Nebelmaschinen wird ein Gemisch aus destilliertem Wasser (um mineralische Rückstände zu verhindern) und hochreinem Propylenglycol oder Glycerin verwendet. Das Nebelfluid wird durch eine Pumpe in ein Heizelement mit engem Durchmesser gepresst, wo es durch Erhitzung verdampft. Das Ergebnis ist das feine Aerosol, welches später als Nebel wahrgenommen wird.\n\n\n== Anwendung ==\n\nKünstlicher Nebel streut ebenso wie natürlicher Nebel das Licht von Scheinwerfern. Bei Theater-Aufführungen, oder Konzerten werden daher Nebelmaschinen zusammen mit geeigneter Beleuchtung eingesetzt, um einen dramatischen Effekt zu erreichen.\nDa Nebelmaschinen oft an schwer zugänglichen Stellen montiert sind (z. B. an Decken oder hinter Schutzgittern), werden sie meist über Fernbedienungen oder per DMX gesteuert. Zusätzlich ist an einigen Nebelmaschinen noch ein Schalter zum Auslösen angebracht. Eine Fernbedienung ist für fast alle Nebelmaschinen zusätzlich erhältlich, wobei eine Ansteuerungsmöglichkeit per DMX auch in den unteren Preisklassen immer häufiger anzutreffen ist.\nDie Standzeit des Nebels ist in hohem Maße von der relativen Luftfeuchtigkeit abhängig. Je höher diese ist, desto langlebiger ist der Nebel. \n\n\n== Gesundheitliche Auswirkungen ==\nEnthält das Nebelfluid Glycerin, sollte es nicht auf 200 °C und mehr erhitzt werden, da es sonst zur Bildung des krebserregenden Stoffes Acrolein kommen kann. Gängige Nebelmaschinen verfügen über eine Temperaturregelung, welche zu hohe Temperaturen und somit die Bildung von Acrolein verhindern soll. Darüber hinaus ist zu beachten, dass Nebelmaschine und Nebelfluid eine zusammengehörige Einheit bilden. Daher sind nur Nebelfluide zu verwenden, die vom Hersteller der Nebelmaschine freigegeben sind.\nNebel mit Propylenglycol ist gesundheitlich unbedenklich, solange er nicht die normale Atemluft komplett ersetzt (Einatmen direkt aus der Nebelmaschine).\n\n\n== Andere Funktionsweisen ==\n\n\n=== Hazer ===\n\nBei Hazern werden meist spezielle Fluide auf Basis von Glycolen oder hochraffinierten Mineralölen verdampft oder zerstäubt, um so einen nahezu durchsichtigen Dunst zu erzeugen. Dies geschieht entweder ähnlich dem Prinzip der klassischen Nebelmaschine oder mittels Zerstäubung durch beispielsweise Ultraschall oder Druckluft. Zusätzlich kommt häufig ein Ventilator zum Einsatz, der den erzeugten Dunst gleichmäßig im Raum verteilt.\n\n\n=== Bodennebel ===\nDie Erzeugung von Bodennebel wurde ursprünglich meist durch Trockeneis (festes CO2 bei etwa −78 °C) unter Kondensation vorhandener Luftfeuchtigkeit erreicht. Aufgrund der schlechten Verfügbarkeit und hohen Lagerkosten wird inzwischen häufig mit tiefkaltem Flüssigstickstoff oder flüssigem Kohlenstoffdioxid gearbeitet. Ein Steigrohr zum Grund der stehenden Flasche erlaubt das rasche Entnehmen von flüssiger Phase, die bei Umgebungsdruck sehr schnell verdunstet, dabei abkühlt, teilweise zu festem Kohlensäureschnee wird, der beim Sublimieren weiter Wärme aufnimmt. Während das gesamte CO2 dabei gasförmig wird, wird durch Abkühlung aus der feuchten Umgebungsluft Wasser-Nebel (und eventuell etwas Schnee) gebildet.\nAuch das Abkühlen von konventionellem Nebel aus Nebelmaschinen erzeugt bodennahen Nebel. Weiter kommen Verfahren zum Einsatz, bei denen der Nebel aus herkömmlichen Maschinen mit Wassernebel aus Ultraschallzerstäubern schwerer gemacht wird. Der daraus resultierende Bodennebel bleibt aufgrund der größeren und schwereren Partikeln in Bodennähe, obwohl der Nebel an sich wärmer als die Umgebung ist. Als Nachteil wäre hierbei der hohe Wasserverbrauch und die Gefahr der Bildung von Rückständen auf dem Boden zu nennen.\nTrockeneis-Nebel gilt jedoch immer noch als der „schönste Bodennebel“, da dieser schneeweiß ist und durch seine hohe Dichte (wegen der verringerten Temperatur und Anreicherung mit CO2) über den Boden „fließt“.\n\n\n=== Chemische Reaktion ===\nBei einer weiteren Art von Maschinen werden zwei Chemikalien aus Druckgasbehältern, meist ähnlich einer Spraydose, gemischt und an einer Düse verbrannt. Vorteil ist, dass die Maschinen kompakt sind, und dass keine Stromversorgung benötigt wird, nachteilig sind die hohen Betriebskosten, die Brandgefahr und der Umstand, dass der Nebel gesundheitsschädlich ist. Sie wurden bis etwa Mitte der 1980er Jahre, insbesondere im Bereich der Filmproduktion, eingesetzt.\n\n\n=== CO2-Jet ===\nBei CO2-Jets wird unter Druck stehendes, flüssiges CO2 aus einer Düse gepresst und verdampft sofort. Dabei entsteht ein kurz stehender Nebel, ähnlich einer Flamme aus Bärlappsporen. Sie werden daher auch als „kalte Flamme“ bezeichnet. Bei entsprechender Beleuchtung lassen sich damit auch andersfarbige und ungefährliche Flammen erzeugen.\n\n\n== Siehe auch ==\n\nRauchpulver\nNebelmittelwurfanlage\n\n\n== Einzelnachweise ==", "Der Sichter ist eine Vorrichtung zur Klassierung von Feststoffen nach definierten Kriterien wie Partikelgröße, Dichte, Trägheit, Schwebe- oder Schichtungsverhalten. Das Verfahren kommt beispielsweise in Getreidemühlen zum Einsatz.\nDas Sichten nutzt die unterschiedlichen Massenkräfte und Strömungswiderstände der verschieden großen Feststoffteilchen in einem Medium, etwa in einem Luftstrom. Damit unterscheidet es sich technologisch vom Sieben.\n\n\n== Funktion ==\n\nBei einem Windsichter erfolgt die Trennung in einem Luftstrom, wobei die weniger dichten und schwebefähigen Teilchen mitgerissen werden. Der seit langer Zeit bekannte Dreschvorgang von Getreide beruht auf diesem Prinzip. Durch den Dreschflegel wird das Korn von der Spreu getrennt, wobei die Spreu teilweise vom Wind weggeweht wird. Anschließend wird das Korn-Spelzen-Gemisch mit einer Schaufel in die Höhe geworfen – der Wind trennt die Bestandteile und transportiert die leichtere Spreu ab, während das schwerere Getreidekorn wieder zu Boden fällt. Später wurden zu diesem Zweck auch Windfegen eingesetzt.\nPlansichter können zur Trennung von Feststoffteilchen, welche die gleiche Dichte, aber unterschiedliche Größen besitzen, eingesetzt werden. Dabei wird das zu trennende Gut über schwingende Siebe bewegt, wobei die kleineren Teilchen nach unten sinken und durch das Siebgewebe fallen.\nEin Vorläufer dieser aus dem Mühlenbau kommenden Maschinen ist der Sechskant- und der Askaniersichter. \nIn der Partikelmesstechnik werden Messzyklone, (Kaskaden-)Impaktoren oder Strahlumlenksichter eingesetzt, um gasgetragene Partikeln nach ihrer Größe zu klassieren. Hierbei wird genutzt, dass die Partikelbahn innerhalb des Trennapparates von der Trägheit der Partikel abhängt.\n\n\n== Anwendung ==\n\nTrennung vom Korn und Stroh, das Worfeln\nTrennung von gemahlenem Getreide in Grieß, mineralstoffarme und mineralstoffreiche Mehlsorten.\nAbtrennen von Partikeln oberhalb einer bestimmten Größe aus einem Gasstrom (z. B. PM10-Messung)\nReinigen von Kunststoffgranulat von Staub/Fremdstoffen und Engelshaar\nBestimmung der Feinheit des Kohlenstaub innerhalb einer Kohlemühle\n\n\n== Ausführungen ==\n\n\t\t\n\n\n== Siehe auch ==\nAbscheider\nBeutler\n\n\n== Literatur ==\nClaus Bernhardt: Granulometrie. Klassier- und Sedimentationsmethoden. Deutscher Verlag für Grundstoffindustrie, Leipzig 1990, ISBN 3-342-00415-0.\nMatthias Stieß: Mechanische Verfahrenstechnik – Partikeltechnologie. Band 1. 3., vollständig neu bearbeitete Auflage. Springer, Berlin 2009, ISBN 978-3-540-32551-2.\n\n\n== Einzelnachweise ==", "Das Aggregat (von lat. aggregare ‚beigesellen‘, ‚anhäufen‘) in der Technik, besonders der Elektrotechnik und dem Maschinenbau, ist ein Maschinensatz aus mehreren zusammenwirkenden Einzelmaschinen, -apparaten oder -geräten. Dabei wird meistens eine Kraftmaschine mit einer Arbeitsmaschine zur Erfüllung einer bestimmten technologischen Funktion gekoppelt. Beispiele für Aggregate sind:\n\nKühlaggregat: besteht aus Verdichter, Wärmetauscher, Pumpe, Motor, Lüfter usw.\nNotstromaggregat\nTriebwerksaggregat\nMotoraggregat\nAntriebsaggregat im Kraftfahrzeug besteht aus einem Verbrennungsmotor, dem Getriebe und der Antriebswelle; in modernen Fahrzeugen mit Hybridantrieben kommt zusätzlich noch der Elektromotor hinzu\nGetriebeaggregate\nTurbogenerator: besteht aus einer Dampfturbine und einem Generator zur Stromerzeugung (Kraftwerk)\n\n\n== Betriebswirtschaft ==\nTechnische Produkte setzen sich häufig aus komplexen und variantenreichen Baugruppen zusammen. In der Betriebswirtschaft, insbesondere der Produktionswirtschaft, werden die charakteristischen Baugruppen, aus denen sich ein Produkt maßgeblich zusammensetzt, auch als Aggregate bezeichnet. Die Anzahl und die Art der Aggregate hängt wesentlich von dem jeweiligen Produkt ab. Bei einem PKW sind dies bspw. der Motor, die Karosserie, das Getriebe und die Achsen, bei einem Flugzeug sind dies der Flugzeugrumpf, das Fahrwerk, die Tragflächen und das Düsentriebwerk bzw. die Propellerturbinen. Die Aggregate bilden die technische Basis eines Produktes und werden durch Basis-Merkmale beschrieben. Jede unterschiedliche Kombination von Basis-Merkmalen ergibt jeweils ein Grundmodell des Produktes, das durch weitere Zusatz-Merkmale (Ausstattungen, Funktionen) variiert werden kann.  Die Kombination aller Basis- und Zusatzmerkmale beschreibt ein einzelnes Produkt vollständig und eindeutig.  Die Zerlegung von Produkten in Aggregate und deren 'modulare' Beschreibung stellt eine wesentliche Erleichterung für die Produktentwicklung, die Fertigungsplanung, die Auftragsfertigung und die Abwicklung des Kundenauftrags dar. Diese Modularisierung setzt sich fort, bis zur Erstellung Produkt begleitender Benutzerinformationen (Betriebsanleitungen).\n\n\n== Literatur ==\nWilmjakob Herlyn: PPS im Automobilbau – Produktionsprogrammplanung und -steuerung von Fahrzeugen und Aggregaten. Hanser Verlag, München 2012, ISBN 978-3-446-41370-2.\nT. Pfeifer, P. Lorenzi, R. Schmidt: Betriebsanleitungen modular aufbauen. In: technische kommunikation. 24, H. 2, 2002, S. 19.\n\n\n== Einzelnachweise ==", "Eine Verpackungsmaschine oder -anlage stellt eine technische Einheit dar, welche das Packgut (z. B. Produktionsteile, Gebinde, Waren) mit einem Packmittel (z. B. Band, Karton, Folie) ganz oder teilweise umhüllt.\n\n\n== Details ==\nNach DIN 55405 wird Verpacken definiert als das Herstellen einer Packung/eines Packstückes durch Vereinigung von Packgut und Verpackung unter Anwendung von Verpackungsverfahren mittels Verpackungsmaschinen, -geräten oder von Hand. Dabei stellt das Packgut die zu verpackende Ware dar und die Verpackung ist der Oberbegriff für alle Packmittel und Packhilfsmittel.\nDer Verpackungsvorgang wird in drei Kategorien unterteilt:\n\nmanuell\nhalbautomatisch\nvollautomatischDie letzteren beiden Punkte erfolgen mit Hilfe von Verpackungsmaschinen, welche nach den unterschiedlichsten Prinzipien, je nach Packgut und gewünschtes Packstück, arbeiten. Sinn und Zweck ist es Transportverpackungen (Versandverpackungen), Umverpackungen und/oder die Stapelfähigkeit herzustellen.\nManuelle Umreifungsgeräte werden überall dort eingesetzt, wo ganze Paletten gesichert werden müssen. Im Gegensatz dazu werden automatische Verpackungsmaschinen bei kleineren Versandeinheiten wie z. B. Kartons, Säcke oder längliche Gütern benötigt. Der Unterschied zwischen eine halbautomatischen (ca. 20–40 Packstücke pro Tag) und vollautomatischen Verpackungsmaschine (ab ca. 40 Packstücke pro Tag) besteht darin, dass bei der halbautomatischen Maschine das Umreifungsband manuell um das Paket geführt werden muss. Die Umreifung wird per Sensor oder Knopfdruck ausgelöst. Die Maschine erledigt den restlichen Vorgang automatisch (Band spannen bis zur voreingestellten Spannung, verschweißen und schneiden). Bei der vollautomatischen Maschine wird die Ware automatisch umreift.Bei Verpackungsmaschinen handelt es sich oftmals um hocheffiziente Anlagen zur schnellen und sicheren Verpackung (empfindlicher) Güter. Komplexere, leistungsfähige Maschinen lassen sich leicht umprogrammieren und für verschiedene Verpackungsarten einsetzen. Handhabungs- und Verpackungsmaschinen arbeiten häufig unmittelbar bei- und miteinander und sollten deshalb aufeinander abgestimmt sein. Die Typenvielfalt bei Verpackungsmaschinen ist sehr groß. Die Bandbreite reicht von einfachen Folienwickelstationen bis hin zu komplexen Anlagen mit automatischer Bestückung, Packmittelfaltung und Verschließung. Zum Bereich der automatischen Verpackung von Gütern gehören ebenfalls die Etikettierung, die Abstapelung und die Transportsicherung. Auch hierzu steht eine große Auswahl an speziellen Maschinen zur Verfügung.\nEs gibt sehr verschiedene und unterschiedliche Maschinentypen wie solche zum Abfüllen und Dosieren, Blister, Ein-/Auspacker, Einschlagen und Einwickeln, Etikettieren, Formen, Füllen, Siegeln, Füller, Kartonierer, Palettierer, Schlauchbeutel, Sichern, Schrumpfen, Umreifen, Top- / Front-Loader, Transport und andere mehr.\nNeben standardisierten Verpackungsmaschinen, die für unterschiedliche, jedoch ähnliche Packstücke vielfältig geeignet sind, gibt es auch Sondermaschinen, welche nur für einen einzigen, individuellen Verpackungsvorgang entwickelt und gebaut werden. Häufig sind diese Spezialverpackungsmaschinen Teil einer kompletten Fertigungslinie.\n\n\n== Produktbeispiele ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== Einzelnachweise =="]