["Quelltext, auch Quellcode (englisch source code) oder unscharf Programmcode genannt, ist in der Informatik der für Menschen lesbare, in einer Programmiersprache geschriebene Text eines Computerprogrammes. Abstrakt betrachtet kann der Quelltext für ein Programm auch als Software-Dokument bezeichnet werden, welches das Programm formal so exakt und vollständig beschreibt, dass dieses aus ihm vollständig automatisch von einem Computer in Maschinensprache übersetzt werden kann.\nQuelltext kann auch (teilweise oder komplett) nicht-textueller Form sein, zum Beispiel als grafische Verknüpfung von logischen Funktionsblöcken (beispielsweise in Simulink oder als UML-Diagramm). Der Quelltext eines Programms kann mehrteilig sein, zum Beispiel auf mehrere Dateien (evtl. unterschiedlicher Formate) aufgeteilt sein oder teilweise grafisch, teilweise textuell vorliegen (z. B. UML, angereichert mit Methodenimplementierungen in der verwendeten Programmiersprache).\n\n\n== Anwendung ==\n\n\n=== Erstellung ===\nQuelltext wird meist manuell mit Hilfe einer integrierten Entwicklungsumgebung oder eines Texteditors erstellt. Es gibt aber auch Codegeneratoren, die den Code aus strukturierten Entwurfsdokumenten, z. B. Struktogrammen oder UML-Entwürfen, automatisch generieren. Eine weitere Erstellungsmöglichkeit sind Entwicklungswerkzeuge, die aus Entwürfen Code und umgekehrt auch aus Code wieder Entwürfe erzeugen können. Dabei werden manuelle Änderungen am Code nachträglich wieder in den Entwurf übernommen. Auf diese Weise ist ein „Round-Trip-Engineering“ möglich, bei dem an jeder Stelle manuelle Veränderungen in den gesamten Entwicklungsprozess eingebracht werden können.\nZum Erstellen des Quelltextes ist meist ein einfacher Texteditor ausreichend. Mithilfe sprachspezifischer Editoren können gewisse Arbeitsschritte vereinfacht werden: Durch Syntaxhervorhebung werden Teile des Quelltextes entsprechend ihrer Funktionalität farblich hervorgehoben, was die Lesbarkeit verbessert. Ebenfalls zur Verbesserung der Lesbarkeit halten sich Programmierer meist an eine bestimmte Quelltextformatierung (z. B. Einrückung von Unterabschnitten, Groß-/Kleinschreibung …). In manchen Sprachen ist eine bestimmte Quelltextformatierung vorgegeben (z. B. Fortran-77, Python), manche integrierte Entwicklungsumgebung kann den Quelltext automatisch formatieren (sog. Beautifier).\nBei größeren Programmen, die aus vielen einzelnen Quelldateien bestehen, werden mitunter Informationen verwaltet, welche die Abhängigkeiten der Quelltextdateien untereinander beschreiben. Dies erlaubt beim Kompilieren mittels eines einzigen Aufrufes, alle Arbeitsschritte zur Erstellung des fertigen Programms auszuführen und nur jene Bestandteile erneut zu übersetzen, welche zwischenzeitlich geändert wurden oder von geänderten Komponenten abhängen. Beispiel hierfür sind Makefiles.\nZur besseren Dokumentation der Änderungen oder der gezielten Synchronisierung von mehreren gleichzeitig arbeitenden Programmierern wird der Quelltext häufig mit einer Software-Versionsverwaltung gespeichert, wodurch Änderungen später einsehbar sind und erforderlichenfalls rückgängig gemacht werden können.\n\n\n=== Übersetzung und Ausführung ===\n\nBevor das Programm, das der Programmierer schreibt, von einem Computer ausgeführt werden kann, muss es in Maschinensprache, also in eine vom Computer verständliche Folge von Bits, umgesetzt werden. Dies kann entweder vorab durch einen Compiler oder – zur Laufzeit – durch einen Interpreter oder JIT-Compiler geschehen. Bei einigen Programmiersprachen wird auch eine Kombination aus beiden Varianten gewählt, wobei zuerst der Quelltext der jeweiligen Sprache – meist vom Programmierer veranlasst – in einen abstrakten Zwischencode übersetzt wird, welcher dann zur Laufzeit von einer Laufzeitumgebung durch einen Interpreter oder JIT-Compiler in den Maschinencode überführt wird. Dieses Prinzip hat den Vorteil, dass ein und derselbe Zwischencode auf sehr vielen verschiedenen Plattformen ausführbar ist und somit nicht für jedes auf dem Markt übliche System eine eigene Version der Software erscheinen muss. Typische Beispiele für einen solchen Zwischencode sind der Java-Bytecode sowie die Common Intermediate Language. Mittels eines Debuggers kann die Funktionsweise des Programmes zur Laufzeit verfolgt werden.\nKommen bei der Programmierung Precompiler zum Einsatz, so kann der vom Programmierer erzeugte originäre Quelltext u. a. Ausdrücke/Anweisungen enthalten, die die eigentliche Programmiersprache nicht ‚versteht‘. Ein Beispiel dafür sind SQL-Anweisungen. Solche Anweisungen werden vom Precompiler in Befehle der Programmiersprache übersetzt; in den dabei oft nur temporär erzeugten Quelltextdaten werden die Originalanweisungen meist als Kommentare eingefügt, um sichtbar zu bleiben. Ähnlich wird auch beim Einsatz von Makroprozessoren verfahren: Diese generieren aus den als Makro formulierten Anweisungen Befehle der jeweiligen Programmiersprache.\nDie bei der Kompilierung erzeugten Maschinenbefehle (bei höheren Programmiersprachen meist mehrere je Quellcodeanweisung) repräsentieren in der Regel die programmierte Funktion selbst (bei einfachen Befehlen wie z. B. Addieren von Variableninhalten); dazu gehören auch Aufrufe von Betriebssystemfunktionen. Alternativ kann der Compiler eine der programmierten Anweisung entsprechende Routine, z. B. aus einer Programmbibliothek, im Zielcode direkt einfügen – oder nur einen Aufrufbefehl für eine solche Routine (z. B. für einen Datenbankaufruf oder für komplexe Algorithmen). So aufgerufene Routinen führen im Quelltext codierte Anweisungen als Unterprogramm und somit ‚gekapselt‘ aus.\n\n\n== Lizenzierung ==\n\nSoftware und der dazugehörige Quelltext unterliegen dem Urheberrecht. Sie können in zwei Kategorien unterteilt werden: Proprietäre Software und quelloffene-Software.\nQuelloffene Programme, also solche, die unter einer „Open-Source“-Lizenz stehen, werden in der Regel direkt mit ihrem Quelltext ausgeliefert, dessen Änderung und Weitergabe durch die Lizenz gestattet ist. Dies ermöglicht deren Studium, Prüfung und Anpassung für spezifische Bedürfnisse. Verfechter des Open-Source-Prinzips sind der Meinung, dass dies zudem die Qualität verbessere, da Fachleute die Fehler besser lokalisieren könnten und sie entweder direkt beheben oder den ursprünglichen Programmierern qualitativ bessere Fehlermeldungen liefern könnten. Die Möglichkeit, Open-Source-Software anhand ihres Quelltextes zu überprüfen, erhöhe das Vertrauen des Anwenders in ihre Korrektheit und Funktionalität im Sinne des Anwenders. Freie Software ist in diesem Sinne mit Open-Source-Software identisch.\nProprietäre Software wird in der Regel ohne Quelltext (Closed Source) oder nur unter besonders restriktiven Lizenzen ausgeliefert. Dem Schutz des Abnehmers/Anwenders dienen dann manchmal Vereinbarungen zur Quelltexthinterlegung (Source Code Escrow Agreements). Bei individuell beauftragter Erstellung von Individualsoftware durch Dritte wird in der Regel die Übergabe des Quelltexts ebenfalls vereinbart. Bei Software, die ein Anwender, zum Beispiel ein Unternehmen, für eigene Zwecke erstellt, sind Lizenzvereinbarungen überflüssig.\n\n\n== Andere Bedeutungen ==\nIm weiteren Sinne versteht man unter Quelltext auch die menschenlesbare Beschreibung eines gerenderten Mediums.\n\nDer Quelltext von Web-Seiten ist in der Regel in HTML geschrieben.\nUnter dem Quelltext von Wikipedia-Artikeln ist der Text zu verstehen, den die Autoren der Artikel eingeben. Hier ist, wie bei vielen dynamischen Webseiten, der HTML-Code das Ergebnis einer Transformation des Wiki-Codes nach HTML und CSS. Somit ist bei dynamischen Webseiten mit Quelltext häufig nicht das generierte HTML gemeint, sondern die Informationsquelle, aus der die Webseite generiert wird.\nAuch PostScript und andere Vektorformate sind ungerendert „Quelltext“.\nVHDL beschreibt elektronische Schaltungen, die in einem Simulator Datenverarbeitung betreiben können.\n\n\n== Siehe auch ==\nProgrammierstil\nEinrückungsstil\nObfuscator (Quelltextverschleierung)\nAuszeichnungssprache - beschreibt die Darstellung, Gliederung und Formatierung ... von Texten\n\n\n== Weblinks ==\n\n\n== Einzelnachweise ==", "Ein Computerprogramm oder kurz Programm ist eine den Regeln einer bestimmten Programmiersprache genügende Folge von Anweisungen (bestehend aus Deklarationen und Instruktionen), um bestimmte Funktionen bzw. Aufgaben oder Probleme mithilfe eines Computers zu bearbeiten oder zu lösen.\n\n\n== Überblick ==\n\nEin Computerprogramm gehört zur Software eines Computers. Es liegt meist auf einem Datenträger als ausführbare Programmdatei, häufig im sogenannten Maschinencode vor, die zur Ausführung in den Arbeitsspeicher des Rechners geladen wird. Das Programm wird als Abfolge von Maschinen-, d. h. Prozessorbefehlen von dem oder den Prozessoren des Computers verarbeitet und damit ausgeführt. Unter Computerprogramm wird auch der Quelltext des Programms verstanden, aus dem im Verlauf der Softwareentwicklung der ausführbare Code entsteht.\nEine Programmdatei, die aus Maschinencode besteht, enthält Befehle aus dem Sprachschatz des Prozessors, d. h. Befehle, die für den Prozessor „verständlich“ und damit ausführbar sind. Die Erstellung eines solchen Programms bezeichnet man allgemein als Programmierung oder auch als Implementierung. In den Anfängen der Programmierung wurde – bis zur Entwicklung von Programmiersprachen – ausschließlich in Maschinencode programmiert. Der Programm- bzw. Quelltext, den der Programmierer in einer Programmiersprache abgefasst hat, besteht aus einer Abfolge von (zumeist der englischen Sprache entnommenen) Anweisungen, die für den Programmierer im Allgemeinen verständlicher sind (z. B. ADD, SUB, AND, OR) als der Maschinencode. Später ergänzten Schleifen, Abstraktion und modularer Aufbau die höheren Programmiersprachen.\nDateien, in denen der Programmcode gespeichert ist, sind meist durch eine Dateiendung gekennzeichnet. Quelltextdateien weisen damit auf die verwendete Hochsprache hin (<programm>.c: ein in C formuliertes Programm). Sie kann im Allgemeinen mit einem einfachen Texteditor bearbeitet werden. Eine Datei, die dagegen Maschinencode enthält, besitzt keine oder eine betriebssystemspezifische Endung, die lediglich auf ihre Ausführbarkeit hinweist (<programm>.exe bei MS-DOS und Windows; <programm> bei unixoiden Systemen). Sie kann oft als Kommando in einem Terminal (Eingabeaufforderung) aufgerufen werden. Siehe auch Programmbibliothek.\nDamit ein in einer Hochsprache geschriebenes Programm auf einem Prozessor ausgeführt werden kann, muss es in Maschinencode übersetzt werden. Eine Anweisung einer höheren Programmiersprache wird im Allgemeinen in mehrere Maschinenbefehle übersetzt. Den Übersetzungsvorgang nennt man Kompilierung. Um aus dem Quelltext den Maschinencode zu generieren, wird ein Assembler, Compiler oder Interpreter benötigt. Dieser übersetzt die Anweisungen der Programmiersprache, die für menschliche Benutzer verständlich und bearbeitbar sein sollen, in die semantisch entsprechenden Befehle der Maschinensprache des verwendeten Computers.\nDie Anweisungen, die (als Teil von Programmen) einen konkreten Lösungsweg repräsentieren, werden als Algorithmus bezeichnet; Beispiel: Berechnen der Mehrwertsteuer.\nIm Sprachgebrauch wird Computerprogramm meist zu Programm verkürzt oder der Begriff Software verwendet. Allerdings ist Computerprogramm kein Synonym zu Software, da mit Software die komplette, für den Benutzer fertige Anwendung gemeint ist. Diese umfasst zusätzliche Ressourcen wie Betriebssystem, Datenbanken, Grafik- und Audiodateien, Schriftarten oder Hilfetexte.\nEin größeres Computerprogramm besteht meist aus mehreren Modulen – die entweder zum Programm selbst gehören oder die als Bausteine (Unterprogramme) aus bereits bestehenden Programmbibliotheken bei der Ausführung des Programms benutzt werden. Im umgekehrten Fall können Computerprogramme Teil eines übergeordneten, ein größeres Aufgabengebiet abdeckenden Anwendungssystems sein; Beispiel: Gehaltsabrechnung, Finanzbuchhaltung, Meldewesen.\nDie Entwicklung von Computerprogrammen ist das Gebiet der Softwaretechnik. Je nach Komplexität der zu entwickelnden Computerprogramme geschieht dies im Rahmen von Projekten. Die Aktivitäten der Beteiligten werden dabei meist unter Anwendung von Vorgehensmodellen, speziellen Methoden und Werkzeugen zur Softwareentwicklung ausgeführt.\n\n\n== Klassifizierungsmöglichkeiten ==\nNeben den für Software im Allgemeinen geltenden Unterscheidungsmerkmalen lassen sich Computerprogramme (als Untervariante von Software) nach den folgenden, beispielhaft genannten Kriterien unterscheiden:\n\nQuellprogramme (in einer bestimmten Programmiersprache) oder Maschinenprogramme (ausführbar unter bestimmten Betriebssystemen) oder Programme in einem Zwischencode\nHauptprogramme (aufgerufen über Betriebssystem-Kommandos) oder Unterprogramme (aufgerufen durch andere Programme). Sonderformen treten auf, wenn Programme z. B. über technische Steuerungskomponenten aufgerufen werden, z. B. über serviceorientierte Architekturen, automatisiertes Workflow-Management.\nStapelprogramme (verarbeiten 'Stapel' von Daten) oder Dialogprogramme (stehen in Interaktion mit Benutzern)\nNach dem Ort der Speicherung und Programmausführung unterschieden können Programme lokal (auf einem Arbeitsplatzrechner) gespeichert und ausgeführt werden oder auf einem Server installiert sein und trotzdem lokal (nach dem Laden über eine Online-Verbindung) ausgeführt werden oder nur auf dem Server gespeichert und dort auch ausgeführt werden. Bei verteilten Anwendungen werden Programmteile auf unterschiedlichen Rechnern ausgeführt, z. B. die Geschäftslogik und Datenhaltung im Server, Funktionen der Benutzeroberfläche am lokalen Rechner; im rein technischen Sinn stehen hierbei verschiedene Programme miteinander in Verbindung.\n\n\n== Geschichte ==\n\n\n=== Das erste Computerprogramm von Ada Lovelace ===\nAls weltweit erstes Computerprogramm gilt eine Vorschrift für die Berechnung von Bernoulli-Zahlen, die Ada Lovelace in den Jahren 1842/1843 für die mechanische Analytical Engine von Charles Babbage erstellte. Das Programm konnte ihrerzeit nur von Hand ausgeführt werden, da es im 19. Jahrhundert noch keine funktionsfähige Maschine gab, die dazu in der Lage war.\n\n\n=== Erste Programme auf Lochstreifen ===\nIn den Jahren 1936 bis 1941 entwarf Konrad Zuse die Rechner Z1 und Z3, die lange Befehlsfolgen auf einem Lochstreifen verarbeiteten, die ersten Computerprogramme, die auf realen Maschinen ausgeführt werden konnten. Die Rechner beherrschten die vier Grundrechenarten und Quadratwurzelberechnungen auf binären Gleitkommazahlen, der Lochstreifen enthielt jeweils eine Rechenoperation und eine Speicheradresse.\nAuf Zuse geht auch die erste höhere Programmiersprache Plankalkül zurück. Damit lassen sich Probleme maschinenunabhängig formulieren und später in eine maschinenlesbare Form überführen.\n\n\n=== Programme im Arbeitsspeicher ===\nDer EDVAC-Rechner, der auf einem Entwurf von John von Neumann aus dem Jahre 1945 basiert, hatte einen Quecksilber-Verzögerungsspeicher für 1024 Fest- oder Gleitkommazahlen mit jeweils 44 Bit. Jede Speicherzelle konnte statt einer Zahl auch einen Befehl aufnehmen. Bei diesem Rechnerkonzept war es möglich, die Befehle eines Computerprogramms vor der Ausführung zuerst in den Arbeitsspeicher zu übertragen. Das ist heute noch üblich. EDVAC wurde jedoch erst im Jahr 1951 teilweise fertiggestellt. Der Demonstrationsrechner Manchester SSE und der auf dem EDVAC aufbauende EDSAC-Rechner hatten schon vorher Programme aus dem Arbeitsspeicher ausgeführt.\n\n\n=== Höhere Programmiersprachen und Compiler ===\nEnde der 1950er-Jahre wurden Computer so leistungsfähig, dass spezielle Programme, Compiler genannt, Quelltexte in höheren Programmiersprachen automatisch in Maschinenbefehle, also ausführbare Programme, übersetzen konnten. Ausführbare Programme können dann, wie beim EDVAC, in den Speicher geladen und abgearbeitet werden.\nMit Fortran, COBOL, ALGOL und LISP entstanden in den späten 1950er-Jahren die ersten standardisierten höheren Programmiersprachen. Programme in diesen Sprachen laufen, durch einen entsprechenden Compiler übersetzt, auf unterschiedlichen Rechnern. Sie können teilweise auch noch auf modernen Computern eingesetzt werden.\n\n\n== Vom Algorithmus zum Programm ==\n\n\n=== Berechnung des größten gemeinsamen Teilers ===\nEs soll ein Programm zur Bestimmung des größten gemeinsamen Teilers (ggT) zweier Zahlen erstellt werden. Zunächst muss ein geeigneter Algorithmus gefunden werden.\nDer Euklidische Algorithmus, der bereits um 300 v. Chr. beschrieben wurde, ermittelt den größten gemeinsamen Teiler (ggT) zweier natürlicher Zahlen a und b:\n\nSei a die größere der beiden Zahlen a und b.Wenn a kleiner als b ist, dann vertausche die Zahlen.\nSetze a auf den Wert a - b.\nWenn a und b ungleich sind, dann fahre mit Schritt 1 fort.Wenn a und b gleich sind, dann ist der Algorithmus beendet.Diese Zahl ist der größte gemeinsame Teiler.\n\n\n=== Verwendung einer Programmiersprache ===\nSobald eine formale Beschreibung eines Algorithmus, also eine genau definierte Verarbeitungsvorschrift, vorliegt, kann der Algorithmus umgesetzt (implementiert) werden. Dazu wird eine geeignete Programmiersprache ausgewählt.\nZur Umsetzung wird heute meist eine höhere Programmiersprache verwendet, die von einem Computer eventuell nicht direkt ausgeführt werden kann, sondern zuerst kompiliert oder interpretiert werden muss.\nIn Sprachen wie Pascal dienen Variablen, Ausdrücke, Vergleiche, Zuweisungen und Kontrollstrukturen zur Umsetzung des ggT-Algorithmus:\n\n\n=== Berücksichtigung aller Sonderfälle ===\nBei der Umsetzung wird mit der Prüfung von Schritt 3 begonnen. Der ursprüngliche Algorithmus berücksichtigt nicht den Fall, dass a und b bereits zu Beginn gleich sein können. Wäre es die Aufgabe, den größten Teiler von 103 und 103 zu finden, würde ein Mensch sofort das Ergebnis 103 nennen, er würde den Algorithmus gar nicht bemühen. Der originale Algorithmus würde aber null ergeben. Die Umsetzung auf einem Rechner muss auch alle Sonderfälle berücksichtigen. Durch das Vorziehen von Schritt 3 wird der Sonderfall hier korrekt behandelt.\n\n\n=== Elementare Schritte ===\nPascal und andere Programmiersprachen besitzen keine Operation zum Vertauschen von Zahlen. Dies muss daher in elementarere Schritte umgesetzt werden. Die zusätzliche Variable temp, eine sogenannte Hilfsvariable, erlaubt die Vertauschung mit Hilfe von drei Zuweisungen:\n\nAuch dies ist ein kleiner Algorithmus.\n\n\n=== Ein vollständiges Programm ===\nDamit daraus ein korrektes Programm wird, muss der Algorithmus noch um Ein- bzw. Ausgabeanweisungen, oft jedoch auch um Variablen und eine Programmstruktur ergänzt werden. Diese sind nicht Teil des eigentlichen Algorithmus:\n\n\n=== Übersetzung und Ausführung ===\nEin solches Programm wird unter Verwendung eines Texteditors erstellt und als Quellcode in einer Datei oder Programmbibliothek (für Quellcode) gespeichert. Anschließend kann der Quellcode zu einer festen Ablaufanweisung für den Computer 'übersetzt’ werden. Hierzu ist ein Compiler erforderlich, der den Code aus der jeweiligen Programmiersprache in die Maschinensprache übersetzt und als Ergebnis ein ausführbares Programm erstellt, welches als Datei oder in einer Programmbibliothek (für ausführbare Programme) abgelegt wird. Dieses Programm kann dann über ein Betriebssystem zur Ausführung gestartet werden, und zwar beliebig oft (ohne neue Übersetzung).\nEinige Programmiersprachen verwenden keinen Compiler, sondern einen Interpreter, der Programme erst zur Laufzeit in Maschinensprache übersetzt.\nEine weitere Möglichkeit besteht in der Verwendung von Zwischencode (Bytecode), der vom Compiler an Stelle des Maschinencodes generiert wird. Ein Beispiel dafür ist Java: Der Java-Compiler erzeugt Bytecode, welcher dann auf der sogenannten virtuellen Maschine ausgeführt wird. Die virtuelle Maschine interpretiert oder übersetzt dann den Bytecode für das darunterliegende Betriebssystem.\nEbenso muss in manchen Rechnerumgebungen, in der Regel bei Großrechnern, der vom Compiler erstellte Maschinencode noch mit einem Systemprogramm ('Linkage Editor' o. ä.) nachbearbeitet werden, wobei ggf. weitere Unterprogramme und Systemroutinen 'eingebunden' werden können. Erst so ist das entstandene Programm ausführbar.\nMittels spezieller Programme, sogenannter Decompiler, ist es in begrenztem Maße möglich, aus dem Maschinencode wieder einen in Hochsprache lesbaren Quelltext zu erzeugen.\n\n\n=== Lebensphasen ===\nProgramme haben mindestens zwei klar getrennte Lebensphasen: Der Zeitraum bis zum Zeitpunkt der Kompilierung (inklusive) wird Compilezeit genannt, welche im Gegensatz zur Laufzeit steht. In der Compilezeit-Phase hat das Programm statische Eigenschaften, gegeben nur durch den festen Quellcode. Nach der Kompilierung und mit der Ausführung besitzt das binäre Programm dynamische Eigenschaften und Verhalten in zusätzlicher Abhängigkeit der jeweiligen Laufzeitumgebung (variierende Hardware, User-Interaktion etc.).\nIn detaillierterem Sinn lassen sich die Lebensphasen von Programmen auch als Software-Lebenszyklus verstehen. Demnach gehören zur inhaltlich präzisen Festlegung des Programm-Inhalts die Projektphasen Problemstellung, Analyse und Entwurf, anschließend folgt die technische Implementierung, in der das Programm in Form von Quelltext entsteht. Danach befindet es sich in der Phase Einführung. Nach diesen Entstehungsphasen von Programmen folgt deren produktive Nutzung, bei Bedarf werden Anpassungen und Erweiterungen (Wartungs-/Pflegephase) vorgenommen.\nAus betriebswirtschaftlicher Sicht lassen sich auch Computerprogramme nach dem allgemeinen Produktlebenszyklus klassifizieren.\n\n\n== Urheberschutz ==\nEin Computerprogramm wird urheberrechtlich geschützt, wenn es individuelles Ergebnis einer eigenen geistigen Schöpfung ihres Urhebers ist (§ 69a Abs. 3 UrhG). Mit Umsetzung der Urheberrechtsrichtlinie aus dem Jahre 2001 wurde die Schutzschwelle für Computerprogramme in den EG-Mitgliedsstaaten harmonisiert. Es genügt ein Minimum an Individualität für den Schutz (Kleine Münze). Es wird vermutet, dass sich die Individualität des Urhebers im Programm niedergeschlagen hat, wenn Spielraum dazu bestand. Geistiger Gehalt wird vermutet, wenn das Programm von einem menschlichen Urheber geschaffen wurde.\n\nEntwicklung\nIn der Bundesrepublik erfolgte die gesetzliche Anerkennung des Urheberrechtsschutzes 1985; die Rechtsprechung hielt ihn schon vorher für möglich.1991 folgte die Richtlinie 91/250/EWG über den Rechtsschutz von Computerprogrammen, 1993 gesetzliche Regelungen in Österreich und der Schweiz sowie 1996 in Liechtenstein.In der DDR hatte die Rechtsprechung 1979 die urheberrechtliche Schutzfähigkeit verneint, jedoch konnte in Wirtschaftsverträgen über wissenschaftlich-technische Leistungen die Vergabe von Software durch andere Partner als die erarbeitende Wirtschaftseinheit ausgeschlossen werden.\n\n\n== Siehe auch ==\nAnwendungssoftware\nDienstprogramm\n\n\n== Literatur ==\nJohn von Neumann: First Draft of a Report on the EDVAC. (PDF; 0,4 MB) 1945\nMartín Abadi, Takayasu Itō: Theoretical Aspects of Computer Software. 1997\nMasami Hagiya, John C. Mitchell: Theoretical Aspects of Computer Software. 1994\n\n\n== Weblinks ==\n\n\n== Einzelnachweise ==", "Die Plattformunabhängigkeit – genauer als plattformübergreifend und allgemeiner portabel – wird in der Informationstechnik die Eigenschaft genannt, dass ein Programm auf verschiedenen Plattformen ausgeführt werden kann. Aus dem Englischen entlehnt wird diese Eigenschaft auch als Cross-Plattform bezeichnet.\n\n\n== Einschränkungen ==\nEin Programm benötigt in der Regel immer eine sogenannte Laufzeitumgebung, in der es ausgeführt (oder gestartet) werden und über den gesamten Ausführungszeitraum hinweg stabil lauffähig sein kann. Mit der Eigenschaft plattformunabhängig oder, etwas genauer, plattformübergreifend werden Programme näher beschrieben, die auf verschiedenen Plattformen – also Rechnersystemen mit Unterschieden in Architektur, Prozessor, Übersetzer, Betriebssystem (in diesem Fall auch betriebssystemübergreifend genannt) und weiteren Dienstprogrammen, die zur Übersetzung oder Ausführung notwendig sind – lauffähig sind. Der Grad der Plattformunabhängigkeit wird auch als Portabilität bezeichnet (aus englischen portability). Darunter wird nicht nur die bestehende Plattformunabhängigkeit, sondern auch der eingeschätzte Arbeitsaufwand verstanden, der benötigt würde, um ein Programm in ein plattformübergreifendes umzuwandeln. Dieser Vorgang wird auch Portierung oder Migration genannt.\n\n\n== Formen ==\nEs gibt verschiedene Formen von Plattformunabhängigkeit:\n\nWebanwendungen, welche vom Browser ausgeführt werden.\nHierbei ist das Betriebssystem egal, es muss nur über einen bestimmte Voraussetzungen erfüllenden Webbrowser verfügen.\nHybrid-Apps\nAnwendungen, die unabhängig von der Plattform auf unterschiedlichen Betriebssystemen und unterschiedlichen mobilen Endgerät ausgeführt werden können.\nMulti-Channel-Apps\nAnwendungen, die unabhängig von Endgerät und Betriebssystem ausgeführt werden können. Diese Geräte können sowohl mobil als auch, im Unterschied zu den Hybrid-Apps, stationär sein.\nIn Zwischencode vorliegende Software\nProgramme, die entweder in Form von Bytecode, wie hauptsächlich Java-Programme, oder eines portablen, interpretierbaren Quellcodes (Python, Perl, PHP und andere) vorliegen.\nFat Binaries und Universal Binaries\nProgrammpakete, die mehrere lauffähige Versionen enthalten. Das Betriebssystem startet ohne Zutun des Anwenders die passende Version. Beispiele für „fat binaries“ sind das OpenStep-Programmformat und die „fat binaries“ unter Mac OS, die sowohl auf Motorola-680x0-basierten Apple-Rechnern als auch auf PowerPC-Macs ausführbar sind. Universal Binaries unter macOS laufen sowohl auf PowerPC als auch auf x86-32-Bit oder x86-64-Bit. Voraussetzung dafür, dass eine „fat binary“ überhaupt erstellt werden kann, ist die Portabilität des Quellcodes, insbesondere bezüglich der Byte-Reihenfolge (endianness) und der Länge einer Zeigervariable.\nQuellcode-Portabilität\nDiese Form der Plattformunabhängigkeit ist häufig bei C-Programmen für Unix anzutreffen: Der Quellcode enthält Anweisungen, die es erlauben, die Betriebssystemunterschiede auszugleichen. Es existieren reichlich Hilfsmittel zu diesem Zweck, wie zum Beispiel GNU Autoconf. Eine weitere Möglichkeit ist die Verwendung systemunabhängiger Bibliotheken, wie Qt und GTK+. Viele im Quellcode portable Programme stehen bereits in vorgefertigten Versionen plattformübergreifend bereit.\nEingeschränkte Plattformunabhängigkeit\nist gegeben, wenn zum Beispiel das Programm nur auf einem bestimmten Prozessortyp lauffähig ist, aber auf ansonsten verschiedenen Hardware-Architekturen. Dies ist häufig bei in Assemblersprachen geschriebenen Programmen der Fall, wie man sie in den frühen Zeiten der Microcomputer unter CP/M oft antraf; heute wird Assemblersprache meist nur noch für besonders zeitkritische Programmstellen verwendet, und zwecks Plattformunabhängigkeit ist meist noch eine hochsprachliche Version der gleichen Programmfunktionen beigegeben. Auch Programme, die unabhängig vom CPU-Typ nur auf einer bestimmten Betriebssystem-Familie funktionieren sind eingeschränkt plattformunabhängig.Im Server-Bereich, wo schon sehr früh mit virtuellen Maschinen und virtuellen CPUs gearbeitet wurde, sieht es beim Thema Plattformunabhängigkeit etwas anders aus, als man es von klassischen Unix-/Linux-Portierungen her kennt – letztere fassen zwar zunehmend im Desktop-Bereich Fuß, verursachen durch die starke Ausrichtung auf x86-PCs in Sachen Plattformunabhängigkeit allerdings oftmals eher mehr Kopfzerbrechen als klassische Unix-Anwendungen.\nHeute wird eine relative Plattformunabhängigkeit am häufigsten durch die Verwendung von Laufzeitumgebungen von Sprachen wie Java oder .NET erzielt. Allerdings wird diese scheinbare Unabhängigkeit wiederum durch eine Abhängigkeit von der Laufzeitumgebung erkauft, die nunmehr im Kern die Plattform ist.\nAllerdings trifft der Begriff „Portabilität“ in beiden Fällen nicht den Kern der Sache, da es sich von Beginn an um plattformunabhängige Konzepte handelte – also auch alle APIs auf jedem Zielsystem im Vorhinein so nachgebildet werden müssen, dass die Software zwangsläufig lauffähig ist. Ansonsten wäre beispielsweise eine Java VM nicht zertifizierungsfähig.\nDie Laufzeitumgebungen selbst sind auch nicht auf jeder Plattform verfügbar, was zum Beispiel im Fall von .NET zu Entwicklungen wie der des Mono-Projektes geführt hat. Portierungen sind aus lizenz- oder patentrechtlichen Gründen meist gar nicht möglich, daher kann man ebenso nur von einer Form von eingeschränkter Plattformunabhängigkeit sprechen.\n\n\n== Portabilitätsmetriken ==\nDie Portabilität kann zum Beispiel geschätzt werden über: P = 1−(Ü+A)/E\nÜ Übertragungsaufwand (insbesondere Neukompilierung)\nA Anpassungsaufwand (Änderung des Quellcodes z. B. bei Austausch von Betriebssystemschnittstellen)\nE Entwicklungsaufwand für NeuentwicklungDabei entspricht eine Portabilität von 1 der Kompatibilität, das Programm ist also ohne Änderung auf dem Zielsystem lauffähig; liegt Quellcode-Portabilität vor, ist in der Regel ein Ergebnis von > 90 % zu erwarten; wohingegen eine Portabilität nahe 0 eine Neuentwicklung des Programmes nahelegt.\nPortabilität ist kein Maß für die Lauffähigkeit eines Programmes auf der Zielplattform, d. h. selbst eine Portabilität von 99 % bedeutet nicht unbedingt, dass das Programm nutzbar ist, es bedeutet lediglich, dass eine Portierung im Vergleich zu einer Neuentwicklung deutlich weniger Aufwand erfordert.\n\n\n== Weblinks ==\n\nPlattformunabhängigkeit – Seite bei e-teaching.org; Stand: 21. Februar 2011\n\n\n== Einzelnachweise ==", "Programmierung (von altgriechisch πρόγραμμα prógramma „öffentlich und schriftlich bekannt gemachte Nachricht, Befehl“) bezeichnet die Tätigkeit, Computerprogramme zu erstellen. Das ist ein Teilbereich der Softwareentwicklung.Computerprogramme werden mit Hilfe einer Programmiersprache formuliert („codiert“). Der Programmierer ‚übersetzt‘ dabei die vorgegebenen Anforderungen (z. B. im Pflichtenheft) und Algorithmen in eine gewünschte Programmiersprache. Teilweise werden dazu Codegeneratoren verwendet, die Teile des Programmcodes auf Basis von Modellen (die im Entwurf entstanden sind) automatisch erzeugen.\nBeim Programmieren sind wesentliche Aspekte zur Softwarequalität zu berücksichtigen und durch die Gestaltung des Quellcodes umzusetzen. Siehe dazu als Beispiele: Programmierstil, Benutzerfreundlichkeit, Wiederverwendbarkeit/Modularität, Wartbarkeit.\n‚Programmieren‘ in erweitertem Sinn umfasst neben der Codeerstellung zahlreiche weitere Tätigkeiten, zum Beispiel das Testen (Entwicklertest) des Programms oder das Erstellen der Programmierdokumentation. Abgrenzen vom Begriff des Programmierens lassen sich andere Tätigkeiten zur Softwareentwicklung wie beispielsweise zum Projektmanagement, zur Anforderungsanalyse oder zur Datenmodellierung.\nJe nach angewendetem Vorgehensmodell verlaufen die Aktivitäten zur Programmierung in zeitlich voneinander abgegrenzten Projektphasen, parallel oder iterativ. In der Praxis geschieht das Programmieren häufig in Teamarbeit, mit modernen Entwicklungsmethoden (wie Agile Softwareentwicklung) und Programmierwerkzeugen.\nÄhnliche Bedeutungen: Umgangssprachlich bezeichnet man gelegentlich auch das Konfigurieren von Haushalts- oder anderer elektrischer Geräte als „Programmieren“. Auch Organisationseinheiten von Unternehmen, in denen Software entwickelt wird, werden oder wurden zum Teil „Programmierung“ genannt.\n\n\n== Geschichte ==\n\nCharles Babbage beschrieb 1834 eine programmierbare Maschine, die Analytical Engine, welche allerdings nie gebaut wurde. Ada Lovelace übersetzte 1843 eine ursprünglich französische Beschreibung der Analytical Engine von Federico Luigi Menabrea ins Englische und fügte eigene Notizen hinzu. Diese Anmerkungen enthielten einen tabellarischen Plan zur Berechnung der Bernoulli-Zahlen, was als das erste Programm bezeichnet wird. 1941 realisierte Konrad Zuse mit dem Z3 die erste programmgesteuerte Rechenmaschine, von 1942 an entwickelte er mit Plankalkül die erste höhere Programmiersprache. Die Mathematikerin Grace Hopper schuf 1949 den ersten Compiler, der Quellcode in Maschinencode übersetzt.\n\n\n== Qualitätskriterien ==\n\nDie Qualität von Software entsteht zu großen Teilen im Rahmen der Tätigkeiten des Programmierens, besonders die folgenden Qualitätskriterien betreffend:\n\n\n=== Korrektheit ===\n\nEin Programm muss die im Entwurf gemachten Vorgaben korrekt umsetzen. Dazu muss es in der Regel fehlerfrei sein, wobei beim Programmieren meist zwei verschiedene Arten von Fehlern auftreten:\n\nSyntaxfehler: Fehlerhaft formulierter Quellcode – man verwendet Formulierungen oder Konstrukte, die so nicht in der verwendeten Programmiersprache vorkommen (Tippfehler, Unkenntnis, …). Syntaxfehler können beim Übersetzen vom Compiler/Interpreter oder Parser erkannt werden und verhindern i. d. R. die Programmausführung.\nSemantische Fehler: Das Programm verhält sich nicht wie gewünscht, weil möglicherweise der Algorithmus oder seine Umsetzung fehlerhaft war. Semantische Fehler können in der Regel nicht automatisch erkannt, sondern nur durch gewissenhaftes Testen gefunden werden – beispielsweise in Form von Unittests.Der Übergang zwischen diesen beiden Fehlerarten ist fließend. Beispielsweise wird ein Tippfehler im Code (z. B. „>“ anstatt „<“ in einem Vergleichsbefehl) zu einem gültigen ausführbaren Programm führen, das Resultat dürfte jedoch falsch sein. An anderer Stelle könnte derselbe Fehler ein Syntaxfehler sein.\n\n\n=== Robustheit ===\nStatistisch gesehen wird die meiste Zeit für die Entwicklung von Quelltext benötigt, um auf Fehler oder außergewöhnliche Anwendungs- oder Hardwareumgebungen zu reagieren. Ein Programmtext, der auch bei unvorhergesehenen Fehlern oder ungewöhnlichen Umgebungen sinnvoll reagiert, wird als robust bzw. portabel bezeichnet. Geübte Programmierer können die möglichen Fehler und Laufzeitumgebungen gut einschätzen und strukturieren das Programm und seinen Quelltext dementsprechend. Der Zeitdruck bei der Entwicklung von Anwendungen stellt selbst an erfahrene Programmierer immer höchste Ansprüche hinsichtlich dieses Kriteriums.\n\n\n=== Wartbarkeit ===\nDamit eine Software dauerhaft funktioniert, muss sie wartbar sein. Das heißt, Änderungen wie Bugfixes, Anpassungen und neue Features müssen ohne großen Aufwand eingepflegt werden können. Dies erfordert vor allem, dass der Programmierer keinen zu kurzen, „kryptischen“ Quelltext (oder Quellcode) erzeugen soll, der für andere Entwickler nicht oder nur mit hoher Einarbeitungszeit verständlich ist.\nUm solche Probleme zu vermeiden, existieren häufig Namenskonventionen, in denen beispielsweise selbsterklärende (oder auch „sprechende“) Bezeichner/Namen für Variablen etc. zur Verwendung empfohlen/vorgeschrieben werden – oder die Verwendung aussagefähiger Kommentare im Code. Auch eine sinnvolle Aufteilung des Codes in intuitiv verständliche Funktionen und Klassen trägt zum Verständnis und Übersichtlichkeit bei.\n\n\n=== Effizienz ===\nIn der Regel stehen einem Programm nur begrenzte Ressourcen (Laufzeit, Speicherverbrauch, Bandbreite) zur Verfügung. Gute Programmierung kann dazu beitragen, unnötigen Ressourcenverbrauch zu reduzieren. Beispielsweise erfolgt dies, indem bei Verwendung großer Datenmengen an mehreren Stellen im Programm nicht jeweils der gesamte Datensatz kopiert wird, sondern nur die Adresse übertragen wird, an der die Daten gespeichert werden.\n\n\n== Effiziente Programmierung ==\nGemäß Niklaus Wirth zeichnet sich gute Programmierung zum einen dadurch aus, dass die Funktionen, die die jeweils verwendete Programmierumgebung bereitstellt, möglichst effizient genutzt werden. Insbesondere geht es darum, für neue Aufgabenstellungen das Rad nicht immer wieder neu zu erfinden, wenn bestimmte Funktionen schon bereitgestellt werden (zum Beispiel durch die Programmierumgebung in Form von Programmbibliotheken). Sie zeichnet sich also vor allem dadurch aus, dass ein guter Überblick über den grundsätzlichen Funktionsumfang und die Systematik der von der Programmierumgebung bereitgestellten Funktionen (die in die zehntausende gehen können) möglich ist. Für eine definierte Aufgabenstellung kann in entsprechenden Dokumentationen dann schnell eine verfügbare Funktion ermittelt, eingesetzt und ggf. erweitert werden.\n\n\n== Arbeitsmittel ==\n\nTheoretisch reichen zum Programmieren ein einfacher Texteditor und ein Compiler/Interpreter für die jeweilige Programmiersprache aus. In der Praxis wird jedoch zusätzlich auf eine Reihe von Werkzeugen zurückgegriffen, die typische Programmierarbeiten vereinfachen sollen. Dazu gehören beispielsweise Texteditoren mit speziellen Features wie Syntax-Highlighting, Autovervollständigen und Refactoring – wobei der Übergang zur Integrierten Entwicklungsumgebung (IDE) fließend ist.\nDaneben existieren verschiedene Werkzeuge zur Fehlersuche, sog. Debugger, sowie Programme zur Durchführung statischer und dynamischer Tests. Zur Performanzanalyse kann zusätzlich ein Profiler eingesetzt werden.\nArbeiten mehrere Entwickler an derselben Software, kommen meist Versionierungssysteme zum Einsatz, die den Code inklusive früherer Versionen auf einem zentralen Server speichern, auf den alle beteiligten Programmierer Zugriff haben.\n\n\n== Siehe auch ==\nProgrammiergerät\nProgrammierparadigma\n\n\n== Weblinks ==\n\nJoachim Korb: Die Geschichte der Softwareprogrammierung.\nEinführung ins Programmieren (für Neueinsteiger)\nAllgemeine Grundlagen der Programmierung (Online-Buch)\n\n\n== Einzelnachweise ==", "Ein Patch (Maskulinum, selten Neutrum; von engl. to patch = flicken, ausbessern und patch = [aufgesetzter] Flicken, Flickwerk in der Bedeutung von Reparatur bzw. Nachbesserung) ist eine Korrekturauslieferung für Software oder Daten aus Endanwendersicht, um Fehler zu beheben – meist um bekannt gewordene Sicherheitslücken zu schließen – oder bislang nicht vorhandene Funktionen nachzurüsten. Teilweise werden auch Änderungen an einer Software ohne Wissen der Käufer oder Nutzer installiert. Bei einigen Herstellern, wie etwa Microsoft (Windows), heißen diese Nachbesserungen gerne Aktualisierungen und Service Pack, wenn sie aus sehr vielen zusammengefassten Patches (nach teils wöchentlichen Patch days) bestehen. Der Begriff war bereits zu einer Zeit gebräuchlich, als Korrekturen an (minimaler) Software noch auf Lochkarten durch Stanzen beziehungsweise Zukleben einzelner Löcher bewerkstelligt werden konnten.\n\n\n== Abgrenzung ==\nEin Patch ist eine Fehlerbehebung für ausführbare Programme beziehungsweise Betriebssysteme und kann auch kleinere Funktionserweiterungen enthalten. Er wird meist zeitlich begrenzt angeboten.\n\nEin Bugfix behebt Fehler im Programm-Quellcode, die Fehlfunktionen hervorrufen können.\nEin Hotfix ist eine besonders wichtige, sehr dringende Fehlerbehebung für ausführbare Programme beziehungsweise Betriebssysteme.\nEine Aktualisierung (englisch Update) verändert den bestehenden Funktionsumfang von ausführbaren Programmen und enthält oft auch Fehlerbereinigungen.\n\n\n== Ziele für Patches ==\n\n\n=== Patch für Binärprogramme ===\nEin Patch für ein Binärprogramm ersetzt in der Regel eine oder mehrere Dateien durch eine neue Version. Patches für Binärprogramme werden meist von Herstellern proprietärer Software für ihre eigenen Programme veröffentlicht. Verbreitet sind Patches für Binärprogramme auch unter Softwarepiraten. Hier wird mit einem Patch meist ein Kopierschutz umgangen. Auch in der Computerspieleszene sind Patches verbreitet, um Spiele zu modifizieren.\nFür Programme (oder seltener Betriebssysteme) werden auch Aktualisierungen per Internet angeboten, die heruntergeladen und eingespielt werden können.  \nZu Zeiten des Betriebssystems CP/M waren Bildschirm- und Druckersteuerung noch nicht Teil des Betriebssystems selbst. Die Anpassung in Form von Escape-Sequenzen oder kleinen Maschinenprogrammen musste daher im Code des Anwenderprogramms vorgenommen werden, der dazu bereits reservierte Patch-Bereiche vorsah. Beispiele dafür sind WordStar, dBASE und SuperCalc. Das Patchen wurde meist mit Hilfe eines Debuggers vorgenommen.\n\n\n=== Patch für Quellcode ===\nEin Patch für Quellcode enthält nur die geänderten Zeilen im Programmcode. Am weitesten verbreitet sind die Formate „Context-diff“ und „Unified-diff“. Diese Patches dienen dazu, die Änderungen zu dokumentieren und kommunizieren. Patches sind ein essenzieller Bestandteil der Softwareentwicklung.\nUnter Unix werden Programmcode-Patches mit dem Programm diff erzeugt. Mit dem Programm patch, ursprünglich von Larry Wall geschrieben, kann man einen Patch automatisch einspielen.\nDie meisten verbreiteten Versionsverwaltungssysteme benutzen Patches, um Änderungen zwischen Dateiversionen festzuhalten.\n\n\n== Patch-Pakete ==\nOft fassen die Hersteller mehrere Patches zu einem „Paket“ zusammen, welches der Administrator insgesamt installieren sollte. Diese Pakete haben je nach Hersteller unterschiedliche Bezeichnungen. Auch unterscheidet man zwischen kumulierten (oft auch als kumulativ bezeichnet) Paketen und nicht-kumulierten Paketen. Bei kumulierten Paketen muss nur das neueste installiert werden, weil es die Patches der vorherigen Pakete enthält. Bei nicht-kumulierten Paketen muss man alle Pakete in der richtigen Reihenfolge installieren.\nBeispiele:\n\nHewlett-Packard: Patchkits für Tru64 UNIX, kumuliert\nMicrosoft: Service Packs für Windows, kumuliert\nSAP: Support Packages für SAP R/3, nicht-kumuliert\nSun Microsystems: Patch Clusters für Solaris, kumuliert\nOracle: Patchsets, kumuliert\n\n\n== Herkunft ==\nPatches werden nicht nur durch den ursprünglichen Softwarehersteller erstellt, sondern manchmal auch von Dritten mit unterschiedlicher Motivation.\n\n\n=== Crack ===\n\nEin Patch mit dem Zweck der Umgehung von Einschränkungen oder Sperren, wird als „Crack“ bezeichnet. Dabei wird der Binärcode eines meist kommerziellen Programms z. B. zur Schonung der empfindlichen Original-CD derart verändert, dass dieses danach ohne Kopierschutz funktioniert. Diese Änderung ist in den meisten Ländern verboten (siehe auch: Rechtliche Lage von Software-Cracks).\n\n\n=== Community Patch ===\n\nEine Software wird durch den ursprünglichen Hersteller und Rechthalter nicht mehr nachgebessert, gepflegt, wenn der Support beendet wurde, ein Nachfolgeprodukt vertrieben wird oder die Firma nicht mehr existiert.\nIn diesen Fällen kann es vorkommen, dass die Nutzergemeinde versucht, die Pflege der Software mit Patches aufrechtzuerhalten, wenn dies nicht aus lizenzrechtlichen Gründen untersagt wird.\n\n\n== Siehe auch ==\nPatchday\nMicrosoft Update Service, Update-Rollup\nHotfix\nPatch (Unix)\nKernel Live Patching\nLebensende einer Software (EOL)\n\n\n== Einzelnachweise ==", "Iteration (von lateinisch iterare ,wiederholen‘) beschreibt allgemein einen Prozess mehrfachen Wiederholens gleicher oder ähnlicher Handlungen zur Annäherung an eine Lösung oder ein bestimmtes Ziel. Mit dieser Bedeutung erstmals in der Mathematik verwendet, ist der Begriff heute in verschiedenen Bereichen mit ähnlicher Bedeutung in Gebrauch. Beispielsweise in der Informatik wird nicht nur der Prozess der Wiederholung, sondern auch das Wiederholte selbst als Iteration bezeichnet. In anderen Bereichen beschränkt sich die Bedeutung wie im lateinischen Ausgangswort auf das Wiederholen, beispielsweise in der Linguistik.\n\n\n== Dynamische Systeme ==\nIn der Mathematik, insbesondere in der Theorie der dynamischen Systeme, bezeichnet man als Iteration die wiederholte Anwendung derselben Funktion, also die Bildung (Komposition) von\n\n  \n    \n      \n        \n          f\n          \n            n\n          \n        \n        :=\n        \n          \n            \n              \n                f\n                ∘\n                f\n                ∘\n                ⋯\n                ∘\n                f\n              \n              ⏟\n            \n          \n          \n            n\n            \n               mal\n            \n          \n        \n      \n    \n    {\\displaystyle f^{n}:=\\underbrace {f\\circ f\\circ \\dotsb \\circ f} _{n{\\text{ mal}}}}\n  für eine gegebene Funktion \n  \n    \n      \n        f\n        :\n        X\n        →\n        X\n      \n    \n    {\\displaystyle f\\colon X\\to X}\n   auf einer Menge (einem Raum) \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n  .\nDie Theorie der dynamischen Systeme befasst sich insbesondere mit dem Langzeitverhalten der Orbits \n  \n    \n      \n        \n          {\n          \n            \n              f\n              \n                n\n              \n            \n            (\n            x\n            )\n          \n          }\n        \n      \n    \n    {\\displaystyle \\left\\{f^{n}(x)\\right\\}}\n   von Punkten \n  \n    \n      \n        x\n        ∈\n        X\n      \n    \n    {\\displaystyle x\\in X}\n   unter solchen Iterationen.\n\n\n=== Beispiel ===\nMan betrachte die quadratische Funktion \n  \n    \n      \n        f\n        :\n        \n          R\n        \n        →\n        \n          R\n        \n      \n    \n    {\\displaystyle f\\colon \\mathbb {R} \\to \\mathbb {R} }\n  \n\n  \n    \n      \n        f\n        (\n        x\n        )\n        =\n        \n          x\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle f(x)=x^{2}}\n  .Dann ist \n  \n    \n      \n        \n          f\n          \n            n\n          \n        \n        (\n        x\n        )\n        =\n        \n          x\n          \n            \n              2\n              \n                n\n              \n            \n          \n        \n      \n    \n    {\\displaystyle f^{n}(x)=x^{2^{n}}}\n   (nicht zu verwechseln mit \n  \n    \n      \n        (\n        f\n        (\n        x\n        )\n        \n          )\n          \n            n\n          \n        \n        =\n        \n          x\n          \n            2\n            n\n          \n        \n      \n    \n    {\\displaystyle (f(x))^{n}=x^{2n}}\n  ) und man kann das Langzeitverhalten unterschiedlicher Orbits untersuchen: für \n  \n    \n      \n        |\n        x\n        |\n        <\n        1\n      \n    \n    {\\displaystyle \\vert x\\vert <1}\n   konvergiert \n  \n    \n      \n        \n          f\n          \n            n\n          \n        \n        (\n        x\n        )\n      \n    \n    {\\displaystyle f^{n}(x)}\n   gegen den Fixpunkt 0, für \n  \n    \n      \n        x\n        >\n        1\n      \n    \n    {\\displaystyle x>1}\n   gilt \n  \n    \n      \n        \n          lim\n          \n            n\n            →\n            ∞\n          \n        \n        \n          f\n          \n            n\n          \n        \n        (\n        x\n        )\n        =\n        ∞\n      \n    \n    {\\displaystyle \\lim _{n\\to \\infty }f^{n}(x)=\\infty }\n  , für \n  \n    \n      \n        x\n        =\n        1\n      \n    \n    {\\displaystyle x=1}\n   ist die Folge konstant und auch für \n  \n    \n      \n        x\n        =\n        −\n        1\n      \n    \n    {\\displaystyle x=-1}\n   bleibt die Folge ab der ersten Iteration konstant.\n\n\n=== Andere Schreibweise ===\nWegen der genannten Verwechslungsmöglichkeit finden sich in der Literatur gelegentlich die Schreibweisen\n\nDann sind beispielsweise\n\nder Sinusfunktion.\n\n\n== Numerische Mathematik ==\n\nIn der numerischen Mathematik bezeichnet Iteration eine Methode, sich der exakten Lösung eines Rechenproblems schrittweise anzunähern (sukzessive Approximation). Sie besteht in der wiederholten Anwendung desselben Rechenverfahrens.\nDie Ergebnisse eines Schrittes werden als Ausgangswerte des jeweils nächsten Schrittes genommen. Die Folge der Ergebnisse muss konvergieren. Wenn die Differenz zum vorangegangenen Rechenschritt kleiner als der akzeptierte Fehler ist, dann ist das Ergebnis hinreichend genau bestimmt, und das Verfahren wird beendet. Eines der bekanntesten Beispiele ist das Newton-Verfahren. Manchmal setzt man im nächsten Schritt Ergebnisse aus zwei oder noch mehr vorangehenden Schritten an, zum Beispiel bei der Regula falsi.\nDie Konvergenzgeschwindigkeit ist ein Maß dafür, wie brauchbar die Iterationsmethode ist.\n\n\n=== Anwendung der Methode ===\nIteration wird in Fällen angewandt, in denen das Ergebnis sich nicht in geschlossener Form berechnen lässt, zum Beispiel bei der Kepler-Gleichung, der Berechnung der Oberflächenform einer asphärischen Linse oder der Wärmeverteilung auf einer Leiterplatte.\nLineare Gleichungssysteme lassen sich unter bestimmten Voraussetzungen iterativ lösen.\nBei Anwendungsproblemen können die Eingabedaten fehlerbehaftet sein, dann ist die „exakte Lösung“ des gegebenen Problems nicht notwendigerweise besser als ihre Approximation. Das Iterationsverfahren wird bevorzugt, wenn es eine gute Näherung schneller liefert, als die Berechnung der exakten Lösung braucht.\nManche Funktionen auf Taschenrechnern oder auch Fraktale werden iterativ berechnet.\n\n\n=== Beispiel: Bestimmung von Nullstellen einer stetigen Funktion ===\nApproximationen an Nullstellen einer stetigen Funktion sind, sofern überhaupt eine existiert, iterativ oft rascher gefunden als durch andere algebraische Methoden (etwa als geschlossener Ausdruck):\n\nMan wählt zwei Näherungswerte \n  \n    \n      \n        \n          x\n          \n            1\n          \n        \n        ,\n        \n        \n          x\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle x_{1},\\,x_{2}}\n   für die Nullstelle der Funktion \n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n   und zwar so, dass \n  \n    \n      \n        f\n        (\n        \n          x\n          \n            1\n          \n        \n        )\n        ⋅\n        f\n        (\n        \n          x\n          \n            2\n          \n        \n        )\n        <\n        0\n      \n    \n    {\\displaystyle f(x_{1})\\cdot f(x_{2})<0}\n   ist.\nMan stellt die Gleichung der durch \n  \n    \n      \n        (\n        \n          x\n          \n            1\n          \n        \n        ;\n        f\n        (\n        \n          x\n          \n            1\n          \n        \n        )\n        )\n      \n    \n    {\\displaystyle (x_{1};f(x_{1}))}\n   und \n  \n    \n      \n        (\n        \n          x\n          \n            2\n          \n        \n        ;\n        f\n        (\n        \n          x\n          \n            2\n          \n        \n        )\n        )\n      \n    \n    {\\displaystyle (x_{2};f(x_{2}))}\n   gegebenen Sekante auf.\nDie Schnittstelle \n  \n    \n      \n        \n          x\n          \n            3\n          \n        \n        =\n        \n          x\n          \n            1\n          \n        \n        −\n        \n          \n            \n              \n                x\n                \n                  2\n                \n              \n              −\n              \n                x\n                \n                  1\n                \n              \n            \n            \n              f\n              (\n              \n                x\n                \n                  2\n                \n              \n              )\n              −\n              f\n              (\n              \n                x\n                \n                  1\n                \n              \n              )\n            \n          \n        \n        ⋅\n        f\n        (\n        \n          x\n          \n            1\n          \n        \n        )\n      \n    \n    {\\displaystyle x_{3}=x_{1}-{\\frac {x_{2}-x_{1}}{f(x_{2})-f(x_{1})}}\\cdot f(x_{1})}\n   der Sekante mit der x-Achse ist dann ein „besserer“ Näherungswert für die gesuchte Nullstelle von \n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n  .\nMan wiederholt die beiden vorgenannten Schritte so lange, bis die Nullstelle mit gewünschter Genauigkeit gefunden ist (Regula falsi).\n\n\n== Informatik ==\nNeben der mathematischen iterativen Problemlösung wird in der Informatik auch von Iteration gesprochen, wenn\n\nein Zugriff auf Daten einer Datenstruktur Schritt um Schritt (gleichartig wiederholt) erfolgt, beispielsweise mittels einer FOREACH-Schleife.Ein spezieller Zeiger auf die Einzelobjekte nennt sich Iterator, wenn er (meist automatisch) nach jedem Zugriff auf das nächste Datum/Objekt der Datenstruktur weiterschaltet.\nein Anweisungsblock (der sogenannte „Schleifenrumpf“) – durch Schleifenkontrollanweisungen gesteuert – wiederholt ausgeführt wird; jede Ausführung ist eine Iteration der Schleife. Diese Art der Programmierung wird als iterative Programmierung bezeichnet.Sie steht im Gegensatz vor allem zur rekursiven Programmierung, bei der der Anweisungsblock in eine Prozedur gesteckt wird und seine Wiederholungen durch rekursive (Selbst-)Aufrufe formuliert werden.\n\n\n== Linguistik ==\nSprachwissenschaftlich bezeichnet iterativ die Aktionsart eines Verbs, das ein aus mehrfach wiederholten gleichartigen Vorgängen bestehendes Geschehen ausdrückt, z. B. von flattern, krabbeln oder sticheln. Solche Wiederholungsverben werden auch Iterativa genannt.\nBei einer Wortbildung wird von Iteration gesprochen, wenn gleiche oder ähnliche Wortteile zwei- oder mehrfach wiederholt werden, so beispielsweise in Ururgroßmutter (siehe auch Reduplikation bzw. Triplikation).\n\n\n== Softwaretechnik ==\nIn der Softwaretechnik bezeichnet eine Iteration einen einzelnen Entwicklungszyklus, je nach Vorgehensmodell beginnend mit Planung, Analyse oder Entwurf, endend mit Implementierung, Test oder Wartung. Eine besondere Rolle spielen Iterationen beim Extreme Programming und beim Rational Unified Process. Bei Scrum (Agiles Projektmanagement) kommt oft ein iterativer Prozess für die Entwicklung von Software zum Einsatz. Man spricht hier von Feedback-Schleifen in allen Phasen der Planung, Durchführung, Überprüfung und Anpassung.\n\n\n== Geschichtswissenschaft ==\nIn der Geschichtswissenschaft bezeichnet Iteration die wiederholte Ausübung desselben Amtes in der Ämterlaufbahn der römischen Republik. Nach dem Mos maiorum war die Iteration verpönt. Beim Konsulat kam die mehrfache, in Ausnahmefällen auch unmittelbar aufeinander folgende Bekleidung des Amtes allerdings schon seit der frühen Republik vor; seit der Verfassungsreform des Diktators Sulla aus dem Jahr 82 v. Chr. war die wiederholte Bekleidung des Konsulats erst nach zehn Jahren erlaubt. Das Iterationsverbot war neben dem Kollegialitäts- und dem Annuitätsprinzip das wichtigste Mittel, eine gefährliche Machtfülle von Amtsträgern zu verhüten.\nInsbesondere in der Krise der Republik kam die Iteration wiederholt vor: Bekannteste Beispiele sind Gaius Sempronius Gracchus, der sich in drei Jahren hintereinander zum Volkstribunen wählen lassen wollte, Gaius Marius, der das Konsulat in fünf aufeinanderfolgenden Jahren (104 bis 100 v. Chr.) und insgesamt sieben Mal ausübte, sowie Gaius Iulius Caesar, der das Konsulat in den Jahren 59, 48, 46, 45 und 44 v. Chr. bekleidete. In der Kaiserzeit ab Augustus war die Iteration des Konsulats Zeichen für eine herausgehobene soziopolitische Stellung. Unmittelbar aufeinanderfolgende Konsulate gab es nur bei Angehörigen des Kaiserhauses.\n\n\n== Philosophie ==\nJacques Derrida führte die Iteration in die Sprache der Philosophie ein. „Iteration“ bezeichnet hier die Wiederholung eines Begriffs im philosophischen und gesellschaftlichen Diskurs. Laut Derrida verändert sich mit jeder Wiederholung (Iteration) eines Begriffs seine Bedeutung, so dass niemals dieselbe Bedeutung reproduziert wird wie beim vorausgehenden Gebrauch des Begriffs. Jede Iteration hat vielmehr eine Variation der Bedeutung zur Folge, die dem ursprünglichen Begriff etwas hinzufügt und ihn bereichert. Eine ursprüngliche Definition von Begriffen, auf die man ihre Bedeutung zurückführen könnte, kann es demnach nicht geben.\n\n\n== Bauökonomie ==\nIn der Bauökonomie ist ein iterativer Prozess das schrittweise Annähern von ursprünglichen Bauzielen an die machbare Umsetzung.\n\n\n== Konstruktionslehre ==\nIn der Konstruktionslehre spricht man von iterativem Vorgehen, teilweise auch von iterativem Suchen, wenn zur Lösungsfindung so vorgegangen wird, dass ausgehend von einer Eingebung des Konstrukteurs die Lösung schrittweise verbessert wird.\n\n\n== Management ==\nIm Management ist Iteration eine Vorgehensweise, um mit den Ungewissheiten und Überraschungen in komplexen Situationen umzugehen. Bei Veränderungen ist der Verlauf von Projekten oder die Wirkung von Handlungen nicht immer prognostizierbar. Jedes Veränderungsmanagement als „großen Plan“ mit unverrückbaren Zielen aufzufassen, führt in den meisten Fällen zu Überraschungen, auf die die Planer und Umsetzer nicht vorbereitet sind. Das bedeutet nicht, Pläne aufzugeben, sondern sich im eigenen Vorgehen immer nur vorläufig sicher zu sein. Linear-kausales Projektdenken wird durch iteratives Vorgehen abgelöst: Durch Vorantasten entlang Zwecken, Interessen und Machtkonstellationen wird nach und nach Unklarheit abgebaut, Akzeptanz erreicht, Wirkung erzeugt und Routine etabliert. Die Reihenfolge der Themen und Inhalte ergibt sich erst im Laufe der Veränderung. „An iterative process of initial interpretation and design, implementation and improvisation, learning from change-effort, and then sharing that learning systemwide, leading to ongoing re-interpretation and redesign of the change as needed.“ (Anthony F. Buono / Kenneth W. Kerber: Building Organizational Change Capacity).\n\n\n== Weblinks ==\n\n\n== Einzelnachweise =="]