["Trampen, gelegentlich auch Autostopp oder per Anhalter fahren (englisch hitchhiking), ist die in der Regel kostenlose Mitreise in einem fremden Kraftfahrzeug. Die Mitfahrt selbst bezeichnet man u. a. als Lift (britisches Englisch) oder Ride (amerikanisches Englisch).\nDie englische Sinnentsprechung zum deutschen trampen ist das Verb to hitchhike. Mit einem Tramp meint man auf Englisch eher einen Wanderarbeiter.\n\n\n== Prinzip ==\n\nDer Anhalter signalisiert seinen Mitfahrwunsch am Straßenrand in der Regel durch einen nach oben gestreckten Daumen. Oft werden vorbeifahrenden Kraftfahrzeugen auch beschriftete Schilder mit dem gewünschten Reiseziel entgegengehalten. Jedoch auch die Kraftfahrer können dem Tramper gewisse Informationen übermitteln; befindet sich der Tramper noch innerorts und deutet der Kraftfahrer mehrfach auf sein Lenkrad, so bedeutet das, dass er nicht aus dem Ort herausfährt. Eine weitere Möglichkeit für die Mitnahme ist es, die Fahrer der Kraftfahrzeuge bei passenden Gelegenheiten direkt anzusprechen; dies kann beispielsweise bei Tankstellen oder auf Autobahnraststätten erfolgen. In den Niederlanden gibt es spezielle, durch Schilder ausgewiesene Stellen für Tramper, die Liftershalte, die mit einer Haltebucht versehen sind und so problemloses Halten ermöglichen.\nNeben dem Trampen per Auto hat auch das Schiffstrampen eine gewisse Verbreitung gefunden.\n\n\n=== Umweltfreundliches Reisen ===\n\nDa das Fahren per Anhalter nur geringfügig zusätzliche Abgase erzeugt, ist diese Form des Reisens sehr umweltfreundlich. Durch das Trampen werden vorhandene Kapazitäten besser genutzt. Wenn in allen Autos alle Sitzplätze gefüllt wären, dann wäre die Zahl der Autos auf den Straßen deutlich geringer. Die Fahrzeuge, die genutzt werden, fahren in der Regel ohnehin. Somit entstehen durch das zusätzliche Gewicht des Trampers und seines Gepäcks nur wenig weitere Schadstoffe und Treibhausgase.\n\n\n=== Sicherheit ===\nEs gibt nur wenige Studien, in denen die Sicherheit des Trampens geprüft wurde. Eine Untersuchung der California Highway Patrol aus dem Jahre 1974 konnte kein höheres Risiko für Anhalter feststellen, Opfer eines Verbrechens zu werden. Eine Studie des Bundeskriminalamts Wiesbaden stellte 1989 fest, dass das tatsächliche Risiko beim Trampen niedriger als allgemein vermutet sei. Die Autoren der Studie rieten daher nicht grundsätzlich vom Trampen ab. Zwar komme es, laut einer Studie zum „Kurztrampen“, in manchen Fällen gegenüber Frauen zu anzüglichen Äußerungen und „dummen Sprüchen“, diesen seien sie jedoch auch im Alltag ausgesetzt. Gewalttaten seien sehr selten. Allerdings kam es seit dieser Zeit zu mehrfachen, medial weit rezipierten Kriminal- und Mordfällen, denen Tramper zum Opfer fielen, dass die Polizei insgesamt Trampen als für nicht empfehlenswert erachtet.Umgekehrt gehen aber auch Autofahrer, die Tramper mitnehmen, ein Risiko ein. Auch Straftäter fahren mal per Anhalter und können die Gelegenheit zum Raub oder zu einem anderen Verbrechen ausnutzen. Im Gegensatz zum Fahrzeug tragen sie kein Kennzeichen und sind somit schwieriger zu ermitteln.\n\n\n== Geschichte ==\n\nIn Deutschland war das Trampen bereits in den 1920er Jahren in der bündischen Jugend als billige Anreise zu Fahrten beliebt. Auch die Bezeichnung Trampen war damals bereits bekannt. So schrieb und komponierte Werner Helwig, Mitglied des Nerother Wandervogels, 1929 das viel gesungene Lied Trampen wir durch Land. Zudem publizierte Helwig 1930 in der Berliner Zeitschrift Der Querschnitt ein Gedicht unter dem Titel Automoral oder die Geistesverhärtung, das eine Art Typologie des angemessenen Trampverhaltens nach Automarken darstellt. Ein Beispiel:\n\nIn den USA wurde in der Mitte des 20. Jahrhunderts auch das illegale Aufspringen auf Güterzüge zur Überwindung großer Entfernungen als trampen („hitchhiking“) bezeichnet, wie es in dem 1957 von Jack Kerouac veröffentlichten und zum Kultbuch avancierten Roman On the Road geschildert wird.\n\nIn den 1960er und 1970er Jahren war das Trampen in vielen Ländern als preisgünstige Möglichkeit des Reisens vor allem unter jungen Menschen der Hippie-Generation besonders weit verbreitet. Das gewisse Abenteuer dieser Reiseform hatte dabei nicht selten einen Anteil an ihrer Attraktivität.\nDie Zahl der Tramper an den Autobahnen und Fernstraßen scheint seitdem (insbesondere aber seit der zweiten Hälfte der 1990er Jahre) stark zurückgegangen zu sein, obwohl das Trampen zur Überwindung kurzer Strecken, wie beispielsweise von einem Dorf in die nächstgelegene Stadt, immer noch häufig genutzt wird.\nDer Rückgang von Trampern in Deutschland ist auf eine höhere Verbreitung von Autos bei Heranwachsenden, die Einführung von Wochenendticket, Anrufsammeltaxis, Online-Mitfahrzentralen, Fernbuslinien und Billigairlines, aber auch den stärkeren Drang nach Sicherheit zurückzuführen. Dies schließt sowohl körperliche Unversehrtheit als auch die Gewissheit pünktlicher Ankunft mit ein. Zum Teil dürfte dies auch auf die Anfang der 1990er Jahre aufkommenden neuen Versicherungsmodelle zurückzuführen sein, bei denen die möglichen Fahrzeuginsassen schon vorher festgelegt werden müssen. Trotzdem funktioniert das Trampen in Deutschland noch ziemlich gut, weil viele Autofahrer, die Anhalter mitnehmen, das Trampen aus ihrer Jugend kennen. Besonders in der DDR war das Trampen verbreitet und als normale Reiseform auch durch Soldaten der NVA angesehen.\nDie Tramper-Bewegung der 1970er und 1980er Jahre war in der DDR vorrangig in der Blueser- oder Kundenszene verbreitet, um der Enge des Alltags zu entfliehen. Hier und in anderen Ostblockländern orientierten sich die Tramper an den Freiheitsidealen der Hippie-Bewegung und wurde von den Regierungen und Staatssicherheitsdiensten dieser Länder dementsprechend als oppositionell eingestuft, da sie nicht dem verordneten Kulturmuster entsprachen und häufig politisch aktiv waren.\n\nIn anderen Ländern, wie z. B. in Irland oder Tschechien, ist das Trampen bis heute noch eine verbreitete Reiseform. Manchmal (aber nicht in den Ländern, wo das Trampen am gängigsten ist, wie gerade in Irland oder Tschechien) ist auch eine Beteiligung an den Fahrtkosten üblich. In Rumänien geben Tramper dem Fahrer als eine Geste der Freundlichkeit ein bisschen Geld, was heutzutage in keinem Verhältnis mehr zu Transportpreisen von Zug oder Bus steht. In Zentralasien ist es sogar die Regel, dass Autofahrer durch die Mitnahme von Fahrgästen etwas dazuverdienen. In Kuba ist das Trampen gesetzlich vorgeschrieben. Das heißt, dass einheimische Autofahrer verpflichtet sind, Tramper mitzunehmen, da die Automobile nicht den einzelnen Menschen, sondern der Gesellschaft gehören.\nDie Deutsche Autostop Gesellschaft Abgefahren e. V. erregte im August 2007 reges Medieninteresse. Der Verein will das Trampen vom Hippie-Mief mit Hilfe des Internets befreien und wieder populärer machen. Er unterstützt diverse Projekte rund um das Thema Trampen und veranstaltet regelmäßig Trampertreffen in Deutschland, sowie seit 2008 eine jährliche deutsche Trampermeisterschaft.Der Roboter Hitchbot trampte u. a. 2014 durch Kanada. Da er sich nicht selbständig bewegen konnte, war er auf die Kooperation von Autofahrern angewiesen, um seine Ziele zu erreichen.\n\n\n== Trampkultur ==\n\nIn Europa gibt es heute eine Vielzahl an Gruppierungen, die sich mit der Förderung des Trampens und auch der Organisation von Rennen, Reisen und Treffen beschäftigen. Auf Internetseiten, teilweise in Wiki-Form, werden Tipps und Tricks zum Trampen an sich oder zu speziellen, zum Ein- und Aussteigen geeigneten Orten gesammelt.\n\n\n== Kommerzielle mediale Nutzung ==\nIn mehreren europäischen Ländern wurde eine Reality TV-Programmreihe namens Peking Express ausgestrahlt, in der sich die von der Kamera begleiteten Teilnehmer schnellstmöglich als Tramper von Europa nach Asien bewegen sollen und ohne lokale Sprachkenntnisse und Wörterbücher auskommen mussten. Dabei mussten sie auch Unterkunft und Essen kostenlos organisieren. \nDer Name des Science-Fiction-Roman Per Anhalter durch die Galaxis spielt auf das Trampen im Weltraum an. In ihm gelangen die Hauptfiguren Arthur und sein Freund Ford nach der Zerstörung der Erde durch das Ausstrecken des Daumens von Ford auf ein außerirdisches Raumschiff und sie erleben von dort an mehrere Abenteuer im Weltraum und versuchen die Zukunft der Menschheit zu retten.\n\n\n== Siehe auch ==\nBahntrampen\nMitfahrgelegenheit\nMitfahrbank\n\n\n== Literatur ==\nThomas Weber; Deutsche Autostop Gesellschaft Abgefahren e. V. (Hrsg.): HiT ThE ROaD: Das Tramper-Taschenbuch. Books on Demand, Norderstedt 2012, ISBN 978-3-8448-0818-6.\nMaiken Nielsen: Trampen: Durch die Welt mit Neugier und Glück, Corso, Hamburg 2011, ISBN 978-3-86260-010-6.\n\n\n== Weblinks ==\n\nDeutsches Tramperwiki\n\n\n== Quellen ==", "Dienstreise (oder Geschäftsreise; englisch business trip, französisch voyage d'affaires) ist eine durch den Beruf bedingte Reise, die vorübergehend außerhalb der regelmäßigen Arbeitsstätte und auch außerhalb der Wohnung stattfindet.\n\n\n== Allgemeines ==\nArbeitskräfte (Arbeiter, Angestellte, Beamte, Beschäftigte, Soldaten, Richter) können häufig ihre Arbeitsleistung nicht ausschließlich am Arbeitsplatz ihrer Arbeitsstätte erbringen, sondern müssen manchmal den Arbeitsort verlassen, um ihre Arbeitspflicht wahrnehmen zu können. Auch der Auslandseinsatz einer Einsatzorganisation (Streitkräfte, aber auch der zivilen Kräfte, wie der Polizei oder Einheiten des Katastrophenschutzes und Rettungsdienstes) außerhalb des eigenen Staates sowie der Lokaltermin der Richter ist eine Dienstreise. Dienst- oder Geschäftsreisen sind damit die Abwesenheit vom Arbeitsplatz aus betrieblichen, beruflichen oder dienstlichen Gründen.Während im öffentlichen Dienst von Dienstreise gesprochen wird, heißt sie in der Privatwirtschaft Geschäftsreise. Bei beiden stellen sich Rechtsfragen hinsichtlich Arbeitszeit, Arbeitsunfall oder Wegeunfall.\n\n\n== Öffentlicher Dienst ==\nIm öffentlichen Dienst gibt es umfangreiche Regelungen zur Dienstreise. Die Dienstreise ist gemäß § 81 Abs. 1 BBG eine dienstlich veranlasste Reise. Das bedeutet, dass ein Dienstvorgesetzter die Dienstreise vor ihrem Beginn anzuordnen oder zu genehmigen hat. Gemäß § 11 Abs. 1 AZV ist bei Dienstreisen die Zeit zur Erledigung von Dienstgeschäften außerhalb der Dienststätte Arbeitszeit. Bei ganz- oder mehrtägigen Dienstreisen gilt die regelmäßige Arbeitszeit des jeweiligen Tages als geleistet. Reisezeiten werden als Arbeitszeit berücksichtigt, soweit sie innerhalb der regelmäßigen täglichen Arbeitszeit anfallen oder die Arbeitszeit innerhalb eines Tages durch Dienstreisen unterbrochen wird. Dienstreisen sind bei Arbeitsunfall oder Wegeunfall versichert, wenn ihr Inhalt und ihre Bedeutung wesentlich – nicht überwiegend – versicherten Zwecken dient.Dienstreisen dürfen nur angeordnet oder genehmigt werden, wenn das Dienstgeschäft nicht auf andere kostengünstigere Weise (z. B. Dienstgespräch, Telefonkonferenz, Videokonferenz) erledigt werden kann; es gelten die Grundsätze der Sparsamkeit, Wirtschaftlichkeit und Fürsorge. Die Zahl der Teilnehmenden und die Dauer der Dienstreise sind auf das notwendige Maß zu beschränken (Ziff. 2.1.9 Allgemeine Verwaltungsvorschrift zum Bundesreisekostengesetz (BRKGVwV)). Die Dienstreise gilt als an der Dienststätte angetreten oder beendet, wenn sie innerhalb der Regelarbeitszeit dort hätte angetreten oder beendet werden können und dies vom Reiseablauf vertretbar gewesen wäre; das gilt jedoch nicht, wenn Beginn oder Ende der Dienstreise an der Wohnung wirtschaftlicher ist (Ziff. 2.2.2 BRKGVwV). Reisekostenvergütung wird nur insoweit gewährt, als die Aufwendungen Dienstreisender und die Dauer der Dienstreise zur Erledigung des Dienstgeschäfts notwendig waren (Ziff. 3.1.1 BRKGVwV).\nKeine Dienstreise ist im öffentlichen Dienst die Abordnung zu einer anderen Dienststelle desselben oder eines anderen Dienstherrn, wobei das Dienstverhältnis zur bisherigen Dienststelle und die Planstelle aufrechterhalten bleibt. Erst recht ist die Versetzung keine Dienstreise, da sie die Zuweisung einer auf Dauer bestimmten Beschäftigung bei einer anderen Dienststelle oder einem anderen Betrieb desselben Arbeitgebers unter Fortsetzung des bestehenden Arbeitsverhältnisses darstellt.\n\n\n== Privatwirtschaft ==\nGeschäftsreisen orientieren sich in der Privatwirtschaft an den detaillierten Normen über Dienstreisen im öffentlichen Dienst. Entsprechende betriebliche Regelungen finden sich meist in Arbeitsanweisungen oder Dienstanweisungen. Hierin gibt es meist konkrete Regelungen darüber, welche Hierarchiestufe in einem Unternehmen (Vorstand, Geschäftsbereichsleiter usw.) welche Kategorie (Wagenklasse in der Eisenbahn, Beförderungsklasse im Flugzeug) benutzen darf.\nTypische Geschäftsreisen bei Unternehmen sind beispielsweise auswärtige Kunden- oder Lieferantenbesuche, Besprechungen, Forschungsreisen, Verhandlungen, Besuche von Messen und Ausstellungen im Interesse des Arbeitgebers, Teilnahme an fachlichen Tagungen, Seminaren oder zur beruflichen Weiterbildung oder Montagen.\nBestimmten Mitarbeitern stellen Arbeitgeber für Dienstreisen Firmenwagen zur Verfügung, die mitunter auch zu privaten Anlässen genutzt werden dürfen. Eine Alternative ist die Gewährung eines Mobilitätsbudgets, das verkehrsmittelübergreifend eingesetzt werden kann. Wenn der Dienstreisende dies nicht selbst übernimmt, werden unternehmensinterne Stellen (z. B. Sekretariate/Verwaltung), teilweise aber auch externe Dienstleister (z. B. Travel-Manager) mit der Vor- und Nachbereitung der Reise betraut.\nAuch steuerrechtlich muss die Dienstreise eine vorübergehende Auswärtstätigkeit sein, sofern der Arbeitnehmer voraussichtlich an die regelmäßige Arbeitsstätte zurückkehren und dort seine berufliche Tätigkeit fortsetzen wird. Vorübergehend ist auch eine mehr als 3-monatige Auswärtstätigkeit, jedoch gelten nur die ersten drei Monate steuerlich als Dienstreise.\n\nUnternehmerpflichtenDer Unternehmer ist verpflichtet, Beschäftigte, die Dienstreisen tätigen, diesbezüglich zu unterweisen. Diese Pflicht ergibt sich aus § 3 ArbSchG und der autonomen Vorschrift BGV A1 (Berufsgenossenschaftliche Vorschrift für Sicherheit und Gesundheit bei der Arbeit). Die Unterweisung muss Sicherheitsregeln beinhalten, welche durch den Beschäftigten vor Antritt der Fahrt, während der Fahrt und nach Abschluss der Fahrt zu beachten sind (siehe Reisesicherheit). Bei besonderen Risiken, z. B. dem Transport von Ladungen im PKW oder im Kleintransporter (Ersatzteile, Materialien etc.) ist der Beschäftigte in diesen besonderen Themen zusätzlich zu unterweisen. Die Erfüllung der Pflicht kann durch Unterweisungen „Sicherheit bei Dienstreisen“, „Ladungssicherung im PKW und Kleintransporter“ erfolgen. Die Unterweisung muss schriftlich dokumentiert werden und darf je Beschäftigtem nicht länger als zwölf Monate zurückliegen. Zudem müssen alle Dienstfahrzeuge jährlich einer UVV-Prüfung gemäß der BGV D29 unterzogen werden. Die Prüfzeugnisse müssen schriftlich vorliegen. Dies kann in den Werkstätten im Rahmen des Kundendienstes erfolgen, sofern der schriftliche Nachweis vorliegt. Über eine Gefährdungsbeurteilung ist zudem festzulegen, ob die G25-Untersuchung (Zur Beurteilung des Sehvermögens von Fahr-, Steuer- und Überwachungspersonal) für die Beschäftigten notwendig ist.\n\n\n== Reisekosten ==\n\nDas Bundesreisekostengesetz (BRKG) definiert Dienstreisen als „Reisen zur Erledigung von Dienstgeschäften außerhalb der Dienststätte“ (§ 2 Abs. 1 BRKG). Die frühere Unterscheidung des BRKG zwischen Dienstreise und Dienstgang ist im September 2005 entfallen. Gemäß § 2 Abs. 1 Satz 2 BRKG können Dienstreisen am Dienst- oder Wohnort auch mündlich angeordnet oder genehmigt werden.\nDas Bundesreisekostengesetz findet nur für Bundesbehörden und Mitarbeiter anderer Behörden nach Bundesrecht Anwendung. Einrichtungen der Länder unterliegen den Landesreisekostengesetzen (LRKG) des jeweiligen Landes. Die enthaltenen Regelungen variieren sehr stark und sind komplett anders als die Regelungen für die Privatwirtschaft.\nDas Einkommensteuergesetz regelt die steuerlich zulässigen Tagessätze von Geschäftsreisen in der Privatwirtschaft.\nDienstreisen verursachen Reisekosten wie beispielsweise Transportkosten (Fahrtkosten für Transportmittel wie Auto, Eisenbahn, Flugzeug oder Schiff), Übernachtungskosten, Verpflegungsmehraufwand und Reisenebenkosten, wenn diese durch eine so gut wie ausschließlich beruflich veranlasste Auswärtstätigkeit des Arbeitnehmers entstehen. Bei Arbeitnehmern werden die Reisekosten im Regelfall durch den Arbeitgeber erstattet, bei dem sie Betriebsausgaben darstellen. Sind die Reisekosten durch den Arbeitnehmer teilweise oder ganz zu tragen, stellen sie Werbungskosten dar. Bei Selbständigen gehören die Reisekosten zu den Betriebsausgaben. Auch die vom Dienstherrn oder Arbeitgeber gezahlten und verbrauchten Vorschüsse etwa für Spesen sind Reisekosten.\nDie Erstattung der Reisekosten von Freiberuflern nach einer gesetzlichen Gebührenordnung in Deutschland wird unter Reisekosten (Auslagen) behandelt. Für Beamte, Richter, Soldaten und Arbeitnehmer des öffentlichen Dienstes (in Deutschland) sind die Reisekosten durch das Bundesreisekostengesetz bzw. die Reisekostengesetze der einzelnen Bundesländer geregelt.\nSind die voraussichtlichen Auslagen relativ hoch, kann der Arbeitnehmer einen Vorschuss zu den Reisekosten verlangen.\n\n\n== Statistik ==\nDie Dienstreise ist ein Fahrtzweck, der von der Arbeitsstätte oder Wohnung ausgeht. Fahrtziel ist meist ein anderes Unternehmen, eine andere Behörde oder eine andere als die eigene Wohnung (Absatzhelfer im Außendienst; Haustürgeschäft). Der Geschäfts- und Dienstreiseverkehr ist ein wichtiger Bestandteil des Individualverkehrs und weist den dritthöchsten Anteil am Personenverkehrsaufwand (gemessen in Personenkilometern) auf:\nWährend der Urlaubs- und Freizeitverkehr zwischen 2003 und 2017 deutlich abgenommen hat, nahm der Geschäfts- und Dienstreisen korrespondierend signifikant zu.\n\n\n== International ==\nEine Dienstreise bzw. Montage liegt in Österreich vor, wenn der Arbeitnehmer im Auftrag des Arbeitgebers die Betriebsstätte oder seinen Wohnsitz verlässt; sie beginnt mit diesem Zeitpunkt und endet, wenn er im Auftrag des Arbeitgebers dorthin zurückkehrt. Für den zusätzlichen Aufwand, der sich bei einer Dienstreise ergibt, erhält der Arbeitnehmer eine Reiseaufwandsentschädigung. Diese besteht aus einem Taggeld und einem Nächtigungsgeld.In der Schweiz wird die Arbeitszeit in Art. 13 Abs. 1 Verordnung 1 zum Arbeitsgesetz (ArGV 1) geregelt. Demnach gilt als Arbeitszeit diejenige Zeit, während der sich der Arbeitnehmer zur Verfügung des Arbeitgebers zu halten hat. Es sind bei der Bemessung der Arbeitszeit weitere allenfalls anwendbare arbeitsgesetzliche Bestimmungen zu berücksichtigen. „Ist die Arbeit außerhalb des Arbeitsortes zu leisten, an dem der Arbeitnehmer normalerweise seine Arbeit verrichtet, und fällt dadurch die Wegzeit länger als üblich aus, stellt die zeitliche Differenz zur normalen Wegzeit Arbeitszeit dar“ (Art. 13 Abs. 2 ArGV1).\nDie weltweit meisten Geschäftsreisen unternahmen 2017 mit 346,5 Mrd. US $ die Chinesen, gefolgt von den USA (292,3), Deutschland (72,1), Japan (63,8), Großbritannien (50,0) oder Frankreich (40,1), verhältnismäßig wenig reisten die Russen (19,2). Der größte Teil der Geschäftsreisen deutscher Unternehmen entfiel 2017 mit 58,5 % auf Tagesreisen, 28,5 % dauerten 2 bis 3 Tage, lediglich 13 % waren 4 Tage oder länger.\n\n\n== Siehe auch ==\nKilometergeld, Kilometerpauschale,\nDoppelte Haushaltsführung, Trennungsgeld\n\n\n== Weblinks ==\n\nSicherheitsregeln und Pflichten bei PKW-Dienstreisen (PDF; 274 kB)\nBeschreibung Reisekosten bei der Wirtschaftskammer Österreich\n\n\n== Einzelnachweise ==", "Die Schulfahrt (auch Schulausflug/Schülerfahrt, Klassenfahrt, Schulreise oder Unterrichtsgang) ist ein Sammelbegriff für Reisen oder Ausflüge von Schülern mit Transportmitteln zu unterschiedlichen Fahrtzwecken.\n\n\n== Deutschland ==\n\n\n=== Allgemeines ===\nSchulfahrten, Schullandheimaufenthalte, Schulwanderungen, Studienfahrten und internationale Begegnungen sind Bestandteile der Bildungs- und Erziehungsarbeit der Schulen. Sie dienen ausschließlich Bildungs- und Erziehungszwecken und müssen einen deutlichen Bezug zum Unterricht haben, aus dem Schulprogramm erwachsen und im Unterricht vor- und nachbereitet werden. Die Teilnahme hieran gehört zu den Dienstaufgaben der Lehrer. Sie können nur durchgeführt werden, wenn sie vorher zwischen Lehrkräften, Eltern und Schülern abgestimmt wurden. Alle Aktivitäten müssen einen unmittelbaren Bezug zum Schulunterricht aufweisen.\nOft organisieren Schulen und Lehrkräfte Klassenfahrten mit dem Ziel, dass sich die Schüler untereinander besser kennenlernen. Dieses Ziel wurde mit erlebnispädagogischen Klassenfahrten erweitert, wozu auch individuelles Lernen/Selbsterfahrungen, soziales Lernen in Gruppenprozessen und ökologisches Lernen zählen. Die Schulaufsicht genehmigt Schulfahrten mit rein touristischem Zweck und Zielen (Strandaufenthalt) im Allgemeinen nicht. Ausnahmen bilden Abschlussfahrten, welche primär dazu dienen, einer auseinander gehenden Klasse einen gemeinsamen Abschied zu bieten. Ähnliche Funktion hat eine Abi-Reise/Matura-Reise, die jedoch oft von der Schülerschaft selbst organisiert wird und deshalb keine Schulfahrt darstellt.\n\n\n=== Arten ===\nZu unterscheiden ist zwischen:\n\nSchülerfahrt: Ist der mit Schulbussen zwischen Wohnung und Schule und zurück durchgeführte Transport von Schülern an Schultagen.\nSchul-/Klassenfahrt: Alle Klassen bzw. eine einzelne Klasse einer Schule verlassen für einen festgelegten Zeitraum (Tagesausflug oder länger) die Schule.\nSchul-/Klassenwandertag:  Alle Klassen bzw. eine einzelne Klasse einer Schule befinden sich an einem Unterrichtstag auf einem Tagesausflug oder Unterrichtsgang.\nLandschulwoche: Aufenthalt für Schüler in einem Schullandheim, Schulsportwochen, Schulskikurse und ähnliche Veranstaltungen.\nMehrtägige Exkursionen und Feldübungen.\nBundesjugendspiele: Die Teilnahme der Schüler ist gemäß einem Beschluss der Kultusministerkonferenz vom Oktober 1979 verpflichtend.\nSchüleraustausch: Austauschreisen über Ländergrenzen hinweg, mit maximal einem Schuljahr („Austauschjahr“) die längste Schulfahrt.Die Bezeichnungen differieren nach regionalem Bezug. Als Transportmittel kommen neben Schulbussen auch Reisebusse, Eisenbahnen, Flugzeuge oder Schiffe in Frage.\n\n\n=== Rechtsfragen ===\nDie Schülerfahrt ist ein Rechtsbegriff, denn gemäß § 43 PBefG gelten regelmäßige Schülerfahrten mit Schulbussen zwischen Wohnung und Schule und zurück als Linienverkehr unter Ausschluss anderer Fahrgäste (Sonderformen des Linienverkehrs). Veranlasser für die Einrichtung der Schülerfahrt ist meist der Schulträger oder die Schule selbst. Schülerfahrten sind mit dem Schulbusschild zu kennzeichnen (§ 33 Abs. 4 BOKraft), die Schulbusse müssen an der Rückseite zwei zusätzliche Blinkleuchten besitzen (§ 54 Abs. 4 Nr. 4 StVZO).\nDie Schule entscheidet über die Durchführung von Schulwanderungen und Schulfahrten in eigener Verantwortung. Die Genehmigung der Schulfahrten als Schulveranstaltung erteilt die Schulleitung aufgrund eines rechtzeitig vor Beginn zu stellenden Antrags. Es ist dabei insbesondere zu prüfen, ob die Veranstaltung dem Bildungs- und Erziehungsauftrag der Schule gerecht wird, ob das von der Schulkonferenz vorgegebene Fahrtenprogramm beachtet wird und ob die Finanzierung gesichert ist. Den entsprechenden Rahmen einschließlich Höchstdauer und Kostenbegrenzung legt die Schulkonferenz fest (§ 65 Abs. 2 Nr. 6 SchulG NRW). Die Schulmitwirkungsgremien Schulpflegschaft, Schülerrat und Lehrerkonferenz sind vor der Beschlussfassung zu befragen. Die Kostenobergrenze ist niedrig zu halten. Bei einer Dauer von mehr als zwei Wochen muss der darüber hinausgehende Teil in die Schulferien gelegt werden.\nIm Reiserecht ist Gastschüler, wer einen mindestens drei Monate andauernden und mit dem geregelten Schulbesuch verbundenen Aufenthalt bei einer Gastfamilie (Schüleraustausch) in einem anderen Staat zum Gegenstand hat (§ 651u Abs. 1 BGB). Hierfür gelten wesentliche Bestimmungen der Pauschalreise, wobei der Anbieter des Gastschulaufenthalts als Reiseveranstalter gilt und für etwaige Reisemängel haftet (§ 651i Abs. 1 BGB). Hierbei ist jedoch umgangssprachlich der Begriff Austauschschüler geläufiger.\nIm Sozialrecht werden bei Schülern die tatsächlichen Aufwendungen für Schulausflüge und mehrtägige Klassenfahrten im Rahmen der schulrechtlichen Bestimmungen als „Bedarf für Bildung und Teilhabe“ gemäß § 28 Abs. 2 SGB II anerkannt. Bei genehmigten Schulfahrten besteht für Schüler gesetzlicher Unfallversicherungsschutz über die Unfallkassen der Länder. Für Lehrer gelten Schulausflüge als Dienstreise, die von der Schulleitung genehmigt wird.\n\n\n=== Geschichte ===\nSchulwanderungen sind spätestens seit dem ersten Drittel des 19. Jahrhunderts zumindest an einzelnen Schulen nachweisbar. So ist aus biografischen Abhandlungen zu Friedrich Fröbel zu entnehmen, dass Schulwanderungen um das Jahr 1805 bereits an der Frankfurter Musterschule üblich waren. Auch in Fröbels erster Gründung, der Allgemeinen deutschen Erziehungsanstalt in Keilhau, gehörten seit ihrer Gründung 1816/17 Schulwanderungen zum Programm. Als Protagonist des Schul-Wandertages gilt allerdings der Pädagoge Karl Volkmar Stoy (1815–1885), der am 21. August 1853 erstmals mit seiner Schulgemeinde von Jena bis zum Großen Inselsberg wanderte. Daran erinnert ein Gedenkstein nahe dem Gipfel.\nDie Kultusministerkonferenz (KMK) hat am 30. September 1983 Empfehlungen zur pädagogischen Bedeutung und Durchführung von Schullandheimaufenthalten beschlossen und löste damit den Beschluss vom 21. Januar 1953 über das „Schulwandern“ ab. In dem Beschluss werden Ziele definiert sowie Hinweise zur Vorbereitung und Durchführung gegeben. Der Beschluss wird in den Bundesländern meist in einem speziellen Wandererlass oder Fahrtenerlass oder in entsprechenden Verwaltungsvorschriften umgesetzt.\nDer Aufenthalt in einem Schullandheim ist in der Regel mit Unterrichtsveranstaltungen verbunden.\nUm Schülern aus sozial schwachen Verhältnissen die Teilnahme an kostenpflichtigen Veranstaltungen zu ermöglichen, gibt es an vielen Schulen einen Schulverein, der finanzielle Hilfe beisteuert. Ist der Schulverein gemeinnützig, so darf er jedoch nicht nur einzelne Schüler fördern. Stattdessen werden Klassenfahrten und Exkursionen für die gesamte Klasse unterstützt. Zudem gibt es von offizieller Seite Unterstützung für die Finanzierung von Klassenfahrten und Schullandheimaufenthalten bei Erhalt von Leistungen nach Hartz IV (ALG II). Diese Kosten werden zusätzlich zur Regelleistung übernommen. Eine weitere Möglichkeit der finanziellen Unterstützung sind die Orts- und Kreisverbände der verschiedenen Wohlfahrtsverbände (Deutsches Rotes Kreuz, Arbeiterwohlfahrt (AWO), Paritätischer Wohlfahrtsverband, Diakonisches Werk, Deutscher Caritasverband), die teilweise Mittel für diese Zwecke bereithalten. Zuletzt gibt es in verschiedenen Bundesländern auch Sozialfonds, die die Teilnahme von Kindern aus finanziell schwächeren Familien an schulischen Aktivitäten unterstützen sollen.\n\n\n== International ==\n\n\n=== Auslandreisen im EWR und in der Schweiz ===\nIst eine Auslandsreise geplant, müssen alle Schüler im Besitz eines Reisedokuments oder einer Einreiseerlaubnis für den Transitstaat, der durchreist wird, und das Zielland sein. Für eine Klassenfahrt in einen Mitgliedstaat der Europäischen Union und in die Schweiz gibt es hierfür ein besonderes Verfahren, das es Schülern, die entweder keinen Pass und/oder kein erforderliches Visum besitzen, ermöglicht, trotzdem an der Klassenfahrt teilzunehmen (Schülersammelliste bzw. Schülerliste). Dieses Verfahren ist bei pass- und visumlosen Schülern, die nicht EWR-Bürger oder Schweizer Bürger sind, zwingend einzuhalten. Drittstaatsangehörige Schüler, die keine Einreiseerlaubnis besitzen, werden an einer Schengen-Außengrenze bei der Einreise in einen Nicht-Schengen-Staat zurückgewiesen und müssen dann dort von ihren Eltern abgeholt werden. Auch bei Reisen innerhalb des Schengen-Raums kann es zu Problemen anlässlich durchgeführter Ausweiskontrollen im Binnenland kommen, wenn ein drittstaatsangehöriger Schüler keinen Pass oder keinen Aufenthaltstitel des Wohnsitzstaats vorzeigen kann.\n\n\n=== Österreich ===\nSchulveranstaltungen sind im SchuUG in § 13 SchuUG geregelt. Dabei sind die Schüler „zur Teilnahme an Schulveranstaltungen ohne Rücksicht darauf verpflichtet, ob die Veranstaltung innerhalb oder außerhalb der Schulliegenschaften stattfindet, sofern nicht.....mit der Veranstaltung eine Nächtigung außerhalb des Wohnortes verbunden ist.“\n\n\n== Literatur ==\nWandertag und Lebensweg. In engagement 3/2001, Aschendorff Verlag, Münster.\n\n\n== Einzelnachweise ==", "Eine Weltreise ist eine Reise, die sich anhand ihrer langen Reisedauer und der Anzahl der besuchten Länder auszeichnet. Oft werden mehrere Kontinente innerhalb von mehreren Monaten oder Jahren besucht und möglichst viele Länder auf jedem Kontinent. Die Fortbewegung erfolgt meist mittels einer Kombination von Flugzeug, Bus und Bahn. Das Ziel einer Weltreise ist es, anstatt eines einzelnen Reiseziels gleich mehrere Länder kennenzulernen. Weltreisende werden auch als „Globetrotter“ oder „Weltenbummler“ bezeichnet.\n\n\n== Geschichte ==\n\n\n=== Wortgeschichte ===\nDer Ausdruck Reise ist als Erbwort der deutschen Sprache schon vor dem 9. Jahrhundert belegt. Das althochdeutsche Wort reisa bedeutete ‚Aufbruch, Zug, Fahrt‘ und bezeichnete somit das Sich-Aufmachen, Sich-auf-den-Weg-Machen und den zu begehenden Weg gleichermaßen. Das dazugehörige Verb lautete reisōn. Erhalten geblieben ist die Bedeutung des Aufstehens in dem früher auf Segelschiffen üblichen Wachruf „Reise, Reise!“, der das Signal zum Aufstehen für die Matrosen bedeutete und heute noch in der Marine gebräuchlich ist. Das althochdeutsche Substantiv geht zurück auf das urgermanische Verb rīsan mit der Bedeutung ‚sich erheben, aufstehen‘ (vgl. zum Beispiel engl. to rise).\n\n\n=== Entwicklung von Reisen ===\nWalter Freyer definiert 1988 vier Epochen der touristischen Entwicklung:1. Vorphase: bis ca. 1850. Transportmittel: zu Fuß, zu Pferd, Kutsche, zum Teil Schiff. Motivation: Nomaden, Pilger, Kriege, Handel, Entdeckung, Bildung\n2. Anfangphase: 1850–1914. Transportmittel: Bahn (Inland), Dampfschiff (Ausland). Motivation: Erholung\n3. Entwicklungsphase: 1915–1945. Transportmittel: Bahn, Auto, Bus, Flug (Linie). Motivation: Kur, Erholung, Handel\n4. Hochphase: ab 1945. Transportmittel: Auto, Flug (Charter). Motivation: Regeneration, Erholung, Freizeit\n\n\n== Reiseverkehrsmittel ==\n\nIn der Regel werden für eine Weltreise öffentliche Verkehrsmittel benutzt, wobei auf weiten Interkontinentalstrecken das Flugzeug seit Jahrzehnten die wichtigste Rolle spielt. Die Luftverkehrsbranche bietet hierfür Around-the-World-Tickets an, mit denen in mehreren Etappen, auch unter Einbeziehung von Überlandstrecken, einmal um die Welt geflogen werden kann. \n\nVor dem Flugzeug dienten nur Schiffe – chronologisch unter Segel, Dampf, bis heute verbrennungsmotorisiert – zum Queren von Weltmeeren. Seit um 1970 ist das Überwinden großer Strecken per Linienflug nicht nur um mehr als den Faktor 10 schneller, sondern auch kostengünstiger. Eine selten genutzte und rar werdende Gelegenheit ist die Mitfahrt auf Frachtschiffen, sei es rein als zahlender Passagier oder aber angeheuert als Arbeiter.\nFährschiffe sind auch heute für den Landweg ergänzende mehr oder weniger kurze Passagen sehr bedeutsam oder zur Aufschließung von zerklüftetem Land ohne kurze Straßenverbindung wie etwa die Westküste Norwegens.\nEisenbahnen spielen je nach Kontinent eine unterschiedlich große Rolle, die Transsibirische Eisenbahn hat jedoch eine Bedeutung der interkontinentalen Verbindung von Europa mit dem Osten Asiens.\nGegen globales Reisen mit eigenem Kfz spricht der hohe Kosten- und Zeitaufwand für die Verschiffung. Per Luftfracht reisen gar nur Rennautos, etwa der Formel 1. Daher werden Pkw und Wohnmobile fast ausschließlich regional gemietet, müssen allerdings in der Regel wieder zurückgefahren werden. Zu überstellende Drive-Away-Cars (häufig innerhalb USA) oder ein Gebrauchtwagenexport in Richtung eines Gebiets mit Bedarf sind die Möglichkeiten ein Auto nur in eine Richtung zu benutzen.\nEinzelne Weltreisen hat es seinerzeit schon mit dem Hochrad gegeben; ein modernes, kompaktes (Nieder-)Rad ist vergleichsweise unkompliziert mit anderen – prinzipiell mit allen – Verkehrsmitteln mitnehmbar. Zwar fordert eine Weltreise per Fahrrad mentale Stärke und Körpereinsatz, doch bringt besonders intensive Erlebnisse und Begegnungen. Menschen radreisen mitunter als Paar oder Gruppe, nicht selten, mitunter auch Frauen, jedoch solo. Wer zielgerichtet radfährt, dem begegnen naturgemäß mehr Radfernreisende aus der Gegenrichtung als solche, die in der gleichen Richtung unterwegs sind und mit dem man sich ohne Kurskorrektur ein Stück zusammenschließen kann.\n\n\n== Weltumrundung ==\nEine Weltreise, bei der alle Längengrade passiert werden müssen, wird als Weltumrundung bezeichnet. Weltumrundungen haben oft einen sportlichen oder sogar Wettbewerbscharakter und werden dann nach festgelegten Regeln durchgeführt.\n\n\n== Beweggründe ==\n\nWährend bei den meisten der genannten Reisearten eine klare Motivation vorliegt, ist sie besonders bei den Weltreisen breit gefächert und wird aber in der Literatur kontrovers diskutiert. Manche Autoren nennen nur zwei, andere zwanzig, die gängigste Einteilung geht zurück auf Claude Kaspar, er unterscheidet fünf Hauptmotivationen:\n\nPhysische Motivation: Erwartung von physischer Erholung und Entspannung\nPsychische Motivation: Erhoffen von psychischer Entlastung und Selbstfindung\nInterpersonelle Motivation: Wunsch nach Erlebnissen Abenteuern\nKulturelle Motivation: Interesse an Bildung und am Kennenlernen fremder Kulturen\nStatus- oder Prestigemotivation: Wunsch nach Anerkennung und Wertschätzung (Renommierreisen)Neben den Beweggründen gibt es die Modalitäten von Weltreisen zu unterscheiden\n\nNach Verkehrsmittel: mit dem Motorrad, Fahrrad, Wohnmobil, zu Fuß, Flugzeug, Auto, Zug\nNach sozialer Konstellation: als Paar, als Gruppe, als Frau allein, als Mann allein, als Jugendlicher allein, als Senior allein, als Seniorin alleinIn der Soziologie stellt man einen Zusammenhang der Reisegründe mit den einzelnen sozialen Milieus her:\n\nDem vom Hochkulturschema geprägten Niveaumilieu gehören vorwiegend Menschen der gehobenen Bildungsschichten an, die insbesondere nach Etablierung im Berufsleben und/oder nach abgeschlossener Kindererziehung („die Kinder sind aus dem Haus“) nun in erster Linie nach Bildung und persönlicher Entwicklung, weniger nach Amüsement streben. Dementsprechend entscheiden sie sich vorwiegend für Bildungs- und Studienreisen und besuchen etwa Kirchen und Museen, aber auch „pittoreske“ Landschaften und Städte. Abgelehnt werden etwa Touristenmassen, Lärm und Unterhaltungsbetrieb.Eher die jüngere Generation neigt verstärkt dem – ebenfalls am Hochkulturschema teilhabenden – Selbstverwirklichungsmilieu zu. Man schätzt vor allem „untouristische“ und „unverdorbene“ Orte „abseits ausgetretener Pfade“. Als klassische Reiseziele dieser Gruppe gelten heute etwa abgelegene Dörfer in Burgund oder der Toskana, aber auch fremdartige Gegenden wie der Himalaya.Durch eine Verbindung von Hochkultur- und Trivialschema ist das vorwiegend von Angehörigen der mittleren Bildungsschicht gebildete und in besonderem Maße zu Anpassung neigende Integrationsmilieu gekennzeichnet. Geschätzt werden erprobte und bekannte, durch eine gut ausgebaute Infrastruktur erschlossene Orte wie etwa die Küsten und Strände rund um das Mittelmeer, aber auch die österreichischen Berge und Seen. Gleichwohl werden in geringerem Maße auch Bestandteile der klassischen Bildungskanons wie etwa eine Studienreise nach Paris wahrgenommen.\n\n\n== Literatur und Reiseführer zu Weltreisen ==\n\n\n=== Literatur über Weltreisen ===\nDie österreichische Weltreisende Ida Pfeiffer, die Mitte des 19. Jahrhunderts zwei Weltreisen absolvierte, veröffentlichte eine Vielzahl von Reiseliteratur, darunter auch „Eine Frauenfahrt um die Welt“. Jules Vernes Roman Reise um die Erde in 80 Tagen von 1873, der mehrfach verfilmt wurde, beruht auf der Weltreise des Amerikaners George Francis Train, der 1870 diese Reise unternahm.\n\n\n=== Reiseführer für Weltreisen ===\nIm deutschsprachigen Raum legte das Bibliographischen Institut im Rahmen seiner Reihe Meyers Reisebücher zwei Ausgaben auf, in denen Weltreisende Beschreibungen von Routen und Orten im Rahmen einer Weltreise durch Asien und Nordamerika finden konnten. Zunächst erschien eine Ausgabe in einem Band 1907. Ihr folgten 1912 zwei Bände, nämlich für Indien, China und Japan (1. Teil) sowie für die Vereinigten Staaten von Amerika (2. Teil), wobei der afrikanische, für dessen nördlichen Teil gesonderte Beschreibungen vorlagen, und der australische Kontinent nicht mit abgehandelt wurden. Dagegen liegt vom Haus Baedeker kein zusammenfassender Band vor. Allerdings beschrieben die Bände Russland, Indien sowie Nordamerika und Canada dem Weltreise-Führer von Meyers analoge Gebiete.\nAufgrund der Informationsfülle für eine Weltreise, die in einem Buch nicht mehr gebändigt werden kann, gibt es einen Weltreiseführer als Buchtitel im klassischen Sinne nicht mehr. Maximal für einzelnen Kontinente werden noch Reiseführer verlegt. Allerdings stellen sich die Reisenden unter Benutzung elektronischer Medien, wie E-Book-Readern, häufig eigene „Weltreiseführer“ zusammen, indem sie die Einzelbeschreibungen der Länder entlang einer geplanten Route speichern und sukzessive abrufen. Alternativ werden von den Reisenden zunehmend Reiseführer-Apps benutzt, die erst auf der Reise vor Ort zur touristischen Orientierung benutzt werden und so auch schrittweise die Information zu einer Weltreise liefern.\n\n\n== Wirtschaftliche Bedeutung ==\nWeltweit ist der Fremdenverkehr einer der wichtigsten Wirtschaftszweige. 2013 lagen die Einnahmen im weltweiten Reiseverkehr bei rund 900 Milliarden Euro bei 1,09 Milliarden Ankünften. Etwa 100 Milliarden Euro davon entfallen auf Europa. Deutschland ist gemessen an den Übernachtungen in Europa eines der beliebtesten Reiseziele. 2014 wurden in Deutschland 424 Millionen Übernachtungen registriert. In Österreich lag die Zahl der Übernachtungen im selben Jahr bei 131,9 Millionen und in der Schweiz bei 16 Millionen. Die beliebtesten europäischen Reisedestinationen sind Spanien, gefolgt von Italien und Frankreich.\n\n\n== Umweltschutz & Reisen ==\nDer Tourismus verursacht nach Schätzungen des World Wildlife Fund (WWF) mehr als fünf Prozent aller Treibhausgasemissionen weltweit. Am schlimmsten sind dabei Fernflüge, die für 17 Prozent der touristisch verursachten klimaschädlichen Emissionen verantwortlich sind. CO2-Emissionen wirken in großen Flughöhen weitaus schädlicher auf das Klima, als die Emissionen am Boden. Viele Onlineportale bieten inzwischen Emissionsrechner an, mit denen man herausfinden kann, wie stark man mit einer Reise das Weltklima belastet. Etliche Organisationen setzten sich für sanften Tourismus und ökologisches Reisen ein. Für Reisende gibt es zahlreiche Tipps, von der umweltschonenden Anreise über Verhaltensregeln im Urlaub (Handtücher nicht täglich wechseln, regionale Speisen bevorzugen, umweltbewusste Hotels auswählen) bis hin zu verschiedenen Qualitätssiegeln zum Thema nachhaltiges Reisen.\n\n\n== Sonstiges ==\nZu einer Zeit als Telekommunikation noch auf Briefpost per Dampfschiff basierte, entdeckte der Österreicher Ferdinand von Hochstetter 1868 den Zusammenhang von Erdbeben und Tsunami weit entfernt von einander im Pazifik. Die Informationen über die Vorgänge im August 1868 erhielt er von Kontakten, die er auf einer Forschungsweltreise 1857–1859 mit der Novara und anderen Schiffen gemacht hatte.\nInterkontinentale rasche Kommunikation kam erst 1866 mit dem ersten dauerhaft funktionierenden Transatlantikkabel nur für Telegraphie, also via Telegramm auf.\n\n\n== Weblinks ==\n\n\n== Quellen, Anmerkungen =="]